{"text": ["This isn't the first time this has happened, even with my ex I used to put effort into creating funny and deep conversations and she'd make quite surface level replies, but I thought it was because she was severely depressed so I didn't mind making an effort with her. Am I missing something? She doesn't have many hobbies and works in a pub so I can't talk about her interests really as the only think she kinda likes is textiles and she doesn't do it anymore as she's so focused on her job. I should probably mention she's really really shy, which she has admitted to me. For example, when we meet in person, she's so nervous that she's physically shaking for about 15 minutes until she relaxes.", "The rare times we have fought in the past, I’ve always had to be the one to ‘break the ice,’ regardless of the circumstances of the argument. I don’t have it in me to go grovel for the comfort I sorely need. Now I’m just trying to cry myself asleep. What’s the point of having a partner if they can’t offer the most basic level of emotional support? Is the writing on the wall - is he just too immature, and how did this parent/child dynamic creep in to our relationship?", "3. I leave fairly often for extended periods for work. On one of my work trips I was gone for two weekends. I trust my BF and don’t mind if he goes out. The first weekend he said he didn’t do anything and just stayed home, yet through my friend’s FB I could see that he added three girls as friends.", "Physical abuse wise my dad had beat me several times, I never really understood that it was abuse until not that long ago, things like hitting my legs together what seemed like as hard as he could, hitting me on the face as hard as he could, threatening to choke me out, etc. it overall made me feel pretty disassociated, I just didn't really understand why though, my relationship with my parents became this extremely hollow thing that felt like an obligation rather than having genuine parents. as I got older from 10 on they became increasingly mentally abusive on top of it, at age 11 my dad found out that I'm trans by looking on my computer and screamed at me for an hour and threatened to hospitalize me (He didnt know mental hospitals wont hospitalize people for it, and might've ended up trying to put me into conversion therapy or something) this is around where my mental health completely snapped, going into 7th grade, hitting age 12, I started becoming extremely suicidal, I thought about hanging myself at school or stabbing myself, it became too much to bear, not being able to be openly trans, being beaten, feeling on edge non stop, feeling completely invalidated to the core of who I am as a person. I became morbidly depressed and stayed that way from then on.", "She already knows the password to my laptop, email, bank account, and phone PIN. I didn't really want to tell her any of those, but I could not think of a reason why not to. When I got a new phone, she set up my new PIN and got a bit upset when I changed it. She said if I had nothing to hide, then she should know my passwords. I don't have anything to hide, so I told her.", "So, my question is how worried should I be about this? Is it likely that this guy will come look for me or cause problems in the future? Or am I overreacting? What would you do if you were in my shoes? Thanks!", "What should i say? **tl;dr friend is struggling with alcoholism and bulimia. She's back in town and wants to hang out and eat and drink. How do I tell her that I will no longer participate in these activities with Her? **", "Do I live in this cycle forever? Is there really no chance for me? I can't even begin to explain how my sibling got out, it was pure luck and they are heavily dependent on an S/O. I feel like I'm grabbing at straws. I've done this song and dance a million times.", "all the sudden all the hate turned against me again (happened often before). She yelled out, whining for her dad, who she called. i stayed calm but was totally clueless about what to do. she started breaking up with me, telling me that she will spent the night at a hotel or somewhere on the street. i shouldnt come visit her at the hospital next week ... blackmailing me basically.", "I just feel really left out by someone who is supposed to be one of my best friends. Is it too late to say something? Should I even say anything at all?   ---   **tl;dr**: Friends threw a birthday party for themselves on my actual birthday, didn't include me as a 'birthday girl' but invited me to the party anyways.", "What if in Ireland a place existed where pollution was zero, crime didn't exist and you where given access to food, warm beds and a chance to rebuild your life. Would you take it? I'm sick of the city, I'm considering a rural life of self sustainability and have adequate means for finding financing to a farm of some sort. Would a homeless scholarship program work for people? Self sustainable life with access to counselling and all food and board paid for help?", "Update - Thanks all, I have calmed down a bit now. Will sleep on it and hopefully tackle with a clearer head tomorrow. --- **tl;dr**: Found out from stranger on Facebook my partner is most likely going to leave me, feel betrayed she posted it on a public forum like Facebook. Right now feeling useless, am introverted and quiet by nature so I don’t have much of a support network.", "Picked music up again and I'm considering the possibility of doing it for the rest of my life rather than science, which is what I've been led by my environment to believe is my \"destiny.\" Even if I am coming to plenty of realizations, I constantly ponder about our relationship, how horribly it ended, and whether I may have done something wrong and how I can fix a bad quality in myself that made things end that way. I just want to forget. Is this horribly written? I think so.", "I just feel kinda gross because I was giving her fucking college advice and stuff. I'm fucking furious. My clearest memory of my dad in highschool is him ramming my head repeatedly into a wall because I didn't want to pick engineering as a *second choice*. And NOW he chooses to support and help this fucking girl through college when I had to do all that on my own? He even skipped out on my graduation!", "It's heartbreaking to watch him get up at night to cry. I suggested therapy but he's not in favour of it. I think his father passing has also altered his reactions, which are out of whack now. I was sick last week and was not in town - he let a couple of dishes fester in the sink, and I discovered when I got back that there was fungus on it. (i.e.", "Well, I've been homeless for two weeks and one day. I'm homeless this time because a woman that I had previously worked for, had promised me, and I quote, \"A lot of hours.\" out in Tampa. I know that with three people, the drive from where I was at, would be worth it. We would make a lot more then what it was cost in gas, so it wasn't a problem.", "When we got to Food Lion, she got out of the car and said, “Your daddy bought you this car.” And slammed the car door and left. She apologized later. New Years eve, my mom (65) gets a call from my cousin (50-60 don’t know her age), the primary caregiver for my grandma, that my uncle (same uncle from earlier) was admitted to the hospital the day before and was ready to be released. She couldn’t pick him up because she lives an hour away. My mom and I picked him up and took him home.", "I am looking for any advice on how to cope being homless in Los Angeles and what sort of services there are out there to help. I am so determined on keeping my job, However, I feel I might not be able to if my check comes in late again and will be forced to spend the weekend on the streets. I have no valid high school diploma as I finished it in Australia and haven't been able to secure my GED due to the time limitations with working everyday and commuting between Compton and Glendale. I appreciate anybody taking the time to read this and welcome any advice. Thanks.", "Hi, I am legally blind. I was homeless from 2007 to 2013 and traveled around the country. That's why I chose the screen name that I did. In 2013 I was able to rent a room in Boston, MA. I lived there from 2013 to about a week ago.", "I have an appointment with a paralegal to draw up a separation agreement. When I tell him I want and am filing for a separation and divorce, he will ask why. Do I mention to him about finding the extent of their chats and the cellphone bills? What about the disappearing IM accounts? Or do I just leave it at \"You had an affair, you aren't being completely honest with me about it, I feel like this 'reconciliation' we are experiencing is just me being strung along till you get your pieces in place to leave.", "* Her, a week ago: Precious, how are you? (I ignored her.) * Her, Jan 1: Happy year precious, happy year love for more years at your side we haven't lived much together but we will stay all our lives to live and it that stays to live. **You are one of the best people I have met in my life. ** You are one of the best people I have met in my life (she says this twice) that you have always been here for everything and you always will be.", "I, too, am loyal to her. My insecurity came out pretty early in our relationship. I was still getting to know her and there was a lot to figure out. It's normal to be insecure in a new relationship, but the problem is that I can't stop being insecure. I feel like my insecurities spiraled out of control and now she is thinking of leaving me.", "Snot. Slobber. Just uncontrollable sadness. I was about to explain to her that we would be back later that night and if she was good, we'd bring her a treat. But Mom just scooped her up and coddled her like you would a 9 month old who was crying because they were a bit cranky.", "She's been doing exams as of late and we've both had some personal problems so we haven't had time to work on our relationship. We both said we would stay together but sort it all out after she came back from a holiday she was going on with her uni. On the second last night she tells me she has kissed another guy and feels horrific about it. I tell her i'm going to leave because she has cheated in hope she realizes what life is like without me (stupid I know). I've always put her needs before mine, i've tried to give her everything and be the perfect boyfriend and because my natural defense mechanism is to retreat into my shell and shut the world out I don't reply to her texts that day.", "I have always told her that if there’s anything she wants to know, no matter how uncomfortable it may be, that I’d tell her I the truth and in return that she would do the same. I repeatedly gave warning that I didn’t think it would help and that it was a bad idea. She said she had to know and I told her that I would but she couldn’t turn it into an issue because this all happened before I even knew her. She agreed. I understand people saying that I should’ve given her space when she asked for it, but I am sorry, that is bullshit.", "I don't know if it was the campground, or if the probably former friend wanted some revenge. All of the hotels are way out of our price range in our area. We can stay a couple of nights, and our reservation at the campground ends this weekend. I will be asking for a refund of the remaining nights. I'm terrified that our kids will be taken from us for being homeless for less than 6 weeks.", "The weird feeling hasn't gone away; but I feel slightly better because I can donate stuff to a kid (completely unknown to me);  his family is having financial struggles. My furniture will go to people dealing with abuse (most probable) and I guess my clothes will too. There's the weird feeling again! :) Anyway, thanks for reading, and I apologize if I'm posting something that's not allowed.", "Why am I being all shelled up? How do I not do that,  and what should I do in order to process and handle my emotions without damaging the trust he is trying to place in me? I know he right now what is needed is for me to be stable,  loving and light. Why can't I do it? TLDR: going through a rough patch where husband was abusive and raging.", "I go to my dealer and get an 8th of weed, go home a few cities over, toke up, and feel relief wash over me, finally being home, away from this crazy Aryan Brother. I didn't hear from him until a few days later, he called my phone, but I didn't pick up... If he's back at that shelter when I go back it's gonna be AWKWARD!!! ! **MORAL OF THE STORY:** Don't help fellow homeless people with rides, even if they're going in the same direction.", "I'm aware I have problems when it comes to dating, I get jealous, paranoid and suspicious very easily. I hate it about myself and hide it from my boyfriend very well. Take for example my bf, we have each other on snapchat, we maybe send one or two to each other a day it's not like a thing we do but it could be, I tried to send him more but it wasn't reciprocated. Yet I always see his snapchat score go up by like 30 or more at a time (I know I shouldn't snoop it just feeds my problems but I can't help it). Anyway I just get jealous that he snaps loads to other people but not me, I don't know who.. it could be another girl.. he never sends a face pic to me but is he to others and if so why not me?", "I’m not living a lavish lifestyle or rolling around in money. I explained to her that if we divided rent based on income percentage she would actually be paying more per month. All this on top of the fact that she turned down a free car. It feels really unfair because I think she blames me for moving us to a “more expensive” location for my new job. So in her mind she shouldn’t have to pay anything more than the dirt-cheap rent I was charging her to live with me at my house.", "I think this is a good conversation to have in person, but I likely won't see him for months. Would it be tacky/wildly unromantic to do this over text/email? Additionally, I don't want to ruin things between us or make things weird, and I'm not sure how to broach the subject. How do I not screw this up?   ---", "etc. - Bob's father is always begging to let my daughter sleep in his bed. He takes opioids to sleep and once nearly died because his stove spilled smoke into the room and he didn't wake up. Bob sees no problem with allowing this. - Bob has been visiting prositutes since he left and doesn't use protection.", "But I really do enjoy being with him and don't want to break up either. Am I being silly? Sometimes I think I'm making this a bigger deal than it should be. I get insecure about the fact that my high school boyfriend is the only one who actually asked me out on a date before we slept together. Every other guy it's always turned out the same- I come on to him, we have sex for a while and the guy maintains he wants nothing serious, then out of nowhere comes on really strong with marriage and kids talk.", "I’m a Canadian traveling in India and staying for a few days at a homestay (paid accommodation). At home I have a beloved rescue dog. Three adult dogs live here at the homestay: one male and two nursing females. The dogs’ body language towards the people who live and work here is positive. The dogs wag, follow people, accept physical affection.", "Did I mention my parents are religious? I don't know if this is normal for religious people to treat. Whenever I tell them I'm terrified of being homeless they tell me I'm a \"acting like a baby\" and \"get over it\" my parents parents did not treat them this way. They're basically mad because they(I guess 30 or 40 years ago were different when they were my age? Because they said they both lived on their own at 17 and that they find it creepy I'm 16+ and they find it creepy being around me).", "it’s the first relationship I’ve been in that feels “serious” and friends comment on how well we get along in public. We laugh a lot and we have the same sense of humor. I have been known as sort of a funny person and this is the first girl I’ve been with in a relationship that consistently makes me laugh hard. Plus she is very caring and sweet, a good friend. We have not had a serious fight in a long time, maybe more than 3 months.", "Do I just need to forget about the \"dumb girlfriend\" incident and stop assuming that he thinks I'm stupid? And how do I do that? Help! tl;dr Because of an unfortunate incident earlier in our relationship I sometimes have a hard time believing that my boyfriend thinks I'm smart. How do we navigate this?", "I'm going to try not to sound too sad or victimized, but I'm just sad. I grew up fairly disadvantaged compared to my friends. I've been poor since I was born, never had enough to eat, was abused by my dad, have raised my sister, support my family, work almost constantly, and make money on the side. In addition, I've been consistently abused since I was 8 years old, the same age I met my best friend. She's much wealthier than I am.", "I’m trying to get into Freelance writing, but these libraries want physical original ID’s, so I’m doing everything by phone, which is now also hard to do… because of charger thieves. Ugh. Times like these generate negative attitudes towards the world, and myself. The fact that noone has the time and patience for me just makes me wonder if I’m a piece of shit. No.", "But we didn't talk about it the morning after, and life went on. Over the next year, we would continue to stay up late at house parties or whatever the occasion was (until 3, 4, 5 AM) about once a month, and just talk and talk and talk, until we inevitably hooked up. Keep in mind he was still dating someone else. Eventually during one of these moments, I worked up the courage to indirectly get a pulse on his feelings. More or less, he said he thinks about me multiple times a day, which was different from anyone else he \"dated\" prior.", "While my friends and myself included, have high hopes that this will work out, I’m petrified because I am putting my feelings on the table. I’m going to be so damn vulnerable. While he’s expressed and shown signs that he’s just as into this as I am, if not more so, I’ve also never done this before. I’ve only been in 1 (college) relationship before this, followed by 3 years of singleness and ultimate casual fuckery. I know my feelings for him are real and I owe it to myself to fight for a chance of a relationship with someone I feel so strongly for.", "He would tell me it was the best university in the world(a white lie) and how great it was. I didn't want to go there. I didn't aid in the application process at all. He did everything. He wanted me to go there because it was cheap, and he assumed that if it were otherwise either i would just do nothing or spend a lot more money on school than he'd like.", "I would like to have a relationship with his parents in the very least and let them actually get to know me, but he really doesn't want to introduce me to them. It's important for me to develop a relationship with my SO's family, especially if we intend on being long term. I don't see how we can continue our relationship like this. My question is, what can I do to improve the situation? What conversations do I need to have with my BF?", "I can hardly step into his room because that is where it is most concentrated. I love keeping a clean and nice smelling apartment. I don't mind doing extra cleaning and buying extra air fresheners to keep it that way. However, Matt's BO literally follows him around and lingers where ever he goes. This has cause our ENTIRE apartment to smell of testosterone and mildew in a matter of days and it's only getting worse.", "I called my boyfriend, and I just ranted at him. He was shocked. I've never spoken like that about anyone. I wasn't even thinking about what was coming out of my mouth, and I just called her all these names and said all these horrible things about her when she isn't a bad person! How the hell do I get over this?", "She also said that we may not be sexually compatible, and that its unfair on me if I stay with her and put up with it. I obviously told her I don't want to break up and she doesn't either. I offered her time alone and she was so unsure in herself that she didn't even know if she wanted to take me up on the offer. I said that I think we should wait until your appointment in March to freeze your ectropion, to see if that improves your libido. We ended up crying and cuddling each other.", "I realized he is not very nice or smart and totally unwilling to cooperate/compromise. I wanted to leave but he had spent all my money (promising to give it back haha) and I had nowhere to go. I had the baby (he went out to eat with his mother while I was in unmedicated labor). Basically I made one stupid mistake after another and let him walk all over me and it doesn't stop there. I took care of the baby all by myself for 6 months.", "Until just a bit before I decide to move to that other city I've been thinking about moving to, I guess. Actually, I was told that it's cleared by cops every month, and I remember a flashlight being shined on me last month when I was too stoned to completely wake up (at least not so slowly) or to see whether it was a cop. Maybe it's the right kind of cop and I look the the kind of person they don't feel any need to bother for being here. This is more of an /r/randomthoughts post for me, but I'm putting it here because it's relevant.", "The only person I live with is my husband. So basically she's trying to imply that I'm mad because my husband is abusing me (which he never has), not because I'm just sick of her shit.   ---   **tl;dr**: My alcoholic mother is a negative aspect of my life but she's guilting me into feeling sorry for her. I don't know what to do.", "Sister kicked off because she wanted to come to. It was a couple type thing and all of us were bringing a SO or a friend (if one of us didn’t have a partner) even if it wasn’t, I would have just wanted it to be Harry. As I don’t want his sister clinging on to us every single time. Harry asked me if she could come too because “it so unfair that you are isolating her like this.” I stood my ground and said that please can he just come. He said no.", "No, not really. I thanked my boyfriend, and then immediately blurted out \"how am I going to explain this to my mother?\" Like I said, he's understanding, but I could see him kinda wince as he probably realized that the gifts brought me more anxiety than happiness. **I spent the next half hour desperately thinking up backstories I could use to explain to my mother why I had a brand new hat. **", "She embarrass him in front of others. Last weekend was really what made me decide to write this. Jay, Marie, me and the husband were at another couples house. We were drinking and playing board games but Jay had to work the next day so he stopped early. Marie starts taking this personally for some reason and then says to all of us that he’s “always ruining her nights out”.", "until i met my new boyfriend, he is amazing, he is kind, he is sweet, he is a good student, he likes the same things as me, my family likes him, and so on... but i dont feel that passion that rush i felt with my ex, the truth is that when i started going out with my boyfriend i secretly saw my ex a few times to see if i really didnt feel nothing for him, but it was disgusting, i didnt even want him to touch me, i feel bad with myself i didnt want him, but still, i was there. then i kinda realized i felt nothing love related for him and it was ok, HE was HURT when he knew i was dating this boy and he even begged me to stay but of course not. but now the problem is that when im with my boyfriend i dont feel like i love him, like that thing you kinda have to feel with a new love, i just feel \"ok\" with him, and i catch myself thinking about my ex from time to time, remembering all the good things we had and it drives me crazy because i know that if i see him again i wont feel that way, that \"love\" that my mind makes me think stills there. and recently i found out that he has a girl and he is actually enjoying the experience and i got so mad and so hurt (i know i dont have any right to feel that way) i felt betrayed and I STILL feel that way, i gross myself out.", "Engagement rings. I've been thrilled about the thought of being married particularly in the last 2 years. To be clear, I have a strong dislike of diamonds and the entire idea of an expensive ring or wedding. All I wanted is a cute and unique ring below $200 at the most. I told him all of this and waited... and waited.. and waited.", "\"Fuck you bitch, I can make your life hell and get you kicked out of here. I manage this place when the owner is not around\" Needless to say that is all a lie from him, He is here from DSS/Social Services just like I am. What I am worried about is my safety and security. This guy is obviously mentally ill and a drug addict and alchie, and now I am really concerned that he will do something to me because I stood up to him and his nonsense bullshit.", "I was home for winter break, and I didn't see him at all during that time. My issue revolves around me feeling insanely guilty anytime I'm out with him, anytime he buys me things, etc. It's like, I hear my mother's voice in my head and she's yelling at me for making bad choices, telling me I shouldn't be wasting my time with a loser like him, that I'm a lowlife, etc etc. To clarify, I'm a goodie-two-shoes. I never did anything \"bad\" until I was in my early teens.", "I was feeling sick, I had work to do, I was tired, and all I could do was shout that I didn't want to be so close to the next step and get slingshotted back because of something I didn't know was coming. I know it's my fault. I know I should've been more careful, been more prepared. But I can't do this. My boyfriend has been begging me to keep the baby, and it makes me feel torn.", "Also, stemming from the same background, I am still a virgin (he obviously is not) and I’m not quire sure how I feel about engaging in sexual intercourse with him. Whenever we “talk” about sex, I feel like I’m lying about how I feel. It’s more of an interest in learning the different aspects of sex than actual sexual arousal (I’ve been questioning the possibility of asexuality). If anything, I feel kind of giddy that someone thinks of me in that way but not in the “I want to have sex with you” way. I’m trying to engage him with pictures/videos/etc., but it feels all fake to me.", "A few weeks later, i found out that he had had a long term girlfriend the entire time. I felt like such an idiot when I found out. He reached out to me last month and I told him I knew he had a girlfriend the whole time and that if I ever saw him again I would literally break his nose. I'm still furious about it. I'm angry that he thinks he pulled one over on me and that he got away with it.", "So long story short I’m currently a freshman and my mom has made it clear that I’m being kicked out before the start of my sophomore year. I plan on making my way to New York City and living on the streets while looking for a job under the table. I am hoping to find somebody willing to hire me for a construction//landscaping job. My goal is to save money while going to high school, so that I can get my diploma and start a career in law enforcement. Of course my mom didn’t think to take note to save anything such as my birth certificate or the like...", "I will be homeless in June and need a place to sleep safely or else I will suffer more severe mental distress, becoming unable to think properly. I went to a shelter organization and the CEO told me they have waaaaaay more homeless than beds (like 50000 homeless and 11000 beds or something like that). While I was there a lady came in to complain about a rape. I involuntarily cry in noisy, busy, crowded environments and become unable to function. How can I help myself best in the leading months?", "Need to make a move now or never Update: I texted her more about it and she forgot about what happened until I reminded her! She said It’s not off the table, she just felt braver yesterday due to the liquid courage. So I just asked if she wants to hang one last time, maybe go somewhere like we did last time and have a drink and listen to music. And if something happens or doesn’t happen it doesn’t matter.", "I asked him how he's doing to fund this, if there are any bursaries and if so, how much these are, but he never gives a clear answer.   ---   **tl;dr**: Boyfriend is unemployed, looking for 'perfect' job until he starts his Medicine degree, unsure how he will fund this degree. I resent him for poor financial judgement and day-time chilling. How to change this?", "And it may be a bit out of context, but I do have to thank my 4 best men for being here with me all the way, I couldn’t do this without them. Finally, we are here at the present day. It’s been 2 years since we broke up. My ex still hates me with a burning passion, but I have learned to ignore it and have mostly moved on from the experience. I don’t hold any sort of animosity towards her, but I have had the tendency to start to drift off and start pitying myself and reflecting out loud a bit too much when in conversation with my dear friend.", "I'm curious, does anyone know of any programs that provide temporary housing assistance if you have a job? I'm almost broke right now. I really don't want to live out of my car or the shelter while working. Having a comfortable supportive place until I can get my first couple of paychecks would be amazing. I'm worried that my current living situation will ruin my chances to succeed with this job.", "I was very excited to go back to live in the street but that meant, abandoning my girlfriend. Wich, I had fallen in love with, deeply in love. She was a University graduate, came from an outstanding family, she learned to play the piano and dance Ballet at a very young age. You see the type. But nonetheless she liked me, and I liked her.", "I am not even sure what to say. My girlfriend was really, really mad. Not at my family, they're just basing this off what they hear, but at my sister. And honestly, I am really mad too. What the fuck could she be saying about me?", "I agreed and the four of us had dinner and I dropped them back home to Kate[18F]'s house where they were staying the night because her parents were not home. As I was pulling away Jamie[17F] ran up to my car and asked me if I wanted to stay the night with them, at first I was hesitant but I eventually agreed because I thought other guys were coming round. It turned out the other guys couldnt make it and it was just me and the three drunk girls. I asked Kate[18F](it was her house) if I could get some MDMA and drop it tonight and she agreed if I got her some. I drove us to the bottle shop where Jamie[17F] got her friend to buy us some more alcohol and went to get the MDMA which me and Kate did while Jamie and Sophie just drank.", "But I was feeling more and more lonely... like I couldn't trust or rely on her. It was tearing me to pieces and I was always anxious. Finally, after a breakdown I had on christmas over my fears and the lack of help from my partner in healing from this, she broke up with me. I went home the next day and we haven't spoken since. I've been devastated.", "She talked sarcastically about how my life is \"obviously so horrible\" and I'd say \"yeah, mom, it is.\" She denied yelling at us all the time, and said that if I can say she yells all the time then she can say I yell all the time too (at my little siblings), which is just not true. I am nice to my siblings, excluding today where I was angry at everything. But I still didn't yell at them. She said that for months I've been terrorizing her about this \"yelling thing\" and how I think that one small mistake automatically means someone is a bad person.", "Hey all! I'm in San Diego CA and about 2 years ago I was diagnosed with lupus nephritis. I haven't had the most stable care and have had to move all over the country just to maintain safety. Most recently, my mother who I have a very rough (to say the least) relationship with said she would help take care of me financially as I cannot work right now. Well for some reason this last month my mom just stopped paying my rent which led to eviction.", "She then decided to go to a party without me and said \"I would cancel my plans to see you, but you won't do the same for me. All you do is push me away and act like a complete asshole.\" even though she was the one who left. I told her I didn't want to see her tonight after she tried to bait me into going over to her house. She was telling me I'm an asshole and the cause of all of her sadness, why would I want to go there?", "She has been cheated on after being married and while pregnant and about to have her baby. She has been gone through it and knows how it feels to be hurt and lied too and said she will never do it to anyone as she’s been through it and is the type of person that wears her heart on her sleeve. I completely trust my husband but this is harder then I thought. Hard because I see her messaging him everyday day as soon as she wakes up and stays talking to him on the phone too. Hard because they still want to see each other.", "Okay so a bit of background, me and my girlfriend are in our second year of college (my subjects make a freshman though hehe) and have been together for 6 months. I want to be an ambassador and she wants to go into marketing. Every day we spend time together, there isn't a moment where the two of us don't end up talking about our future. To be more specific, we always end up talking extensively about marriage, what to name our daughter, how many golden retrievers to get and the like. Don't get me wrong, I love her to bits and I enjoy talking to her about these things, it's just that I'm slightly worried that maybe she is in love with the idea of me, and I with the idea of her.", "and then proceeded to show me the video of the \"dumb girlfriend\" struggling to answer the question. Needless to say, I was pissed. I said I couldn't believe he would think it was possible that I might be that stupid. He insisted that he only asked me as a joke, and then I got angrier because in what world is questioning my ability to handle basic logic funny? He continued to go on the offensive insisting that he had been kidding, that of course he doesn't think I'm stupid at all, and how could I even think he would think that?", "Normal start of our day. He asked \"was the card worth the wait?\" I answered \"Yes, I cried, at the park\" he jokingly said \"of course you did, tiny tears x\" and then he asked \"did you take photos of the chocolates?\" I said \"yes babe\" and sent him the photo - he was still online but the last 2 messages wasnt read. The next message i sent was all about my day - that wasnt sent anymore, he was offline... i thought he was getting ready for his work and his phone died or his network... after an hour, I got worried, so I sent messages on all social media that he has, which I know.", "It was no longer just about the life and love we were building together. It was no longer about us, it was about me and trying to fill this hole within myself. If she would just want me, make me feel wanted, I could baptize myself in it and finally let go of all this guilt and self-hatred. This male shame. It’s complicated.", "It's been a while so I thought those feelings were long gone. At one point, I asked if Lily would come talk to me in my room, which she agreed to. In there, we made out. I don't remember a ton, but I do remember pulling away and immediately telling Lily \"oh my god, I can't believe I just did this.\" Like a drunk idiot, I called my boyfriend.", "She was already against smoking weed after college at first but now she seems to have moved to a stance where she's okay with me smoking weed as long as she's there when it happens, as in I could smoke with just her or when we're both hanging out with the same friends. I've tried asking her about it and genuinely understanding why she feels this way about it but she can't seem to describe it rationally, saying that it's a gut feeling that she gets that legitimately bothers her and gives her anxiety. She seemed very distressed talking about it and was almost at the poiint of tears saying that she wishes she knew why it bothers her so much but it does and she can't help it no matter how much she thinks about it or how much I try to explain it to her. I don't know how to explain this to her. I don't want to give up the option of smoking weed with friends but I don't want to break up with her over something like this because I love her.", "My girlfriend and I have been dating now for 3 months. We have a very happy relationship most of the time. I love her and she loves me and we spend almost all our time together. She can be insecure at times and has a couple mood swings where she can be very happy to very upset. I do my best to bring her out of those slumps and usually I do.", "But I'm literally afraid of him because I feel like every second he's gonna stand behind me again and grunt at me that he changed something or completely rewrite my code. Plus, I don't know if maybe he is talking badly about me as well when I'm not there (it seems likely). What can I do?   ---   **tl;dr**: Coworker who is supposed to show me the ropes is super grumpy and I find him intimidating, can I do anything about this?", "But upon second look, it can become apparent. It is hard to convey people's attitudes in a reddit post, but you can tell from people's vibes if they're being nice (and yes, that happened a lot) vs. if they have ulterior motives. So, maybe not the best reddit post, but don't think you can judge what happened based only on a cursory impression from the post. Besides the larger point is that the prejudice is rampant, whether or not you like my example. That's the larger point.", "I love her too, but I am super paranoid about the whole deal. Current situation: We both confessed that we love each other, but I won’t be going back to my home country for another 6 months. Because of my past toxic relationship I fear things will change between us, we’ll get into fights/have trust issues etc. Problem: Should I get into a LDR with her, or we should continue being best friends( which would be hard because she has already very clearly confessed she loves me) problems are: 1.", "I want to start off by saying I love my in laws. They do a LOT for us and we are incredibly grateful for them. My MIL has always been around to babysit when I’ve needed to go to doctors appts, and seeing that she has MS (not severe), my SIL comes over to help play/do the lifting. My mil is capable of all of that, but she has a harder time. We have a history with my SIL.", "I’m also quite intellectual, I can speak 2 languages other than my native language, English and Japanese. But I only want my boyfriend, he has a shy personality but he’s very knowledgeable, he’s like a walking Wikipedia and I love him so much. He makes me feel calm just laughing at our inside jokes, receiving a cute text from him, and ever since being in a relationship with him I’ve grown to be happy with the smallest things in life. But he never seems to be able to move on from the event from his past, or he‘s just deeply affected by his depression and negative thoughts, also all the stress from his studying in university and family really is a big problem. All of this really took a toll of our relationship, to the point that we hardly called anymore or had any communication.", " We've known each other for 9 years, were FWB for about 3 years, then moved into the committed monogamous relationship we're in now, and have been in for 2 years. I've really enjoyed everything about our relationship, as she's taught me more than anyone ever has, and has been the best at putting up with any and all things that have come up. About halfway through the first year, she began asking if I'd ever be okay with her experimenting with a girl, or if I'd ever consider her having other sex friends. She doesn't want serious relationships with them, she only wants to bang. Having never been asked that in any of my previous relationships, I told her I wasn't sure and that were I ever 100% on board with that idea, I'd let her know.", "She Actually gave me 2 months to find a place to live before she was gonna kick me out but i couldn't find any and Friday is the last day of those 2 months. I don't have a car, or any friends that'll let me stay with them. In total , i have about 600 bucks . Maybe i could use that money to gtfo of Minnesota. Maybe i could buy a gun and shoot myself idk .", "It's also frustrating because I'm finally getting the kind of help I would expect from family and BEYOND from a woman I met while panhandling this summer. Thanks to a stranger: I've been able to finally get mental health assistance, I got my benefits fixed, I got a job, and I have a safe place to sleep out of the rain or snow. I have somewhere to leave my pack and bed roll rather than carry it around 24/7. I could probably ask to store that stuff, but it seems so asinine to ask more of this woman and especially so since it's just extra supplies for my dog I don't really need. I can't understand why even the bare minimum is too much to ask of the people who are supposed to care the most.", "Hi. So, my husband is emotionally and mentally abusive. I've tried to leave several times but he threatens to kill himself if I do, by crashing his car or running into traffic. However, I have nowhere to go even if I do. My family dosent want/can't afford to have me live with them again.", "I have tried to her encourage her as best as I can. The job she had was 10 hours per week, which I got for her to tutor a friend’s 10yr old (who is a challenging child). She has an events business with her mother, which operates approximately once every six weeks to host mystery dinners, which is very popular, but does not make much funds. She spends a large amount of time on this and I get frustrated that some of that effort could be put into finding more stable work. She studies one unit a semester.", "I’m just really scared about this entire situation and feel conflicted about what to do. This isn’t the first time something like this has happened as my dad has previous jail records and he’s threatened our family before and even hit us when we were smaller. I just feel really scared and really confused about everything and can’t believe it’s come to this. My mom doesn’t want us to do anything because she lives in fear and is hoping to wait until I graduate (I’m in 11th grade so we would have to wait a year and we really can’t/shouldn’t) so she can divorce him, she only wants to wait because she can’t support us by herself. If we do move I would be fine with getting a full-time job to support my family, I’m already a private tutor but I only do 1-hr a week for $20.", "i have asked for her patient while he gets trained, but i understand her not wanting to potentially move into an  environment that disturbers her normal way of life, but thats 6 months from now. I am confident that training would fix 70% of the issues that she has with my dog. Could there be something else deeply underlying that i am missing? To me a loving and healthy relationship is one that can come to compromises and that are no winners or losers, but agreements in place to help solve issues TOGETHER . If she has trouble with compromising on a proper solution now, what will happen when it comes to or much larger life decisions like buying a house or moving to a new city.", "For example, she told me I was too stubborn. This is definitely true but she criticized my political opinions, my social behaviors, and my pop culture opinions in addition to just my relationship with her. She also constantly mocks me when we fight, literally repeating my words back to me in a childish/cartoony voice and putting words in my mouth. She refuses to listen to my point of view. We recently got into a fight where I thought a Christmas present my father had gotten me was cheaper than it was.", "Many of my cohorts asked me \"how are you two even friends?\" when he came to which I couldn't give a clear answer. So in short, we have a business license and agreement we both signed. We were friends, but I think time has changed him and I and I don't think we would be friends if we met today. He isn't productive for the business and his practices many times seems to include emotion and his own self interests rather than the business, so I find him unfit as a business partner as well.", "Perhaps as a result I feel awful about wanting more from him, I feel like it's incredibly ungrateful of me because he does do so much good for me and is really good to me in so many ways. Especially with my depression and stuff he deals with a lot of household stuff in addition to working way more than I do. I feel like shit for writing this post. **TL;DR - SO of over a decade is great to me in many ways and shit to me in other ways, I feel awful when he's shit to me but also feel guilty as fuck about expressing it because of all the times he's amazing to me. Wondering if this is emotional abuse and if it is, what can I do about it?", "And after every episode with them he treats me like shit for a couple hours at work I assume wondering if I know about his behaviour and if I’ll say anything. I completely ignore it and refuse to let it invade our work environment. It’s my world, and my people, and I’m his superior. He’s not going to win a power struggle, so I don’t even have to worry about it. Other days we get along fine from 9-5.", "This has *obviously* created some crushing tension in the apartment, with no one really having to go other than work during the day. (We've all recently moved to the area and don't really have family/mutual friends to stay with.) Flash forward to last night...I'm asleep on the couch and she comes in at 1AM, blackout drunk, shakes me awake violently to tell me of the Tinder date she just got back from and how awful it was. But the guy she had sex with last night was pretty good, etc. This goes on and on, turns to threats of violence against me for uprooting and throwing her life into whack.", "I do take a bath with febreze and alsobtake care of my teeth with toothbrush, toothpaste, floss and mouth wash. As for food, I go to the Dollar Tree (or any other store) and only buy $1 items like chips, canned goods with an opener, big bags of popcorn, etc and keep a lot of shopping bags to be used for trash bags. For drinks, luckily for me, there's a $0.25 soda machine beside the store. I also sign up for points cards cause they are very important for me to use later on. When I clean, I go nearby one of those vaccum stations, take the trash out, vacuum the mess I made, and spay febreze everywhere.", "This Crippling Pain Is Getting Stronger. Cant, you see I cant do this much longer This Fearless drip, The subconscious Tears. Hope someone Can see my Fear.", "My girlfriend has been under major strain since last year when took a new job, she has been depressed and has mood swings for half a year now. She has always been inverted and melancholy, but I feel that the new pressure has pushed it to the verge of disaster. I tried to talk to her, but she responded negatively and she had not done anything to help. In recent months she has said that I am depressed and need help. She told me that I had a symptom or another when she was actually symptomatic.", "I feel like I have the worst luck with everything, but maybe that's just bias. I feel like life has dealt me a short hand and I feel so guilty saying this because there are people out there with lives far worse than mine. Walking is painful, talking is painful, I don't know what to do. I just want everything to end. I just want to rest and not have to struggle.", "I have to first start off by saying my voice is not high-pitched. My inflection occasionally goes up, especially if I'm excited about something. I'm sort of expressive with my hands while talking, though I don't think more than anyone else, male or female. She tells me this is the only thing that is making her doubt our relationship. A little background: this has been an issue with her for her last several boyfriends.", "Please tell it to me JNMIL, I just don't know what to think any more. Am I unempathetic? Am I in a JNMIL situation with a FH who can't be helped? **TL;DR** My fiancé has banned me from asking questions about his relationship with his mother, after I questioned the need to visit her for the fifth time in five days (4x+/week since we moved in together). Edited to add: I have often turned up and helped.", "I started talking to a girl, 'J', on Tinder about a month ago. She's funny, attractive and quick-witted, however she was apprehensive to meet up for a drink to get to know each other in person straight away. We are both from the same town (we matched over Christmas) however she lives an hour and a half away in a much larger city. She first claimed that she could not afford to travel to see me even when she was back in my town (she also refused to let me pay for anything involving her, including travel to her city to meet her), however said last week that she did not want to meet me until she knew that I was genuine about her, and wanted to talk on the phone every evening for a week. If I did this, then she would meet me on the day afterwards.", "Every single day I'm getting fb messages from her saying a combination of the following: I'm feeling sad,  I'm ugly, I'm fat, I'm scared you aren't attracted to me,", "I thought a good post for people who get Food Stamps (EBT) is needed in case anyone who receives them could use it. For example; Peppermint and Eucalyptus Oil keeps Mosquitos away, you can buy that with EBT. Vinigeer is a good cleaning agent. You can buy Papa Murphy's Pizza with EBT and cook it over a bonfire. Some states (CA, AZ, etc) will let you buy food from fast food like Captain D's, Arby's, etc.. with it.", "But what do I know? I keep reassuring myself that this is normal, and never tell anyone about this - I'm surprising one of the top students at a selective high school, but I really want this to end. I'm good at hiding things like this, because I don't want others feeling pity for me for things they didn't cause or can change.   ---   **tl;dr**: Older brother psychologically and physically abuses me and my younger brother.", "I’m definitely keeping the child. We don’t own our house so will just go our separate ways. I’m totally open to him being part of the child’s life if he wants. I know he would be a good dad despite him turning out to be a terrible husband Thanks for the advice guys.", "My bf and I went to his parents place in Iowa over Christmas. Over the years, I have always known that his parents don't absolutely love me but I didn't realize that they actually dislike me until this time I visited them. His dad is a difficult person to begin with, which is well known by everyone and he kept making little jabs at me and insulting me. For example, he asked if I am a citizen and how long I have been one, I mentioned that I have never watched Harry Potter and he \"jokingly\" asked me if I was busy clubbing and talking to boys and doubted my upbringing, and when I was using my bfs phone, he asked me why I am using it and if I am reading his texts. These are just a couple examples and there are many more.", "come up and live with us and she'd leave me alone with him, wasted out of his mind, while she would be with her boyfriend (who shes now married to). Eventually I moved back with my dad and everything was fine. I'd call and talk to her and she sounded like she had her life together. Well then they broke up for a short period of time, and she moved to live with her half siblings. She would drink excessively, and call me and cry about her life.", "How do I stop this without getting myself blacked balled or dealing with this harassment. TL;DR I broke up with my ex who cheated. I've been getting harassed by ex-girlfriends sister at my job. She holds a lot of weight in the company and her behavior has escalated. How do I stop this without getting myself blacked balled or dealing with this harassment.", "I want to know about your story, how you got there, struggles you never realized you would face (as well as how you dealt with the ones you already expected), how you got out of it (if you did). Anything and everything you think might be relevant for me to look into. You do not HAVE to be a singer/musician to reply. Every story is worth listening to for me. If you're in NYC and can meet in person, that would be amazing as well.", "How should I feel after all this? Because I feel like I was used and treated poorly, which she rejects. Also how should I read into her getting annoyed about me being with other girls? If they break up again (this is their 3rd attempt at making their relationship work), should I be there in the same way ago? As much as I like to think I wouldn't I still really love this girl.", "We kept in touch the entire time (and he'd always seem to want me desperately, even telling me things like \"I can't wait to see you as soon as I'm back\"). But when he got back, he didn't see me right away. And despite my asking him a couple of times (like, two or three), we didn't see each other for nearly two months. Eventually, I literally said \"So are we ever going to see each other again or is this just over?\" He responded by immediately asking me on a date for that week, at a nice French restaurant near his place.", "At the same time, I’ve been going crazy because if I’m not thinking about something else I’m thinking about him and various kink related acts. This isn’t anything I’ve actually experienced before (hell, I still don’t get attraction), so I’m confused. My issue is, he’s going back overseas for uni in a couple of days, and we’ll be seeing each other (in our larger group) tomorrow. Should I bring something up? Should I just leave it?", "   When we had our first fight I did EVERYTHING I could to gain her back in my life. I quit smoking cigarettes because she went on a \"I hate all drugs and anything smokable\" rant. I tried to be more mindful and kind because she said I was the opposite. I tried to change because I wanted my best friend back.    4 months later she let me back in and I was so fucking happy.", "Do I ask the boss (who’s like family to me) to not bring him back once our coming winter layoff is over? How do I continue to stay sane while seeing this guy who is abusive to my extended family and completely absent with my immediate family while telling our friends he’s a happy uncle?   ---   **tl;dr**: SO's brother works with me. He is abusive to SO and her family and won't acknowledge pregnancy.", "But it can be done with any white van. Also I’ve seen taxi logos on smaller vehicles work. Just have to be creative and smart and think about what companies start early or work all night. I see posts about trash building up and it becoming hard in a small vehicle. I slept with my girlfriend in a Hyundai Sonata for 9 months.", "“Either be my girlfriend or be out of my life” my fwb told me. I refused to be his girlfriend so of course, now we’re strangers. It’s breaking my heart. I want him in my life so badly, as a friend that is. We had a wonderful connection that’s hard to come by (at least for me) and I hate to lose that.", "I (A Minor Male) am posting onto this subreddit, because My girlfriend's (A Minor Female) family has gone through a 'break-up' and an unwanted 'reuniting' of sorts. We'll call My girlfriend \"Linda\". \"Linda's\" immediate family consists of Her mother, Her grandmother, and Her sister. The most notable interaction that the Father, Bill, had with the family was drunkenly banging on Linda's mother's window *early* in the morning. Bill walked out for reasons unknown to me about 16 years ago after the birth of Linda .", "I can't afford rent and my student loans on my income. Im planning on going back to school in Houston since UH is about $8500 a year for instate tuition which I can convince myself I can afford. Im just so sad and disappointed. This was never how my life was supposed to be but when your mom who's financially irresponsible (lightly put) and lets you go to a school that is $150K without even knowing it, I was basically doomed from the start and this is now my reality. Maybe Ill just kill myself before then so I don't have to face this life, because this has become too much to handle.", "My girlfriend and I met through a messaging app. We come from the same country and speak the same language, so there is a sense of familiarity and closeness right from the start. However, as we grow closer, I'm starting to feel like she does not value our relationship as much as I do. I always put her above all else. I always try to find ways to accommodate her busy schedule.", "I’m very concerned that I might never be able to put a condom on, last in bed or satisfy a woman with my penis. The girl was very satisfied and even exhausted and she said that it was the most times she cums in one night and that the previous guys just stuck it in and thrusted ( which I’m secretly jealous honestly since I’m concerned that I might not be able to stick it in right now). she keeps texting me now about meeting up again. She said I’m great with my hands and I’m a great kisser but she kept silent about my penis which I was apparently very bed using it. I kept my cool throughout the night and laughed it off and she was very cool and said that she was expecting it but I’m very concerned that I might have a deformity or something.", "I just wanted to thank everyone on this sub reddit for answering my crazy questions. Also for answering my questions with obvious answers when I was too crazy to see the answers. I have been homeless for 3 months. Not anymore! I have my own room I'm renting from a very nice family.", "  I am a 30 year old male with a 5 lb dog recently homeless in Washington state. My dog is the last remaining thing from when life was normal,  and I refuse to get ride of her after being my companion for 6 years.   Reason for my homeless, car broke had to work fast food because it was close to home. I was assigned less hours than the high schoolers I worked with  (3-4 hour shifts)I was unable to maintain the apartment. I do not have any drug abuse problems or alcohol.", "Long story but a few years ago my wife of fifteen years, who had never been with anyone else opened up and told me she fantasized a lot about being with other men, and considered herself somewhat polyamorous. I was upset and it took a couple of years of us discussing this before I started to feel more comfortable with things. We eventually started swinging (only about once every couple of months and always same room) as it seemed like a way for us to explore this part of her together, and it ended up being a lot of fun and something I really enjoyed that brought us closer together. Well, it’s been a couple of years and I’ve felt happy and comfortable with where we are at but  I decided to ask my wife the other day and she said she was happy but she also had a desire to date people separately, and would be willing to try it if I was. This was really hard for me to hear.", "I'm not saying I didn't enjoy it, I just didn't need it. Long story short, something's flipped in my head the last couple of weeks and my libido is very much back, worryingly so, I'm not sure what to do with it lol. So we've had more sex in the past 7 days than the preceding 7 years....but it's still very much for him. I don't know what I want and I don't know how to ask for what I want. It's been so freaking long since I considered sex as a thing it actually makes me nervous.", "I told him if he’s not careful, all this attention could make her fall in love with him. For a while, I noticed the behavior stopped. He wouldn’t stay up as late, they stopped working out for a little bit, the glances and flirting stopped, and I noticed they weren’t talking as much, because they both talked to me more. However, recently it has started back up again, and almost as strongly as before. They do all the same things again, and they are always making eye contact with eachother or teasing and flirting.", "Things my boyfriend does make me feel bad sometimes (for no reason actually), like when he doesn´t text me back for a few hours ( because he´s really busy with work but he texts me back whenever he can, I know it ) and I start having weird thoughts, like \"Is he already tired or bored of me? Is this just another guy who made me fall in love with him and think that he loves me and cares about me, and he actually doesn´t give a damn about me?\" I don´t want to have these thoughts, so I try to stop myself from thinking about that all, but sometimes I just can´t stop and I feel too bad ( for no real reason actually because I honestly feel like he loves me a lot. ). I feel like a bad anxiety attack is coming, and I can´t stop it.", "So many local counties and cities struggle with homelessness and put a lot of resources into fixing the problem. But I feel society as a whole needs to change in order to truly fix the problems at hand especially at the federal level. By at least having these conversations, we can start talking about how we as a nation might be able to change to help our neighbors. I hope this made a bit of sense. I have been up late and wanted to reflect on some of the previous conversations I have had with people trying to change the narrative on homelessness.", "Clearly he's hurting inside and I want to get him help, but he refuses to get help because he denies he has a problem, and blames it on everyone else. He then punches me as a result of this, pushing me almost off my chair. I get up and push him away from me, and so he picks up my workbooks and flings them across the floor. He raises his fist above his head, and in defense I get the broomhead (not the broom - that's already been broken) to push him away from me. He then gets the broomhead and throws it down the corridor into my room with the door open.", "She never messaged him back, but I asked her why she still had him on Snapchat. I only asked it because she had claimed to have deleted her ex's on social media. Whatever, that's a nice feeling and I'm glad, but at the same time it wouldn't really be an issue for me if she did still have them. Fast forward to last night... My fiance was acting all weird and put out so I tried figure out what was going on and what she was upset about.", "He knows that I'm still on the fence about pot and, without me even asking, promised me that he would not do it. But, last March while he was gone, he got extremely drunk and ended up smoking. He got extremely sick and ended up vomiting and passing out on the bathroom floor of their bus, and called me the next day and told me everything. This was extremely difficult for me to process. I couldn't really understand how something that he swore off doing he just... ended up doing.", "A guy pulls up and said the cops are on the way. He gives me a ride and we just get out of the parking lot when cops are all over, bugging everyone...especially the homeless and kids skating and stuff. We saw a few people getting arrested, but just cops messing with people. 2 good things came out of all this. I didn't get busted and I made a new friend who got me lunch and wants to see me.", "We’ve been together for two and half years but went through a rough patch not too long ago because I shipped off to basic. But now that I’m back we were good but now her depression, anxiety and suicidal tendencies are pushing me away. I’m trying my best to support her but it’s so hard because I’m just her boyfriend? Not her shrink or doctor. Idk what to do anymore because I try my best to help her but she doesn’t really care anymore.", "Really hoping someone might have some insight for me! A couple years ago I (31,F) befriended one of colleagues (28,M). We were working for a small company that was also hemorrhaging cash, and eventually it was just him, me and some older coworkers in this open space office. Anyway, we really got along! We would have lunches, text in the evenings and weekends, and often go to the pub after work.", "I work full time, but the money I'm spending just to get by is preventing me from saving up to get a place and get ahead again. I'm 30, and I've never been in this spot before, always been successful and had a good life. But now I'm here, and I have no idea what to do. Not sure what I'm expecting out of this post. Just venting I guess.", "I do not originate from that country, but my family lives only a 3 hour ride away. After Christmas (which we did not spend together) I came to visit her and her family and eventually spend New Years Eve with them. It was all fine apart from some little \"fights\" between my gf and me. There were always some small things that led to discussions. For example: We went out with the dog and when we got back, my shoes were pretty dirty.", "Hi /r/relationships, I'm hoping you can give me some perspective. I am at a loss on how to handle this situation. I am so sorry at how long this is, but I needed to vent and hopefully one or two kind people will be able to help me process this. I want to provide some background from my side of these events. For the last year, I've been in a high-profile, high-stress management position with my company.", "Then about 25 minutes later I got a message from her saying that she was downstairs with Annie and her friends pre-drinking so I came down. I asked her how long she was down for and she said the whole time as Annie was already downstairs. I asked her why she didn't let me know everyone was downstairs already, instead of just leaving me in my room by myself to which she replied \"don't worry about it, it's no big deal.\" I said it seemed weird she just din't think to tell me for nearly half an hour to which she rolled her eyes and said \"oh don't you start.\" I decided it wasn't worth getting annoyed about it and didn't bring it up again.", "The few days following this I was a wreck, an absolute mess. Crying at work, shaking, anxious, sweating, and couldn't eat. Through the week I wound up losing nearly 6lbs and have been everything from manic depressed to furious, to scared out of my wits to utterly confused aaand all the way back around again. The other night I told him I needed an answer. WHAT are we doing?", "As a native San Francisco we have lots of homelessness. I got a few question. I understand that life is hard on some people and I try to give the sympathy for the misfortunes of others. But with the rampant drug abuse and crime within the homeless community I find it hard to sympathize with them. I've been thinking, is there a line within this culture?", "I apologized for taking up too much of his time and space and for not respecting his boundaries, and for storming off angry; the worst part is that he eventually said he didn't accept my apology because I was still ruining his day with my insistence he apologize for speaking to me with a \"retarded\" voice. So, is our relationship doomed?   ---   **tl;dr**: My bf and I fight too much, and I think it's both our faults while he thinks it's only mine/my brain chemistry's fault. Am I crazy, or do we need to break up?", "I will go homeless soon for reasons i can't stop, i roughly have 1000$ in cash and around 1000$ in possessions such as my PC, second PC, headphones etc etc etc. What should be the first thing i do aside from finding a job? I get the idea of going to a 24 Hr gym and renting a storage unit if i want to store belongings, aside from that is there anything you guys can recommend? &#x200B; edit: Thank you for all your help, it has given me an idea of what i have to do.", "As mentioned above, my girlfriends gets pissed off when I act uninterested in her friends and starts accusing me of hating them, which is ridiculous because I hardly even know them, and she gets really upset and stops talking to me for awhile. I'm starting to think that it's gonna end up being a choice between me or her friends and so far, I'm losing. TL;DR: My girlfriend's friends are annoying as fuck and I'm not very fond of them. I don't ever say anything negative about them, yet my girlfriend still gets pissed off if I don't praise them. All our arguments are about them.", "PS: I forgot to mention and I don't know where to put this back so here it goes. Her parents have 2 big houses, I live in a 1 room small apartment. One of her brothers lived in the 2nd house of her parents and left last year so we where fixing it (it was a completely mess, we had to spend a LOT of money to make it habitable. We were planing to move before Christmas but I put all on hold for her thesis so she could focus on that. She said plenty of times that my apartment was a big issue for her because it was so small and that when we moved to her parent's 2nd house we would have a great improvement in our relationship and our life.", "It’s almost a 50/50 mindset, because on one hand she wouldn’t ever wish to be thought of or treated in a horrid way, I have corrected it best I can, and she is the kind of person to forgive and forget. It’s hard. It’s real hard to decide what to do. So that’s why I’m here today people of Reddit. I realize this isn’t the most pressing, serious, or dramatic post on here, but I stick my hand out in the hopes you can give me some guidance, some past experience, wisdom, or advice on what I can do or try so that the “here and now” are in question, and not “then and there”, so that my confession can go along without regret.", "and how that would intersect with a potential partner’s attitude. You’ve probably seen the posts on here: a woman gave birth four months ago and her husband is pissed off because her breasts are sore and he can’t play with them. A woman gave birth three months ago and her husband is pressuring her for PiV sex even though she is still uncomfortable. A woman doesn’t enjoy sexual play with her breasts anymore after breastfeeding because it’s a mammary gland and not a sex organ, and the husband gets pissed because he wants to touch her breasts and apparently isn’t aware of other erogenous zones. These were posts I remember reading on here for some relevant examples, but I can go on.", "He has even made a comment to my bf about me being overweight. Being overweight has basically taken over my relationship, my mind, and my life. This year, I am making it a priority to lose the weight, especially since I have nothing else occupying my mind like cancer. My confidence level right now is 0 and I feel so fucking ugly and fat. If I just got in shape, I know that I would be close to a 10.", "Long story short - my housemate's sister and I are super interested in each other, and I wanted to surprise her with a gift for a (very!) belated Christmas for when I get back home. We've known each other about a year, and we've been on one pretty damn romantic midnight tour of Dubai as a date. I know she is interested because she made the first move. In any case, both of us are into books, and I wanted to give her a favourite of mine (Paul Beatty's The Sellout) with the inscription: 'To X, I can only hope this book makes you laugh half as much as you make me.", "The fact is that it is not very common, these numbers, from where I come from] tl;dr - unable to overcome girlfriend's past. In two minds regarding breaking up. She says she will die without me [already popped up a cocktail of pills once. Nothing happened.]", "Trash cans and bags are a thing. There are so many places to throw trash away. If you can’t get up out of your a lazy person. As for being hard it is absolutely. But if you can just focus for a year you can do anything.", "I don't even know that I feel lonely. I was fine with all this until my boyfriend asked out of concern because he thought maybe I was depressed or something and pushing everyone away. Then it was like he knocked down a wall inside me that I didn't know was there and revealed a whole room full of cobwebs. I feel ashamed and defective and hopeless now. But I don't know what to do.", "I matched with a girl who I thought was pretty on a dating app. I said hi first, and she replied. We went on to introduce ourselves and ask basic questions such as what we do, whats our favorite food, music, and things like that. Then we decided to meet up in real life. I forgot whether it was me or her who suggested that we meet up.", "TL;DR: I wish to ask out my longtime friend this Valentines, but I am afraid of my past coming back and ruining my renewed trust with both her and my friends that I’ve worked years to repair. Note, what I am not scared of is rejection, I am scared of being feared or hated once again. How I most easily do away with the stigma revolving around my past  so that I can be judged by who I am now instead of who I was in the past? That’s what is keeping me up at night. I look forward to what the community has to say.", "My homeless brother (50) has been trying to get a job, go to his required counseling, stay off alcohol, and stay out of jail. Last night he called me to say he is giving up and is resigned to staying homeless and living this way until he dies. He sleeps in a clean and safe shelter each night. He gets the same bed and has a locker. If he starts drinking again, he’ll be out in the cold because the shelter will not let drunks sleep there.", "I was so desperate that I tried asking some of my family members for help. My mom doesn't given shit, recently leased a new truck. My brother is such an ass hole. My aunt (who recently bought a vacation home in Houston) told me \"Maybe you can talk it out with your parents, take care we're going to Europe.\" ALL I DESIRE IS A QUICK AND PAINLESS WAY OUT.", "I’d like to be married before we are pregnant. I’m not willing to compromise on that. Anyone been in a similar situation? Advice on how to proceed?   ---", "But now it seems like contact is gonna be forced on me. About two weeks after the breakup, she reached out to tell me she'd gotten an interview at my company. We both work in a pretty specific industry and there was always some overlap with our jobs. Apparently, my company wants to put her company out of business. Recruiters have poached a few folks from her work and I guess she was next on the list.", "I began to see a therapist and started taking some medication for my mood. I was really trying to improve myself. The first medication I tried, I now believe, made things like social anxiety worse. I recently found a medication (Zoloft) that has changed my life. I had been exercising, going out of my way to connect with old friends who I like in an effort to curb the isolation etc.", "I [F18] have been with one guy [M21] for 3 years and within the last 4-5 months I’ve wanted to change our relationship dynamic from serious to casual. I still think I love him, but I find myself thinking about other people more and part of myself wants to see if I can do better. We get along great but I’ve always felt that our relationship has lacked an emotional aspect on his part. Part of the reason I want to end it also has to do with our financial situation - we’re both broke but I want to start working more to save more money because I’m trying to be more financially independent. I feel like he is somehow holding me back from my personal goals.", "I mean that type of behavior is just weird, I don't understand how someone can still hang out with their friends every day almost like theyre in high school. His job is kind of low demand (bartender and has an internship at an office) so i guess he just has a lot of free time... but still. What am I supposed to think?   ---   **tl;dr**: Boyfriend hangs out with his friends constantly and im worried this is a sign of immaturity.", "Friends privy to the situation believe that she is just constantly keeping me on the back burner because I'm the safe option, when she isn't with somebody, or when she doesn't have anybody else. She knows I love her still, she knows I'd do just about anything for her, and want to be with her still to this day but nothing more than just an option. I always end up feeling the same in this situation though, worthless, low, wishing I was in a relationship with her.   ---   **tl;dr**: Me and ex have stayed in somewhat constant contact for 10 years, never get back together officially.", "She is friends with a buddy of mine, but her and I are not even facebook friends or anything, we talked five or six times in these two years and never anything big, just small talk. A few months after starting classes, my buddy told me that Chloe has a  crush on me, and gave me the impression that she wanted me to be aware of this, however, even after that, she didn’t try to talk to me or make herself noticed at all. She is a pretty girl, the artsy kind that likes to travel, read poetry and paint, coincidentally the exact opposite of my girlfriend who has very different hobbies. Like I said, I love Alice and I didn’t think much of it. Her avoidant behaviour hasn’t changed and I didn’t approach her either.", "I don't know what to do with myself ! At times I feel like just killing myself. but I have been thinking that for a couple of years now so thats not happening. .  About a month ago I chose to go homeless because I was stuck.", "As for internet, I pay $60/mo on my phone for unlimited talk, text, and data without any throttling at all (thanks StraightTalk)! If I want internet on my laptop, I download the PdaNet+ app, download the .exe app on my phone then transfer to my laptop, install the app, then switch the tethering on so my laptop can connect and have access. That way, I can apply for more jobs on sites that my phone can't open up. So far, I'm doing okay. Just thought I would like to share how's my day been doing.", "I know this is kind of all over the place, but i want to ask: should I have broken up with her before? am I a bad person for sticking around? how can i find peace and happiness? Is it normal to feel hopeless and scared that i won't find love again? tldr: got cheated on a bunch and dumped because i cried on Christmas due to a breakdown re: being cheated on all the time and feeling worthless.", "He said he'd be back in the couple hours, never returned. I went down to the bridge spot around 10pm (~3 hours after he expected to return), recognized his bicycle, and left a note with a glowstick taped to it with my address in case he just forgot where exactly I was. Also left word with his next door tent neighbor. It's now been ~17 hours since he left his stuff here, which is obviously important, cell phone, warm coat, etc. I'll swing by the bridge area in a couple hours, but as of last night, his neighbors hadn't seen him since roughly when he left my place to return there before coming back to get his stuff.", "It was worse than that, I wanted to throw up, not because I found the scars disgusting but because the person I loved so so much, had done that to herself. This is when she told me more about her situation, basically all her issues is beacause of a very unstable family with an alcoholic, mentally abusive and neglective father. Her mom is her best friend in the world, but she too suffers from depression and anorexia. Her parents had a terrible divorce where she got caught in the middle, resulting in her falling deeper into depression and self harm tendencies, as well as her mother becoming very anorexic and depressed, all the while her father was drinking. She felt she couldn't burden her mother with her issues and instead keep it to herself, which she does til today as well.", "I apologised and thought that was the end of it. It’s gotten to the point that if I walk into a room, she’ll leave straight away, and if she doesn’t leave, or if I start talking to her or someone else, she sighs a lot so I know my presence is not wanted. If I’m in her general direction of travel, she’ll be sure to make a wide berth around me, and the only time she’s spoken a full sentence to me was to say “thanks for my present” that I got her for Christmas. Then we get to tonight. Eva and one of my brothers are staying over at our cousins house.", "My mother on the other hand tells me that she is doing all she can, when i explained to her about the way she dresses in front of him she blames him for not creating the opportunity to wear something nice. ie not going out someplace due to him preferring to do work. Listening to both sides separately have put me in a place where i am helpless and cannot do anything. All i can do is withdraw into myself and think about other things to relieve myself. Its basically that they dont understand each other.", "What do you think would happen if you invited an individual with mental health issues who had been homeless for many years to move directly from the street into housing? Loyd Pendleton shares how he went from skeptic to believer in the Housing First approach to homelessness -- providing the displaced with short-term assistance to find permanent housing quickly and without conditions -- and how it led to a 91 percent reduction in chronic homelessness over a ten-year period in Utah. <url>", "I don't know what to do anymore. She doesn't want help, but I am feeling hopeless with her, and I'm afraid it's going to take a toll on our relationship. I have my own mental health issues that I am actively dealing with and I just wish she could see that her issues are affecting people other than herself.   ---   **tl;dr**: My mother has unaddressed mental health issues, how do I get her to take it seriously and seek professional help?", "Hey, I recently came into a bit of money. I live on government benefits and I live in supported accomodation. I received roughly about £100 bonus money I'm guessing because it's the turning of the new year. I always feel guilty when walking past homeless people in the streets and feel too shy to donate money to them. So this time, I donated ten pounds to this guy sitting outside of a supermarket.", "**tl;dr: My BF has a dirty house. Never cleans his private room or bathroom even if I've told him to. After 2yrs I'm fed up and grossed out. I don't know what to do anymore! **", "I don't think I've ever felt soo intimidated by someone before. I feel like I'm going to melt whenever I'm around him. Although you're thinking, what's the worst that can happen. He rejects you? Previously, I made a stupid attempt to try and hook up with him during one of my \"breaks\" with my boyfriend (we previously broken up for a few months, but got back together during the 3 years together).", "Especially because Jeff drinks and does drugs, which is very inconsistent with my lifestyle. Overall I regret agreeing to have him -- my bf and I have ruminated over it in couples counseling multiple times :(   ---   **tl;dr**: My boyfriend's brother is an almost college grad with very little direction. My bf wants him to move to our (expensive) city with no job and live in our 50/50 shared condo rent free.", "Clearly what i need to do is just talk to her about it. I have a couple of examples in mind that will drive the point home. Mainly the first night i was introduced to everyone and a house warming we went to. We're having dinner tomorrow night. Thanks a ton for the feedback everyone.", "I really suck at explaining things so if you have any questions please ask. UPDATE: I gave my casual partner a vague warning about the future and how, if the time comes, I'll need to make the decision for myself. tl;dr I am stuck in a love triangle with a casual DDLG relationship on one side and sharing of mutual feelings on the other. Multiple things keep the DDLG from relationship from being public and I hate sneaking around. I want to have an open relationship with the other girl.", "Back to my dad, during lunch he wanted to say some words to my GF, to encourage her to keep studying the doctorate, he said that if she felt that money was an issue, that don't let her that take her down, that doctorates in our country earn very poorly but that getting that degree would open doors to work abroad and land a job she would love. You see, my dad didn't know (well, I've told him plenty of times, but I figured he forgot at the time) that my GF's mom was a doctorate. My GF's mom openly told in front of my that she didn't earn enough for the years of study and work she did, everybody in our country knows that doctorates don't earn enough money for the effort, capacity and dedication they're required to do/have. But when my dad said those words, nobody said anything. I didn't take it as offensive.", "My boyfriend constantly states that we are no longer in a relationship and I need to be constantly working towards showing him that he will want to be with me again. I do 90% of the cooking and cleaning in the house. I try my best to make sure his needs are met, even if it means that my needs fall short almost always. It seems like any \"everyday\" argument we have about something always turns into me being a piece of shit because of what I did to him. He tells me that I made him this way and I need to deal with it until he moves past it, which I understand and agree with.", "To make up for it I made a cute little note and I made him a batch of his favorite cookies. I was honestly so damn proud of the gift when I finished putting it together, it looked awesome! To add some context, I have attended a few games with him (and the rest of the family) and absolutely loved them. I didn’t care about the actual games themselves, but I loved being there with my family and the cool atmosphere and stuff. Well, apparently my dad didn’t think it was so awesome.", "I'm sure that there are many people worse off than me in this kind of situation but I just can't stand this feeling anymore. I just want someone to choose me for once, instead of just being stuck with me. Unfortunately, I have no idea how this could happen.   --- TL;DR I don't want to feel lonely anymore but I have no idea how to fix myself.", "My friends are getting kind of weirded out by all of this and I am running out of excuses for my boyfriend. I dont want to break up because other than this one issue he is a wonderful partner and I really enjoy my time with him. How can I address this issue and cone to a reasonable compromise?   ---   **tl;dr**: boyfriend wont hang around my friends since i slept with some of them.", "This has made me really question where I am and if I should be staying put. Sort of if where I was was right I wouldn't be feeling like this is now. I'm not thinking I should leave for the sake of being single to see someone else but maybe if I'm not as happy as I thought I should be leaving for me to have some time and space to do things on my own. Any suggestions reddit? **tl;dr my crush on my driving instructor is making me think about leaving my boyfriend**", "If the homeless who choose this life are happy or do it for fun, please let them be. & what harm to the rest ? Would it be such a bad thing if anyone could choose to live happily freely without care without social constraints constrictions impositions restrictions that the greedy powerful adults impose on the rest Pray look at our adults mess the environmental & other species demise &degradation of this world. humans have created in the busy-ness of work in the aftermath of technologies the debris providing us with more & more useless commodities Why not allow a few homeless dwellers to remind us of the simplicity the less is more in living life. Let the homeless who choose be as free as the birds without worry for the morrow or live carefree as the little children, said the jewish guy who supposedly died on the cross", "He's not seeing a therapist or psych regularly, which we agreed that he needed to be doing if he was going off his meds. I'm just at this weird point with myself where I'm holding back this resentment and anger at him for not taking care of himself, even after I've explained to him how much it stresses me out and hurts me when he is not consistent with his self care and/or medication. Though things are as normal as they can be right now, I find myself getting angry when he asks me to promise to do specific things for him, like do my laundry (I'm a bit of a mess), because it just reminds me of how he wouldn't keep that promise yet he expects me to do things for him (even though they are rational requests I should take care of anyway). Well it still ended up being long, my apologies! What should I even do from here?", "--- TL;DR; Ghosted after over a month of talking to a guy. Met in hotel room. Made out but didn't have sex. If he didn't want to cheat or chickened out at the last minute why would he carry on so long with me?", "I check my phone even though I know she won't reply. How do I get past this? Where did I go wrong?   ---   **tl;dr**: sent my friend a love letter, basically, and she never responded and then proceeded to block me on everything.", "Two years ago we moved to a different city for his work. He earns a lot more than me and his job offers a lot more career progression, so I wanted to support him. I’ve always thought we were a good team, there have been times where he’s struggled financially and I’ve helped him out no question. We talked about the extra money he’d be able to save by walking to work (2 mins away,) and it seemed as though we were on the same page for what we wanted in the future; buy our own place, a car and start a family. So I thought all was on the right track.", "I also want to set the record straight with my family. What should I do? Tldr : I dislike my mom for legitimate reasons. She's telling my family it's because my head is all messed up from my mental illness. It's gotten back to me and is making me angry and making me feel victimized and weird about myself all over again.", "I always found it so easy to live in the street. Food was available EVERYWHERE. We live in Canada, a first world country, and food was just so easy to get. drop in centers, late night visit at the bakery shop,  rummaging trough the garbage ( before it became popular .. ). Clothing was also available everywhere.", "So I have a csf leak. It isn't diagnosed, but being that its pretty much the only thing(I don't have any heart issues) that causes orthostatic headaches and and the other problems im having, its probably a csf leak. If I stand for more than 10 minutes or so after I wake up I develope a horrible headache that feels like its pressing downwards, and I basically become retarded. Like I cant even walk straight. I think my vision is starting to be affected too.", "We have been together for a little over 2 years now, and high school is nearly over. He’s been wanting to move to Toronto for a while now and I had considered moving there for university too. However, I plan on staying at home (Toronto is only 4 hours away). I would say things about how awesome it would be if we moved in together or visit each other. Never once did he mention he did not want a long distance relationship.", "It honestly felt like someone punched a hole right through me. Later in the day I texted her and we talked. I asked her how the trip went. She sounded exited to talk to me and it sounded like it would work out between us. I asked her abut her friend and if anything had happened between them and she said that nothing had happened and that her aunt was with her the whole time.", "I've been dating this guy for nearly three months. We met at a bar and had a one night stand, so my expectations were very low. We started by taking it slow (dinner or takeout and a movie on Saturdays) but things felt really nice and normal. I'm used to meeting guys on apps where everything is a game and usually they are dating multiple people at once; this felt different. We met before Thanksgiving and managed to keep the momentum going through a lot of travel and three weeks spent apart.", "We've been getting along very well, and our previous repeated complaints on both sides of ceased because of this. But as time has gone on my feelings have changed in regards to me thinking I can accept this and work through it with her. I know I love her, and I don't really know how to explain my emotions here, but I no longer feel like \"her husband\", and I don't feel like she's \"my wife\", it's more like we're partners or room mates or something. I feel a vital part of our marriage (loyalty, and trust) is gone and it can't come back. In the end, I can't shake the thoughts of leaving and restarting my life.", "An interesting fact I once heard was that some people die out in the desert with water still in the bottle. These people would try and conserve their water supply but would end up dehydrating themselves in the process, laughable over a few shots of whiskey but an important note at that. I  drink nearly all I have and only saving a little to keep the mouth moist after a smoke and I find that by doing so I stay hydrated, never feeling like crap because the water hadn’t finished absorbing into my system. Remember that folks. When I finished watching the trains I found a place with a plug and wifi to jam out to music.", "I am SO PISSED just because i look tired and wearing dirty clothes doesnt mean Im up to no good. I have already filed a complaint with the bbb, attorney general, called my bank to see if i can get that money back. Im thinking while Im stuck here, to contact the local news paper. This man and his housekeeper wife, whom I forgot to add, called me a \"skank\" Im dead serious. So i was falsely accused and insulted, and had my money robbed.", "At some point in the past year, we discussed living together. She seemed to be okay with it and never had any objections. Since both our rental agreements will soon expire (hers in May and mine in July), I started looking for a new place online. However, I noticed that she never really responded enthusiastically about anything I showed her or just plain ignored it. Last weekend, I confronted her and she admitted that she no longer wants to move in together, saying it is too soon for her and that she had been thinking about it for a long time.", "Therefore, it should probably come as no surprise that I sprung the question of \"What exactly are we doing here?\". Well, that backfired, as he alluded to the fact he was too freshly out of a long term relationship and didn't want to commit yet (Jason had been single for more than a year and it was a 3 year relationship). I bit my tongue until it bled and told him that was okay because we had more friends in common by that point, despite saying I needed some direct space for a few weeks or more. Unfortunately, what followed could have not been more violent. Not the type of physical violence, but emotional tension and turmoil fueled by running into each other at social settings and by alcohol.", "I have since sold my phone and obviously have just now gotten to a position where i owe nobody but myself. i am back at the start but finally without any ties. so now, i have to ask. Where do i sell this laptop for $500, and then, after it's sold, what should I do and where should I go in the country? who do i talk to?", "I'm upset, and the fact that I don't know whether I should be upset is making me more upset. I realize there's something crazy privileged about the whole thing (parents want me to spend more money? i should xpost to r/firstworldproblems!) If this really is an absurd thing to worry about, sorry for making you read through this thesis but please do let me know because I'm just really confused and sad. TL;DR: Mom accuses me of not valuing the benefit of earning money because I don't like to spend it, though getting a good job is pretty much all i've been focusing on.", "I don't feel at all like he doesn't like me or has gone off me, we meet once a week and 'chat' daily but I'm kind of unhappy I'm not getting the 'cant get enough of talking' experience that usually comes along with being enamoured at the start. I nearly always reply within 20 mins if I'm not busy because I'm still in the excited pahse, but I get a lot of 3/4 wait times with a read receipt, with him coming on and off whatsapp within that period before I get a reply. It hardly screams that he's really into me when he is ok to wait that long to reply. I assume he's messaging others so why not me? I'm his new potential gf!", "I meant this stuff, and I think I still sort of do. The reason I've been so angry recently is just the general stuff with my family, but also my dad specifically. He's been awful to me in the past couple of days, everything I say or do no matter how good I'm trying to be is bad and horrible and stupid, and if I disagree with him even slightly he gets angry. But I think I might deserve it. I feel like a bad person.", "l asked if there was someone else and she said \"no, even if there was we weren't in a relationship\". Fast forward 3 months and I'm finally over her and life is going great, then I got a text from her and we started talking again. During the holidays I returned to my country and I spent all month with her, this time officially dating. We always kept our relationship open, so we jokingly spoke about one night stands and if we had any during those 3 months apart. We both mentioned that we had one - after we stopped talking.", "already a few months in. Any advice on if/how this can improve or if I should just cut my loses before I get too invested? Thanks everyone! TL;DR boyfriend currently has no motivation to move his life or our relationship forward, should I stick around and keep trying or accept incompatibilities? Am I asking for too much?", "Since then I´ve met some \"wrong ones\"- I mean guys who lied to me, for example this guy who was trying to convince me that he loves me and wants only me and I found out that he´s been dating a girl since 2014 and that they´re expecting a baby. So yeah after these few \"mistakes\", I started having trust issues. I just couldn´t trust guys, every time I met someone I couldn´t trust him and couldn´t stop expecting something bad coming. In December last year the best thing in my life happened to me. I´ve met a guy, and he´s #EverythingGoals.", "there are guards you have to ask for everythig and the other people who live there - while most are \"ok\" some either look like trouble or actually give trouble. . In theory I would have moved to the capital and taken up fitness instructor course and applied for an education. only my GPA is bad even though I took higher level classes than requirred. so I need to fix my study habits and I need to either sue my dad or find closure with him and cut him out of my life.", "We are making a one hour documentary for BBC One Children in Need on what it’s like to be young and homeless in the UK. Part presented by Stacey Dooley, we hope that a film centered on young people’s experiences will not only shed light on this often hidden population but also raise awareness around the need for greater support and understanding. Whether you’re sofa surfing, in a hostel or having to consider sleeping rough, we’d like to hear from you. All contact will be confidential and doesn’t mean you have to take part, we’d just like to hear about your experiences.", "He broke contact with the whole family, only sparingly speaking to his little sister after she followed his example and split. I think he is very ashamed of his past. He *never* talked about anything like this with me. I’m honestly really worried he thinks I would think less of him if I knew, and the idea of that breaks my heart. I didn’t tell him what his sister told me.", "I’m not opposed to offering money, but once in college someone got a weird/a little sketchy when I stopped buying him monthly bus. Help! I’d appreciate any answers. Sorry if any of my comments are uninformed or unintentionally offensive. I’m sincerely asking advice for how you think I could temporarily help him.", "I of course understand her wanting me to be safe, but I have an IUD and use condoms 100% of the time, which she knows because she pries about my sex life. She knows I'm sexually active and I don't have a boyfriend and is really judgmental about me having casual sex. I had a pregnancy scare last week (I'm not pregnant) and all I wanted was some advice from my mom and she used it as a way to make me feel bad about my sex life. When I was younger, she would constantly slut-shame me for things I hadn't even done, and made me feel so guilty about the idea of even having sex that I didn't have sex even with my year-long high school boyfriend because of this crippling guilt. Whenever we argue she makes it a time to critique my entire personality and not just my behavior in that argument or even within my relationship with her.", "to me I feel like that is someone older than my current age dating an age that seems like a child to me....  I creeped her facebook and she appears to be a \" normal\" 23 year old...going out partying...saying things I would have found funny at that age but cringe at now.....and he did share with me that he supported her for the most part and so on...I asked if she had any \" life skills\" and his answer was \"  not really\".  What are people's thoughts on this?   --- tl/dr...i'm creeped out by a man dating a woman 20 years younger even my last relationship was with a man 22 years older.", "Example 2. There was this life goal we had together and I happened to accomplish it much quicker than she did, but instead of being happy for me she would get super jealous and make me feel like shit for it. Even though I helped her in every possible way to accomplish that goal too. Example 3. Whenever she sees that I'm upset about something, she'd buy gifts, tell me that she has something planned for us (which later would turn out to be a lie) etc.", "He says he doesn’t want to go to therapy (I know that’s the usual suggestion) Are there things we can do to work through this slump? Is it better to make him go out a little each day or is that too much? I don’t want to make it worse. Thanks for the help Tl;dr: how can I help my uninterested boyfriend.", "This is something I'm working on figuring out for myself). Option 2: We each move after we each get a job in City A. Drawbacks: (1) one of us will be left at our current job for a while with our boss and coworkers knowing the other is likely to leave soon after. I'm not sure if this is an inadvisable situation. (2) BF will likely find a job first, as he has a few more years experience than me plus some management experience.", "I want that. I want him as well as a SO but maybe I need more time. Its not fair to him. Maybe I'm more invested than even he is. I don't know", "Without my meds I can be kinda unstable, few months back I stopped taking them and ended up breaking my hand because of it. I have no real education except high school diploma and I wasn't smart enough to finish community college as I'm useless with math and science and that's all I needed to finish for a general studies degree. All I seem to be doing is existing and that means I'm a burden on anyone who tries to help me and right now I'm dragging my partner down. I just need help figuring out what to do so I can stop being burdensome and be useful and have a purpose again. I don't really know what to do anymore, but this is all I have left to try.", "3. Since we are both the only child, we both feel an equal responsibility to carry on our family lines, regardless of our own gender. What do you guys think would be an equitable solution to this problem?   ---   **tl;dr**: Girlfriend wants future children to have her last name, but I am not comfortable with that due to social conditioning and/or the backlash I would face from my own parents.", "I apologize if this is the wrong subreddit for this topic but i'm at my wit's end... I've been homeless since February and i'm now trying to find my own apartment and start living independently for the first time but I need some advice...I've been couch-hopping here & there for a while and i'm staying with a relative who's been helping me but i'm on a limited time frame and I feel like i may not get anything in time...I applied for an apartment but was rejected due to past apartment debts. What can I do t get approved, and do I have a shot at public assistance? I have aspergers and I don't make a lot of money at my current job.", "We met and it went really well - he's a super sweet, smart, and thoughtful kid (just like his dad). It turns out that the kid has (VERY recently - after I met his dad) been dealing with some mental health issues - he texted a friend that he was suicidal, and his parents have been scrambling to get him help because they are not sure if he has depression or something else. He's since started therapy and seems to be doing ok but obviously they are very concerned. I listened and was very supportive when he told me (I've dealt with my fair share of mentally ill family members) and I could tell he really appreciated it. We talked about it a few more times after that day.", "The past few months especially have been hard on me. I think about her often, not even necessarily in a sexual manner, but I miss her. Even more so, the fantasies have started up again. I have vivid, detailed dreams about her sexually, and they upset me throughout the day, and I don't know what to think. Any advice?", "But I'm not physically attracted to him. Normally personality does a lot for me. I've met guys who I didn't feel attracted to and then started to really like because of their personalities (and vice versa). I go through days where I skype this guy and like the idea of him and feel like I can be physically attracted to him, but there are other days I don't feel anything physically. We are very long distance at the moment, so we've haven't had any face to face in person time for the past month (he's moving in 5 months).", "Even if that's true (and I believe her), I hate it. I've tried to explain my point of view and why I hate them still talking but every time it's brought up we always just end up arguing. She says I have no reason to be jealous of him and that she's VERY happy with me and that I'm overreacting. I'm not trying to create a problem when there isn't one but I feel like I have a point? I never want to tell her to stop talking to a friend, but their history makes me uncomfortable.", "I want to sit down and have a talk with my GF, but I don't want to roll in unprepared. Should I even be attempting to have this talk? If so, are there any books or reading materials I can go over to help back my case up?   ---   **tl;dr**: Looking for ways to talk to my GF about her daughters spoiled behavior.", "So I knocked and told her to please let me in. She refused, I told her I was sorry and I didn’t mean any of the things I said and that I love her very much. She said to go away so I did (we were at her house). Now a whole day passed and she still refuses to talk to me :( I’m worried, guilty and just want to hug her and tell her again that I’m sorry. I sent her some messages but she ignored them.", "Throwaway account for <name>. I'm 27M, she's 26. Downloaded Tinder a couple years ago after my last long term relationship. Never thought I'd find someone I might actually be interested in and haven't met someone from Tinder in a few months because I don't love the thought of it, wasn't meeting the kind of girls I really want to date and I'm not getting any younger. But, one night in late Nov I got a new match and she seemed like someone I would really enjoy spending time with.", "I'm taking care of her but I have no idea what to do with myself. **TL;DR: My wife told her co-worker that she and I were in an open relationship and started hooking up with him. She said it's because I have too high a libido, because our relationship lost it's newness, and because I don't do a fair share of housework. I'm not sure if we can work it out or if I should just leave. **", "I started my seizure while on the stairs and as a result was pretty badly injured. I broke my ankle and injured my knee. I also required stitches in my face. Let me make this very clear- I recognize that this experience must have been **terrifying** for Tom. I understand how frightening and anxiety provoking, and even traumatizing this was for him.", "I got as far as Illinois when he ghosted me after urging me to leave in the first place. I've been going between three different friends who know I'm homeless but think I'm 19. I want to go to school, get a job to buy my own stuff, and get on with my life. I don't think my mom is looking for me, but I still need her signature to go to school. I don't want my new friends to get arrested for harboring a runaway youth as well.", "No we do not have sex everyday, yes we both work, no its not a problem of the change. I should have said \"I'm usually successful 1 out of 4 times I attempt to initiate.\" I just want to make sure that I am still crossing my i's and dotting my t's on my end or if I should ask her if there's any improvements I could make.   ---   **tl;dr**: Do most relationships die down in the bedroom after a while?", "With all of this garbage happening to me, I find it hard to keep my chin up and to not be negative. By anticipating the worst and vocalizing it, I feel as though I have a better chance of avoiding the worst, because I'm still suffering (making myself unlikable or making a fool of myself). Additionally, if the situation turns out better than expected, I will be pleasantly surprised, and not let down when something goes wrong. Because of this, my relationship with my family is horrible as well. I don't want to lose one of my few friends over this, but I have no idea how to change or if such a thing is even possible.", "I started noticing her internet behavior more over the past few months and it's been kind of bothering me. My girlfriend is a very intelligent and mature person, but when she gets online it's like she acts totally different. For one, she sends me screencaps of her \"trolling\" people. I mean, trolling? She's almost 30.", "I am obviously devastated. I feel disappointed, angry, sad and rejected. I'm constantly asking myself why she no longer wants to live with me. She says she wants to have her own space to go to when she wants to be at ease, \"not that she doesn't feel at ease with me, it's just different\". I tried to make her see that we're supposed to make a new home for ourselves where we will both feel at ease, but to no avail.", "The list I will probably choose from right now is Santa Monica, Orange, Costa Mesa, Santa Ana, or Long Beach. I've lived in the city for a bit before and I like the more inner-city of LA but I think I need a change so I'm looking for a more coastal area to find a minimum wage job, settle in, and potentially seek housing in eventually. Don't have much interest in SD, nor in going up north to San Fran. Hoping to get some input from you guys and it is very much appreciated.", "She's sworn at me at times.   **tl;dr**: Girlfriend cheated on me twice. Is always adamant about keeping contact with the people she cheated with. The relationship is at its wits end. p.s.", "Maybe 2-3 crazy fights but nothing major. Joe came back, frankly Joe spent ~ a year asking me to go out with him and my gut did not agree, it just felt off, now don’t get me wrong I have loved Joe since I was 17 but I just felt like this wouldn’t be right. I asked Joe for a year, I studied far away, and it was my last year at uni, I asked Joe to give me that year. But Joe said Nah. Joe gave the whole I have changed speech which every girl has probably heard a gazillion times in her life, but still thinks its novel.", "When we are at work we joke around but we all do that. I feel so ashamed. I want to hear your opinion on the fact am i to blame? Was it my fault because something like this happened? **tl;dr**: Something delicate happened between me and my collegue", "I refuse to carry both of us anymore and I'm also tired of the drama between us as well. So, part of me hopes he doesn't pay the rent and that'll give me my push to really move on. Anyway, I'm ok with going to a shelter, but I worry about my laptop. I remember when I was living in a shelter when I was a kid, they didn't allow you to have certain items. I don't want to part with my laptop for them to keep it safe and it gets \"lost\".", "But it's been 2 monthsalready this time. We didn't speak for Christmas or new year. I'm lonely, sad, angry at the situation (not angry at him!) and the worst part is not being able to talk or even know what's going on. We didn't fight before this so he's not angry at me.", "Hi everyone. I met a great guy - let's call him Dave - about a year ago. We started off as friends but started dating around November. Let me preface this by saying that Dave is probably the best boyfriend I've ever had. He'll drive an hour just to see me, always pays when we go out for food or drinks and is reluctant even when I insist to pay.", "And I’m at a complete loss as to how we resolve this. (BTW, we have talked about all of this about 1,957 times already. There is nothing written here he hasn’t heard before.) TL;DR – Husband has always been the primary earner with well-paying jobs, but has experienced serious burn-out. As we’re eating into our savings, it looks like I’ll have to put my business on hold and go back to work.", "I gave him a week to get all his bills together so we could go over everything and see where he could cut back. He didn’t do it. He just came over with his monthly expenses scribbled down on a piece of paper. My wife also took the time to get him a list of low income apartments in the area. We told him to call around and see if there was anything available or to at least try and get on a few waiting list.", "                                                 She resents my relationship with our son - My son is a Daddy's boy. Even now as I type this I hear him out there waiting for me saying Daddy Daddy Daddy. He comes and gives me hugs when I come home and barely notices when my wife is gone or comes home. - ‎This is also something she's recently admitted and I feel guilty about it, but I feel like it's because she puts in no effort beyond what she needs to do.", "Anna claimed he was a distant friend and had been kicked out of his house in the frigid weather. My mom said nope, no way that boy stays there. Anna seemed to be telling lies again. Fast forward a few days, and Anna's mother takes her phone away after a series of lies and deceit. It turns out, the man was not a distant friend.", "I'm gonna try and keep this as short as possible> We met 6 months ago and it was instant chemistry. We fell in love pretty quickly and we used to talk all the time about how surprised we were at our feelings and how we had never felt like this before. Anyway a month ago he started calling less, he would still drive the few hours to come and see me but the communication between us seeing each other was lacklustre. I'm not usually clingy but we used to talk on the phone several times a day. this turned into a 5 minute call.", "I can't talk like that.\" He put a hand on my shoulder and smiled and said, \"You sure are.\" It goes in a circle. He made me feel better there by affirming that he thinks I'm worthwhile. Great, that'll probably get on his nerves.", "She still invites me to things and hasn't started dating anyone else (or even talked about it), but frankly, I'm starting to feel kind of pathetic asking her to hang out after she turned me down for the date. I do like her as a friend, but have started thinking of her as more than that and it's hard for me to ignore that when we spend time together. It's even starting to affect my self-esteem a bit, because usually if someone turns me down (no matter how reasonable the excuse) I just move on to someone else and spend less time with them, but it's a bit harder when that person is already your friend. My questions are: should I just give up on the potential of a romantic future with this person, or is it possible she's still feeling things out (like she says)? And regardless of this, should I start spending less time with her/stop inviting her to things (even if just for my own sake)?", "B wanted her to come with him to Chile, a place she has always wanted to go, and spend a week or two exploring together. In her writing, she seemed genuinely conflicted. The next day, B tried to kiss her, but she said \"that she couldn't\". B said he was falling for her. He really wanted her to go with her to Chile.", "We talk about it a lot and we're on the same page on most of things. This just isn't what I've come to discuss, so if it's not intimacy-related, you needn't (and I discourage you to) advise on that. :) Don't worry, we do not take the difference lightly.   ---   **tl;dr**: Sexually unexperienced longing for sex with long time partner, probably years away from it because he wants to wait till marriage.", "Hello all, I'm a new submitter to this channel. I went here a few nights ago and honestly it's been helping me cope with my current situation by reading what others are going through. One of the things I noticed is that a lot of responses are brutally honest -- and I am here for just that while still accepting that I'm a hopeless romantic who sees the value in \"If you really want it don't give up\". Let's get started -", "(I see a therapist weekly.) I really don't want to give up on this, but i don't know how to feel better. Any help is appreciated.   --- tl;dr i have relationship doubts and anxiety/depression and I want to love my boyfriend but i'm not sure if I do.", "Our sense of humor is very similar.. She's gorgeous, funny, smart, and likes some of the same things I do.. She's wifey material.. The way she loves on her dogs and cares for them makes me think she'd make a good mom 8-10 yrs from now. These are some of the biggest reasons I see myself with her.   **tl;dr**: Off-and-on heterosexual relationship since we were in high school. She met me and cheated on her highschool BF.", "WARNING: Messy post, I'm really all over the place, sorry guys. I have a lot on my mind. Hope you can make the best of this text. Also sorry for any spelling errors, english isn't one of my talents. Me and my boyfriend has been dating for over a year now.", "I've noticed usually people who have been in the street for a while or traveling around, and managed to avoid frying their brains with drugs or just losing it from the life, have really different opinions and ways of thinking compared to the just homeless sleeping in motels or shelters or cars and often trying to work at the same time. Do you hate other homeless aka \"hobos?\" The people in the tents? Or do you wish to or try to help them? Do you resent the middle and upper classes or do you think they're entitled to what they have?", "I would like to leave there, but I'm terrified of a shelter. I'm also a semi observant Jewish woman. Most shelters won't help me keep kosher and keep Shabbat, both of which are important to me. The Rachel Coalition is for domestic violence only, so I can't go there. The NCJW shelter in the area doesn't accept the voucher welfare would offer me.", "So here’s he thing. I do have feelings for him. They just aren’t the intensity level I’m used to feeling when I fall for some one. I normally have this sense of urgency. Its this “Crazy about you/can’t live with out you” type feeling.", "This is all relevant because I'm slowly realizing that **keeping my relationship from my mother isn't sustainable**. I'm not a good liar. Eventually, the truth has to come out, because I cannot live like this. Problem-- my mother would HATE my boyfriend. Being a narcisist, she can't stand when I give anyone more attention or devotion than her.", "The problem is one of these guy friends. I'm typically pretty shy in new social settings and don't really like to make be at the focus of anyone's attention unless I'm comfortable with them. When I first met these guys, it was like 2 polar opposites met. I'm fairly quiet, reserved, respectful and I like to think I'm a smart person. These friends, this one friend in particular, are loud, boorish and really rude.", "Back ground, me and my girl have been homeless independently for about a year and we've been together for six months now. We lived in Olympia Washington for a while and where trying to make it and eventually move out of the toxic town. I received about 3.5k$ worth of back pay EFC payments the state owed me and shortly after my girl's grandmother died and she wanted to make it to the funeral so we decided to make a road trip of it, get jobs in florida and be set. We figured the lower cost of living would offset the vastly lower minimum wage and we'd be fine. We both got jobs at her old workplace (Wendy's, never go to the Lakeland Highlands Wendy's so many healthcode violations btw) and worked for two months and got fired for bs reasons (I got trained wrong and wasn't told about 60% of my responsibilities by a guy who was on his phone 75% of the time and quit a week later, she overslept and no call no showed one day and got immediately taken off the schedule)", "So I've been dating my current girlfriend for 6 months now. Everything has been great. We get along great, haven't had any fights, sex is still amazing, all that. I've owned a condominium for 7 years, and its a decent sized 2 bedroom, 1 1/2 bath. Well, her lease runs out at the end of July, and I'm toying with the idea of inviting her to move in with me.", "It’s gotten to the point where I feel like Tom is completely controlling me in the effort to “protect” me. He won’t let me go anywhere without him and when he is forced to leave me he calls me every half hour and panics and comes home if I don’t answer (I don’t purposefully not answer- occasionally I am napping or studying). I understand that the events were traumatic for Tom. I recognize that every time I go to a follow up medical appointment he is frightened. I understand that the fact that I still take medication scares him.", "The connection was 100% real and 100% mutual, no way around it and it’s the first time I’ve felt that way about someone in 8 years. Being around her lit a fire in me again - I wanted to be a better man because of her. I was sweet to her but not overly so, her son was with his dad for Christmas and I sent her flowers since I knew she was feeling down. She called me the next day and was so grateful and loved them. I was complementary of her and she ate it up and asked me in a non-guilty (more of an “I love how you are to me” way) why I’m so sweet to her.", "Two days ago I packed all of my clothes into my car and have started living out of it. I sleep in the parking lot at work, work for 8 hours, and then spend the day at Starbucks on the internet and charging my electronics. Once Thursday rolls around I will have ~$400, which is not much as far as being able to afford a place to sleep. If I become good at living out of my car over the next few days, I may just use some of that money to invest in making it easier for myself. I don't really know why I'm posting this here, except that living out of your car is a pretty lonely experience.", "I was dealing with depression for months feeling like I'd failed life at 18 and quit my job to finish off my college education and thats where we met. We were in the same class and used to stare at each other all day long so i followed her on instagram and noticed she was going to a club in my town that night so convinced my friend to come out as i really needed to bump into this girl and give it a shot. so we did. When i walked in, she was there it, was crazy we locked eyes and without saying much she walked up and just started kissing me. we were guy and girl from that moment we did so much stuff together like holidays then she even moved into my parents place.", "Not actually losing my home at the moment, so so far not in danger of homelessness, but I figured this was the next closest place to \"Tips for Poor as Fuck People\". We're losing cable tomorrow or the next day unless we come up with money we don't have. Losing the internet is brutal, but losing phone service is going to be the real problem. I'm in the middle of a series of surgeries over the course of a year with the final one being a month out. In really shitty medical condition...and now I am going to be cut off from getting messages from any of my doctors, surgeon, or infusion clinic.", "She was unemployed and toyed with the idea of answering ads from strangers to perform fetish tasks for money, to include nudity (but no sex). It really wrecked me that she would consider that. She brought it up once again not too long ago (not seriously) and I flipped out. She was working as a nanny for a long time and I was very insecure about her and her boss because of my fear that she would be willing to do sex work for money. Now, she has never done any sex work for money and we agreed that it is not something I am comfortable with and she will not do it, so that's not an issue.", "Credit card debt makes me depressed, it’s been terrible. Today I only have 3 with the rest paid off. Only about 6 months until I’m in a better position to get back on me feet! I’m trying to get an easy 2nd job so it’ll be even sooner, but I’m always shot at the end of my 10 hour days and never getting a good night sleep. I just have to do it.", "I could really use additional input on this because I'm not exactly sure what a healthy and compatible relationship looks like at this point. When we try to go out and do things, we often do not have fun because our personalities clash. Example of this, I wanted to go kayaking and was surprised that he said yes because he rarely wants to be outside. We get to the springs to kayak and I want to go in the water because I see no point in kayaking if you don't go in the water. He refuses because he hates water.", "My boyfriend is currently stationed overseas while I’m still in the states with my four year old and our seven month old. It has been very hard for both of us, but I at least have the kids. I often feel guilty for feeling sad or lonely because he doesn’t have anyone there. No friends (yet), family, and he misses our son terribly. He’s having a really rough time with missing all of the milestones of babies first year and is depressed often... when he’s sad he gets angry.", "In Nashville, it's going to be below 30 tonight (possibly snow tomorrow). So far it seems my sleeping bag is doing it's job, but my laptop was uber cold. Also gave me some screen errors (I think it may be humidity build up related, because later in the day it worked fine). Right now it's in a laptop case. But that didn't help much.", "I get where she's coming from, but only if there had been inappropriate conversation or actions on my or my ex wife's part. My ex wife and I have literally zero feelings for each other, other than friendship and concern for one another as we are our son's parents. I don't know really what to do at this point. Maybe someone can give me some insight? ---", "I just moved in on the 31st of August. It’s so nice to have a place of my own to come home to, air conditioning, my own bathroom and shower, a fridge to keep all my food in. The place is pretty empty still, as I blew just about everything paying deposits on the apartment, power, water, and internet. As time goes by I’ll get furniture a little at a time and slowly make the place more cozy and more my own. I can’t believe it’s finally over.", "I'm just overwhelmed, really don't want to give up on myself but my spirit has been broken more than once and I can't ever seem to get to the m ight at the end of the tunnel. If anything, thanks for reading, hopefully in the near future I can update this with some good news. If not I wish anyone in a similar situation that sees this the best of luck. Sometimes you get dealt a hand you literally cannot play. I am living proof.", "I was never really close to him, our conversations never went past the 'nice weather we're having' area. But I coincidentally ran into him at a bar recently and I initially tried to keep my distance from him because I know he's friends with Zach, but then he told me that not only does he and Zach are no longer in contact with each other, they actually really dislike each other now. I'm guessing something went down after Zach and I broke up. After that, I was more comfortable around him. So, as the night went along and we got drunker, we ended up hooking up.", "Should I chill out and let her contact me?   ---   **tl;dr**: The level of communication outside of face-to-face interaction is making it difficult to maintain attraction and to set up plans with the woman I am dating, and it has become worse the last couple weeks despite our in-person interactions being consistently great. Am I being too anxious/not understanding enough or is she a bad communicator? How do I bring this up with her?", "I've also worked on expanding my resume to almost ridiculous standards for my age, doing anything and everything my parents would let me do, I became the president of a clubs and a member of 3 others, applied for and was accepted to a tuition-free program that lets me go to a college campus rather than my high school, have a 3.3 GPA and am working on raising it, and do occasional community service. The only thing that I need to do is get a job and save some money, but my parents have forbidden me from doing so. At the moment my prediction is to spend the year attending classes, applying for scholarships, and working during the day before couch hopping with a few friends for a month or 2 and spending the rest of the time staying in hostels when I can or sleeping on the streets when I can't before hopefully getting into college where I'll have a reliable bed. TL;DR: Working on boosting my resume, making friends that I can couch hop with for some time, and getting a paying job. Thanks for your time!", "I asked him three time what happened. And after the third time I cried and went home. Month later he still don't talk to me and he and my mother started fighting for the first time in the relationship. Me and my mother honestly don't know what to do, he just ignores me. I even told him that I don't date that guy(even though I date him) and he didn't even react to it.", "Was the entire hood in the world trying to off me? What’s going on? Those are the thoughts of my mind every time something like that happens and it wasn’t the first time I’ve heard, “God does everything for a reason.” A while back, when I had a home a man needed a way home with his old man, and asked me to drive the old man’s car because the old guy was too drunk to drive and the young thug didn’t have a license. Of course I said hell yeah, he’s got his pops with him… and I’d miss driving, and good karma.", "We lived together so I spent the whole day yesterday packing up my things and crying. I’m heartbroken but knowing he’s unfaithful makes it easier for me to move on because it’s his fault. Not mine. I don’t know if something I did drove him to find someone else but I know I didn’t deserve to get cheated on. Anyways, he doesn’t know that I found out and I’m planning to simply move out without a trace.", "She would be coming to the states for the first time in over 10 years on Dec. 30. I was ecstatic to finally meet my MIL. We've chatted on several occasions and she is truly a great person. Rob was excited too so he wanted to make her trip memorable. He decided he wanted to get a family portrait painted for her as a late Christmas gift.", "I cant function just having a hostile room mate, not needing to work, there's literally no way I can function homeless. I'm barely keeping myself from suicide at this point. I cant go into a residential care facility because they mistreat and abuse people extremely often in the united states, and I cant handle further abuse or I'll end up killing myself. Any ideas on what to do? thanks.", "On his 21st birthday, he consumed way too much alcohol to celebrate, and I regrettably saw an entire different side of him. I noticed that he had crazy eyes, and he was being very aggressive in speech. He seemed very off to me, and demanded to know why I didn't want to sleep in his bed that night. When I made up the excuse that I had to be up for something early in the morning, he demanded to know what was wrong with our relationship. I kept calmly assuring him that we were fine, and that I just needed rest that night.", "Every day I hope she messages me, calls me, or post on my Facebook. Any advice would mean the world to me. Thank you.   ---   **tl;dr - can't get over my ex**: How to get over my ex!", "I could try to transfer to another Olive Garden in the new area, or get a job at another restaurant. It's quite easy to get established at another restaurant. Does this sound like a good scenario? I'm currently living with a friend and bike to work. I just want to get on my own agaim asap.", "I tried to tell her what I was changing and why, but she just shrugged it off and started to fall asleep. It really bothered me because I was genuinely trying to help her. Overall, I am really conflicted about this whole ordeal. When we tell her things she doesn't understand or want to hear when it comes to jobs, she blows up on us. We have both had multiple jobs and written many drafts of resumes and cover letters.", "I'm pretty healthy and have a silcock key for water but surviving the heat goes beyond just staying hydrated. Not enough food or the salt that comes with it led to bad cramps most mornings. Sleep was but a wishful dream. When the night time lows are still in the mid 90s, you just sortta sweat and doze. Flip your pillow when its soaking wet and repeat.", "I specifically told my father NOT to lose my money gambling. I'm not that depressed since I sort of expected this to happen, but I am still severely disappointed. I am literally continuing to lose respect for my own father. Of course, it isn't so much the money, but rather that he would do this to me when I told him not to. I fear that if this continues, my father will continue to waste away his own life as well as damage mine.", "This week, we stayed in the same house and I slept with her. We were watching a movie when she went to go to sleep in the next room (she's very tired a lot). About an hour later, I heard her crying uncontrollably and shaking and screaming. It was really hard to see. I held her until she went back to sleep, and then stayed with her.", "I'm trying to figure out what I learned that is good from it. but all I can think of is that I learned no one can be trusted including myself, people are inconsistent and unstable, people don't know themselves, if love exists then it doesn't mean much, and even if you truly believe that someone else cares about you and wants you in their life to the point where you finally don't question it, they can cut you off and start treating you like you're worthless without a moment's notice. the more I process what happened the more I realize there is truly no hope for me finding the kind of relationship I hope for, and there is really nothing else worth living for besides that. so, fun stuff. right?", "Alright Alright Alright. I've been dating a single mom with two kids from two different guys who help out. She was married to the first for several years and has a 2 year old with the other. I've never had any kids myself. She is highly involved daily with many of the people that have been apart of her previous lives and relationships.", "But this time if she ordered me a shot, I gave it away. I'm one of the only friends left who will go out to eat or drink with her, and I don't want to do it anymore. I feel I am enabling her diseases and I feel extremely guilty. She is worrisomely thin, and I don't think she'll live another 5 years. I honestly think the only calories she retains are from alcohol.", "The problem is that before I even ask for him to do this like a grown up, I have gone fully Zuko fire bender mode and decided to unleash my wrath on Joe for not doing this. Other stupid occasions I have done this? Well, did it cause when we were long distance he wouldn’t initiate calling (I know Joe too well to know this is just unnatural for him), holding my hand more than he does, coming home and giving me a kiss, honestly he has a faster pace and I even equated him sometimes not walking at my pace as him not caring. What has Joe actually done to show me he cares? He puts up with my rage and abuse, he helps with my mother (who is nuts herself, so I guess I take after her), he has offered financial help if I need it (doing MSc).", "He doesn't have to spend a load of money on things I like! He can use it to spend on himself. I don't understand why he feels that just because we're in a relationship that he has to \"spoil\" me. I enjoy being spoiled but only when I'm the one spoiling myself, haha. TL;Dr: My boyfriend doesn't like that I don't want him to do anything for me", "We had signed up for the boat ride (something she was extremely excited about), but the lines got a little backed up and the time got pushed back. An hour had passed of us at the event and we were scheduled to go on the boat ride in about 15 minutes. However, since that hour had passed, her boyfriend refused to stay any longer and made both of them go home, even though she really wanted to go on the boat. These are some of the bigger events that have pissed me off; however, they have the same fight everyday regarding their differing values, and her wanting to do things/live her life and him refusing to make any sort of sacrifice or compromise to do that with her, resulting in her just settling to the situation. Since graduation, he accepted that crappy job and moved across the country, taking her with him.", "I got upset and called the dogs in and closed the door. When he came in he avoided me at first and when I confronted him about lying and sneaking around he defended it by saying it's my fault that I'm not okay with it. I've never been okay with it and i feel like I've been lead on throughout this entire relationship. The fact that he would prioritizing getting high over comforting me really hurts my feelings. I'm tired of feeling like a plant is more important then me.", "She works 6 days a week and usually ends her work day around 9-10pm. I work from 9-5pm. She lives across the city, 45 minutes away from me. When she works, we can hardly meet. So when we do make plans to meet, I extremely value those time.", "I'm just scared to death. I have anxiety problems which are probably contributing to it. But he keeps telling me he'd never judge me for anything and my sister said if he's OK with a missing tooth, he should be OK with a gap. I'm worried he'll see me and change his mind about me and I don't know what to do. Should I tell him about it first or just see what happens?", "Though we both had crushes on each other we weren't sure if the feelings were reciprocated. She also has some self esteem issues and told me that she wasn't ready to date someone like me three years ago when we first met, because I was \"too intimidating\", but instead \"settled\" for her ex. She dated that ex for two years, but never seemed that interested in him. She would complain about feeling like a caregiver for him (he was seriously depressed to the point where she had to make doctor appointments for him) and always talked about wanting to be with someone who was more independent and had their life together. As her friend I remember her saying she felt like he was good for her at the moment, but that she knew it wouldn't last forever (side note: she was open about her feelings with him, and he agreed to just enjoy things in the moment, though I'm sure he was secretly hopeful she would change her mind).", "The problem is that she won't accept the fact that I want to break up. She says I'm not giving a good enough reason. And she wants me to keep talking to her because I'm her only good friend that she can talk to and thinks she can win me back. I'm a pretty nice guy, and I feel bad for her because I know she struggles with making friends, and I feel like an ass if I just leave her. Help me reason with myself that this is a good idea to leave her and stop communication.", "It’s like hes expecting my tummy is spilling over my jeans like a muffin(it’s not) I’m still a size small instead of an Xsmall like I used to be when 14 but that’s pretty fucking normal I reckon.its like god help me if I’m a medium right? Today I lashed out at him by saying omg dad it’s cuz I’m wearing these pants today ( the pants which are wide, loos high waisted and make ass look bigger), instead of skinny jeans so I obv gained like 10 pounds or tonnes of kilos or whatever overnight. Later on he said “it’s so easy to make you mad you shouldn’t react that way just cus you don’t think you’re fat”  this made me think that he is doing this to get a rise out of me which isn’t cool for 55 yo dad or you know an adult. Or another reason is probably cuz he is getting older and living a sedentary lifestyle, it’s the holiday season and he put on weight he’s not doing anything about it and he’s taking it out on me, he’s a bit chubby but not like overly flabby it’s just most shirts don’t fit anymore. Anyway this part isn’t relevant to my relationship but I’d like to share anyway.", "I was in a rabbit hole of youtube videos over the weekend, starting off from music videos, then vine compilations, and then somehow fight videos. On one of the side videos, I noticed a video involving \"XYZ high school\" where my boyfriend attended. The video was actually pretty clear and my blood kind of ran cold when I realized one of the 2 kids in the video was my boyfriend. It was absolutely brutal. And there's no doubt that this was him.", "A nasty one. Once it cleared up in a while I decided to take his advice and find a ride to brunswick. I asked around and the last person I asked said he was headed that way and I could join him and his wife, provided I showed some ID, I look younger than I am, so he assumed I was a runaway. When I rode to Brunswick he preached to me about God and told me he was from Florida. Another storm approached.", "Don't have a bus pass or anything unfortunately. The question is...where? I haven't seen any homeless shelters near me, much less ones for women. I currently have no job. Nothing.", "I am employed full time. I have money, but I am trying to put all my money (minus transit pass, medication, and toiletries) towards an accelerated debt re-payment plan and get debt free by spring  so I can get a lease. I need affordable options. What are some healthy things I can eat that are cost effective when you don't have access to a fridge? I  have a small locker at work.", "**How can I move to a more mature kind of love that is less focused on me and my fears, and instead more about him and our relationship? **   ---   **tl;dr**: Feeling like I am being selfish and immature, mostly focusing on my needs of distance and validation and less on those of my LDR bf. Worrying about the possibility that we might not like each other that much anymore once we live together for a while.", "I plan on parking my truck there and hanging out until I have to work and get supplies. I rarely see cops on the highway where the old road starts nor have I heard about cops going into the area. As for thieves or strangers, I have a rifle and once I have a tent I'll use it as binoculars to see anyone coming. Obviously if I'm in my truck I'll just drive away. Can't think of anything else to worry about.", "And they all make it sound like I will have infinity free time and money to go exploring all over where I'm going, like I'm going on a damn vacation. I'll still be spending all my free time job hunting. If they want me to come right back to a shithole that doesn't want to hire me because I'm supposedly overqualified just by existing (I keep getting rejections telling me I'm overqualified except for the one that asked me to fill out yet another application despite me handing them one two weeks ago), maybe they can pay my way and then they can pay for all the months that I don't have income. I have come back here too many times already to nothing, and they seem to think I'm just hanging around having fun living in my car. Unbelievable.", "That night wasn’t so great for me as I felt ignored because both of the guys (my bf and the mutual friend) were mostly having conversations with her, leaving me to trail behind. I thought maybe it’s because we were “hosting” her and because she’s on the opposite side of the spectrum compared to us - as in, she’s into things and engages in those things we’re not necessarily into, but are interested in and could hold a conversation about. Anyway, over the course of our relationship my bf would still bring Sally up occasionally, how they were going to hang out with other coworkers. Of course, I’m totally okay with that and I encourage him to be social when he can! I’ve met all of his friends and I always enjoy myself around them - except you know who, enter Sally *rolls eyes*.", "Even when she hated me, I didn't hate her. There weren't enough good friends in my life for me to afford hating her, and there still aren't. I can't describe it. She and my mom were chatting at dinner (they're the talkers of the family), and the whole time, I was just glaring at her. She tried talking to me, and I felt my entire body physically tense, and I was just viscerally angry.", "I [26F] have been with my boyfriend [30M] for almost 5 years now. We live together and talk about spending the rest of our lives together. While being home for the holidays, I was re-aquatinted with a friend who helped me through a tough time in high school. In a completely platonic way, he supported me after I was left heartbroken by my first love. He has always been compassionate, understanding, and non-judgmental and has given advice that I still live by today.", "Apparently it has been going on since the day they moved in together. I don't know what to tell her thought. Since her husband is a good friend of me and my husband it's kinda weird for me to say 'leave him' or 'get out' I don't want to influence any decision she makes. What should I tell her? Tl;dr: friends husband is aggresive and I don't know what to tell her", "I will not be sharing my credit details. Though hard, I will end my friendship with her. Might think about it if she apologizes but am not sure at this moment. I will cherish connections with more on my other friends who were super nice to let me know what's happening at home. It's really frustrating not being able to confront Jenna physically but as others mentioned, I hope others who've initially believed her will realize the truth.", "I know this goes a bit beyond /r/relationships, but I'm also asking for advice on how to deal with this as far as our relationship is concerned. What do I do?   ---   **tl;dr**: Girlfriend's violent, crazy ex-fiance is out of jail after beating up his grandparents, and I don't feel safe. What do I do?", "Plus, we’re using his car, which will eventually result in the usual wear and tear and expenses. We equally split all shared expenses like gas, food, rent, and bills, but we both have the same salary and similar assets. Do any cohabiting couples pool and split their commuting expenses equally, or do you just chalk it up to a difference in individual expenses and each pay your own way? tl;dr : My boyfriend's commute is twice as expensive as mine and it doesn't really seem fair. Should we split it?", "What do I do?   ---   **tl;dr**: My fiance completely cuts himself off from our son and me and sulks for days if his sports teams lose. I am tired of having to plan our lives around his teams and cancel plans when they lose, but he doesn't see a problem. I don't know what to do, but I feel like I can't keep doing this.", "Both me and him want to keep in contact and still do things together as friends but i find it extremely hard. Also i know there is a big age gap, i am 23 and he is 39 but i have connected with him in ways i never connected with anyone else, and both my previous relationships of 3 and 1 year was with guys that were 11 and 13 years older than me, i just like older men and i am more comfortable with them. Could all this feelings be wrong? Could it be because i have no one here and i found comfort with him to be the reason i developed feelings for him? I am not sure and i want your help!", "(Mind you we are all here from DSS/Social Services and in this homeless motel shelter) So now it is about 10:00pm and once again he knocks on their door and tells them to turn it down and to be quiet. Nope...that's just not going to happen, as soon as he was out of earshot the cRap music and loud partying resumed. So I sit in my room perplexed as what to do about this,(wanting to get some much needed sleep) as it seems asking them to turn the music down and to quiet down was not going to happen. (obviously they're above the rules and law and don't give a shit about others in the motel) So I sat there thinking and I decided to call the owner/manager one last time and tell him PLEASE get these people to be quiet and turn the music down and to quit being so damn loud. He tells me \"I have told them 2 times to turn the music down and be quiet and they won't listen to me, why don't you call the police yourself\" I was floored by him saying this to me and told him it was NOT my job to enforce the rules, it was his.", "I was a little confused at what they meant so her husband decided to meet me and talk to me about what was going on. The way that he put it, he was saying that my husband wouldn't get physical from what he could tell, but there are boundaries that he passed. Unfortunately, he couldn't provide any examples because he couldn't remember what was said, but he could remember the feeling that he had, and it was disgust. This was during the holiday season when their company had an influx of new people and they would be gone within a few weeks because the work they do is very physical and not a lot of people can handle it. My friends husband told me and quote, \"There's friendship, there's flirting, which he did but its innocent because everyone flirts, but then there's certain boundaries that you don't say to someone else while being in a commited relationship or marriage with someone else and he was doing that.\"", "There became two sides of me I battled within myself. On one hand, I wanted us to build a life together, to experience that love and the relationship. I did most days. On the other, I wanted to absolve myself. I obsessed with it.", "**Tl;dr: Thinking my 2 friends who broke-up are soulmates but may be both heading for a second-best option. ** Very long post, please read only if you are interested in complicated realtionships and take it maybe as a short novel. I have 2 friends who got together when 19, they were inseparable, instant soulmates, I know they imagined their whole life together almost immediately, never even thinking they can break-up. For 10 years, they were the best couple I know, not fighting, respecting each other greatly and having a \"higher\" connection.", "I thought they’d give me another date to come back or put me on probation but that did not happen. They told me I wouldn’t be allowed back to my house until my court date in a MONTH. And even that is certain. Well I found a friend that I can stay with for another 2 days but after that I’m unsure of what to do. I’m currently unemployed don’t even have a license, there’s literally no one I can stay with my parents are refusing to talk to me.", "Sally is around the same age, 25 I assume, (can’t confirm numbers, sorry about that) and she quickly became a red flag for me. He would mention her name occasionally and how our love for the same type of shows was shared with Sally. Sally and I met a few times. The first time was when we planned a day out shopping with a mutual friend who was single at the time and my bf decided to invite Sally. I thought that was a little weird, but justified it because 1) I had never met her and thought that would be a great opportunity to and 2) He said maybe the two of them would hit it off.", "He admitted to using the social media of girls he knows to get off. He even admitted to using his ex's nudes to get off. He downloads that specific app and then usually deletes it. He forgot today. We have sex 1-3 times a day.", "<url> My mother is 60 years old and has been somewhat homeless for over 2 years now in a city about a 3 hour drive away from me. She often meets people on the street that allow her to stay with them for a little while, but it seems that many get tired of her mania/excessive talking and lock her out. Also, important to note: she is an alcoholic, very intelligent (was a biologist), has had mental issues since 2005, and has been in and out of correctional facilities for various things related to drugs/drinking and violating parole. I haven't noticed her in a depressive state for over 3 years now.", "(Hurt the ego, but whatever, I guess you're not always gonna be the hottest guy she's ever been with.) Then I found another thing that pretty much destroyed me - an e-mail to her high school boyfriend begging him to come visit her and have sex with her, because of how fantastic it was when they used to have sex. This was probably half a year after we had split up, and the implied comparison with me was pretty clear. Making matters worse is that this guy basically checks all the boxes on shit that makes me insecure - tall, douchey rich guy (in contrast to me - 5'8\", not at all douchey guy with a good but not incredibly glamorous career). Anyway, these pieces of information - that she pretty much opened up to me sexually only when she felt threatened by another woman, and that she has clearly been with other guys who she's had much more sexual interest in than me - pretty much led me to the alternate hypothesis that it wasn't the vaginal pain and the birth control so much as her lack of attraction to me in comparison to past boyfriends.", "“Hey you can’t lay down like that man.” I could tell you what I wanted to say to the oversized Krillin looking mother… *inhale* but that was because I was tired. I sat down to kill time before the shelters in the morn began to open. I decided to make base in Atlanta, because I knew leaving any further North would make it hard to return to Savannah with the ticket that I had. I was bound to Georgia, until court day.", "She didn't go home with me, she took an Uber. It was the worst 30 minutes of my life. I payed for the food, got it to go, and went home. This is where it gets crazy. I wanted to be away from her at that time.", "Her parents supported her. I told her I thought it was a bad idea, that she should finish what she had left (she's an excellent student, super smart and committed) and then go to study the other career. But if she decided to leave I would support her 100%. She decided to quit. The other career was in another town, my home town (<2hs away) she rented an apartment with 2 girls and moved away.", "I am so confused! Why is he playing these games? I have made it clear I want him back and to me it’s like he has feelings but is unwilling to say anything? TL;DR I’ve been dating a guy for a few months, we split up over a silly petty argument, since we’ve split up he’s been maintaining that he wanted us to break up but he’s checking in on me and asking what I’m doing. Is he just being controlling or does he have feelings still?", "feel free to delete or disregard if this isn't in the right sub. I saw a guy for months having sex a couple times a week. But not just that, hanging out and being friends too. In December he asked me what we were. I knew that this was something we should talk about and so we sat down and talked it out.", "We've talked about it before and she said that it's not like that and she cares about me alot and all that, but at the same time these type of things keep happening. I truly feel that she does care and doesn't mean to neglect me but its just frustrating. If I keep saying something I'll look like a bad guy thats trying to ruin her friendships which is not what i'm trying to do. She's going to tell her friends what I say and they're probably going to think i'm trying to get her away from them.   **tl;dr**: Girlfriend is having trouble balancing friendship and relationship", "Hey everyone, throwaway for personal reasons. Tonight my girlfriend met her lady friend she didn't see for a year. I bought them wine, paid for dinner and was happy to give them the entire night if they wanted to so they could spend time together. Later on in the night I received a call at 1am requesting me to take her home. I get there and there's a person I've literally never seen before, a guy.", "I obsess about this in my head 24/7 and even though I try to stay positive, the truth about how I REALLY feel comes out almost every time I go out drinking with friends and I become extremely negative and sometimes cry alone. My bf has told me that he is unhappy with my weight and he also hates seeing me unhappy. A summary of my bf: he is a complete workaholic, he loves me to death, he tells me how beautiful I am every day, he has dumped me 3 times because of my weight, he thinks I am an excuse maker and he does not know if he will commit to me. I am indian and he is white. I have been in the US since I was 6 and if you ever spoke with me on the phone, you would never be able to guess that I am indian.", "It is the winter and Tyler and I have been going out ice fishing a lot, it’s nice because I get to spend time with him and it’s something we both like to do. Well, once Zack found out, he tells Tyler all the time how they should go, etc. Well, Tyler fills up his truck (it is never under $120), fills up the four-wheeler ($60), and Zack walks over to our house with nothing but a helmet. He has absolutely no ice fishing gear, but knows Tyler does and, again, uses Tyler under the guise of “friendship” so he can go. AKA, I don’t get to go anymore.", "I broke up with my bf of 2.5 yrs on Sunday after suspecting he was the reason why I had fallen into depression for the past year or so. I became more irritable, rude, negative and angry... which was not like my usual positive, polite, and bubbly self. He was often very negative, had anger issues/tantrums, impatient, interrupted me a lot, would ditch me for cocaine, didn't know how to drink alcohol (often consumes until he pukes), was a hypochondriac, always broke (yet had money for weed/shatter or sports betting or junk food or alcohol...), but at the same time did not look after his own health unless I pushed him to... just a lot of care-taking and issues. He has depression and anxiety as well. One of the things that really killed me inside about him was his last girlfriend who had died in a car crash about 1 year before he met me.", "I don't think it would be different in another relationship, and I think both of us accept that we have sexual hangups. But I always wonder if I would be more sexually passionate in a different relationship.   ---   **tl;dr**: Do men just inherently look at the greener grass, or does a good relationship make you feel settled and satisfied? And please don't say \"open relationship\" as the answer...", "I have a short term plan, but nothing long term at all. I’m assuming she’s going to shut off my phone in the next 24 hours, so I’ll have no access to texting or calling services until fiancé can afford to put me on his plan. Unfortunately, he may lose his job because he was living with me and my mom. Today we had a really bad fight and she’s at home while I’m outside... I don’t think I can go back anymore and I have nowhere to go, with the very little money I have on me and only the vaguest sense of what to do.", "I just want my time to matter more, and I have an idea that this might help. But for several reasons I'd need to stay within my greater metro area. So do you guys have any tips, advice or life hacks from your experience? Thanks in advance ya'll. Happy trails.", "Today we had a really bad fight and she’s at home while I’m outside... I don’t think I can go back anymore and I have nowhere to go, with the very little money I have on me and only the vaguest sense of what to do. I’m an 18 year old non binary and have had a shitty relationship with my mom ever since my dad left when I was 8. I live in a drug heavy area that is riddled with gangs and is definitely not safe at night. Shelters nearby are full, I don’t have a car, and no friends or family to turn to.", "At times, he would get stalker-ish, and she would remove him from her contacts. This would infuriate him, and he would create an alternate character to threaten her, saying how he is going to find her, kill her, and tell me about their relationship. Being scared, my wife would add him back, pretend to be friends, only to repeat this cycle over several times over the next few years. Yes, they somehow remained \"friends\" for years after this affair. The next stab came when I was sent to an Air Force base for a 3 month training for my job.", "My mom has always been a pushover and is known to give him money with no questions asked. Last night, my brother sent a group message to me and my sisters telling us to not tell our parents anything he is saying and that he loves us very much. He says he started selling drugs recently to make more money and some of his supply was stolen and now he's afraid his \"friend\"/dealer will come after him. I offered to let him spend the night at my house if he felt unsafe, but he declined my offer and said that he'll take care of it. I tried to reassure myself that no dealer will kill someone over a missing gram of pot (he was advertising on snapchat) and I went to bed hoping that he would just get roughed up if anything.", "Me (28F) and boyfriend (39M) been happily monogamous for 1.5 years. We have a good sex life. We have only mentioned a couple times that it might be hot to add someone else to the mix, if the right opportunity presented itself. I met her (22F) in my pottery class and immediately felt a girl crush which is really out of the ordinary for me. She’s super cute and we have hung out as friends on several occasions.", "However, I am resistant on it right now because I am thinking there is no point. I would rather stay here for the last few days then go because at least for now I have a place. Once I get out of here and the hospital, though, I am unsure of where to go. What should I do? I live in Washington D.C. so there seems to be a lot of facilities and help here.", "She keeps using the phrase \"right now\". Whenever I ask her about us she says \"right now, no, but in the future who knows?\" I decided to put no contact measures into place as I could not give her what she wants while staying in contact with her. As much as it pained me to stop talking to her, I know that I need to do this for her as well as for myself. When this happened she was bawling over the phone, but she never questioned it.", "After a few days I start to try to make plans with her to hang out or go out to eat even if its only for an hour or so. She ends up saying no almost all of the time and I'm getting to where I don't even ask because I feel bad that she has to say no. And this leads to me feeling lonely and unwanted. The part of this that doesn't feel fair is that she can ask to do something with me at anytime and I basically drop everything to go do whatever she wants. I say yes to literally every thing she asks because I just cant help myself not to.", "She's super neurotic and would be a project** **A place for my Aunt to stay. She's pretty much helpless on her own. She's 53 and has lived with my grandma basically all of her life. Once my grandma's mind started to go, the taxes suddenly weren't getting paid, and this is why this happened.", "I wanted to plant a new chapter in my new city, but haven't had time to devote to making it happen yet. I feel like I was the only one taking it seriously and it's dying a slow death. My problem is that one of the acquaintances is giving me a lot of power play-type problems. For example, I'll request *four times* in three different mediums we use, to email contributions to an end-of-year favorites list and rather than do that, she put hers on a share drive and told others to do the same in spite of my multiple requests to email me instead for better ease of sharing. Emails are met with snarky responses or half-measures which mean I still have to chase down.", "She never really felt the need to do that and occasionally would go out with her friends. Everything was great -- I took care of her extremely well, she took care of me patiently and amazingly. I bought her a car, paid for her rent, and ultimately supported her so she could focus and finish her college (I'm full time employed, the breadwinner in the relationship). Our relationship was VIVID and full of color in the beginning. We had our own apartment, got a beautiful dog together, and traveled to a few places.", "Is this the way our state agencies treat the elderly and disabled? Obviously so, because they're doing to ME!!! and to others. I have brought this up no less than 4 times to my case worker **name removed** from adult protective services and she just ignores it and keeps telling me she will \"look into it\" and does nothing about it. I am now starting to breakout in skin rashes due to having to wear filthy dirty clothing.", "I will stay with the sub to offer any advice I can but thought a success story was worthy to share. They say never destroy a person's hope. It may be all they have left. Much love to you all for the good tips and advice during my struggle. Thanks!", "I know I should tell her my doubts, because I know she's gone through doubts before as well. But I also don't know if now I'm just second guessing because I'm just generally concerned about the future. Above all I just have no idea what to do.   ---   **tl;dr**: living long distance, dealing with chronic wedding anxiety and fear about impact of children, fantasizing about others, and hoping for insight from people who have been through similar experiences.", "Alright, I'll try to keep this as short as possible. **Some Background:** I have a co-worker we'll call Pamela. Pamela is disabled from complications and defects from when she was born; she has a brain shunt, and some cognitive issues. However, it's not enough to impair her too greatly obviously because she has worked in the call center I work at for about 12 years or so, and in other call centers before this. She receives accommodations for a disability at work though, such as having to meet less strict stats (like time per phone call, or time spent working offline) and being allowed to take a \"rest\" break if her disability causes her issues.", "I tried to break up with him at the end of the semester the day he was supposed to leave but he intentionally missed his flight to stay talking to me and talk me into staying with him. I don't know what to do. Mostly, I am scared that I will deal some kind of huge blow to his mental health and am just very scared of the repurcussions. I have friends apart from him I feel like I can fall back on, but I feel like a monster for confirming his fear of abandonment. I also feel conflicted because he is incredibly kind and generous and affectionate", "2. We were long-distance for a few months although we visited each other almost every weekend. In that time she was very jealous and controlled my movements because she thought I was doing something with very girl who looked at me. In that time-frame, I took to hiding pictures that I had with friends who were girls, especially ones she was especially jealous of. Nothing sexual, just selfies on a night out or whatever.", "I feel like shit for writing this post. **TL;DR - SO of over a decade is great to me in many ways and shit to me in other ways, I feel awful when he's shit to me but also feel guilty as fuck about expressing it because of all the times he's amazing to me. Wondering if this is emotional abuse and if it is, what can I do about it? Our relationship is rock solid, I'm not leaving him. **", "“Yeah I saw, I think he out to steal.” “That’s what I think, keep an eye out man this place ain’t bad but you gotta watch yourself.” *nods* Then I fell asleep. And woke up to a stolen charger.", "Anyway our talk basically went nowhere and she said she absolutely will not stop hanging out with the group. I didn’t tell her to, but I did tell her that it hurts me that she would engage with people who apparently have so many negative things to say about me, and I thought blood was thicker than water. Really it’s her callous “yea I see you’re in pain but I don’t care, get over it” type of standpoint that’s hurting me the most. I’m starting to think she too participates in the trash talking and I’m thinking of cutting her off too. Should I?", "They were late. They tried to play it cool with the excuse they gave, but J had this grin on his face and Lux had the flushes look she gets when she has sex. And then Lux said she was going to fix her hair and left to the bathroom and after a while J said he was going to see if she needed help. Obviously they left to have sex. I mean, fine, but I thought that was a bit disrespectful.", "Hey. First time posting here. I have been living in my car with my brother and cat since May. I am feeling extremely depressed/defeated right now hence why I'm posting here. I'll start from the beginning.", "I went on a week long Mexico vacation with my BF of 5 months, and she tried to sit me down and have a conversation about how if I got pregnant I would ruin my life (I had to teach myself all about those things because she preferred to ignore it, it's a good thing I enjoy research). Now that I've decided to move in with my BF when I move back to my hometown, I don't even know how or when I should bring this one up. She treats me as if I am a child who doesn't think things through on normal small decisions, this is going to be a nightmare. A little information on my own thought process and my relationship. I am a very pragmatic person, but also very independent.", "I've been thinking about this for weeks and have talked about it with her on numeral occasions and I feel like I'm losing my mind. I just don't know what to feel right now and I'm an emotional wreck. Am I overthinking or it are these reasonable things to worry about?   ---   **tl;dr**: worried what people will say about my girlfriend and I.", "Neither did I. This turned to weeks, months and before I knew it it was a year. I was bitter. I never received an apology and felt no consideration for my feelings regarding anything was there. I get confused sometimes as to why in my teen years I was okay with talking to her.", "Any tips for making more friends? Tl;dr: I've had very few friends throughout my life. Recently I've tried reaching out to a lot of people but almost all of them will decline my offer to hang out at some point. I guess maybe this has to do with how I am socially awkward in the past but I've also been told that I am trying too hard. Any tips for making more friends?", "Despite that, all the following is true: * We have both called each other BF/GF and referred to there being a relationship * We have had (oral, but not PIV yet) sex a few times, slept together naked, and have had many intimate conversations, including the last time we saw each other * We both mentioned early on that we aren't currently dating anyone else * We have both talked about going to specific events and doing things together in the future", "I'm worried about my friend. She's really pretty and carefree and intelligent and I've known her since highschool. We had a band back then. She played guitar and sang, I played bass and another friend of ours played drums. We were into the grunge scene and to be honest, we were kinda good for a bunch of 15 year olds trying to make a name for themselves.", "I have no problem with a few years either way, hell the last girl I dated was 6 years younger, but this is an entire decade. That's a lot. But other than the number itself I don't know if I should care this much or not. She's pretty mature for her age and I'm admitedly a bit of a late bloomer so we are in roughly the same stage of life so that's not an issue like in a lot of age differential cases. But I just can't help shake the thought of how weird it seems to me.", "I have had two or three or more reoccurring dreams of me cheating on my boyfriend.. and they are so real that I actually feel awful when I wake up or like it actually happened. I've been spooked when I've woken up because it's actually felt like he left and it happened.. can someone shed some light on what this means? my boyfriend is 18 and I am 19 I am female he is male. we have been in a relationship for around 6/7 months. Recently me and my boyfriend had been going through a tough stage and I've been carrying a huge amount of guilt and I've been feeling like I'm not a good person at all...", "My boyfriend M(26) and I have been dating for a year and a half. We live together. We definitely have issues were working through right now but our relationship has been pretty good. Up until a month or so ago I was making all these future plans with him and so on. I’ve been on and off taking antidepressants for the past 8 months.", "Now like I said, I am working hard to try and get a better job while balancing school (the good grades I've gotten in the past year and a half seem to be only things I have going for me right now. That and martial arts) and at the same time, I'm considering asking for another shift at my current job as an absolute last resort. But this anger and feeling like a loser is really something I need help dealing with. Tl;dr: My car died once and for all a few months back and my job sucks. And even though I'm working hard to improve the situation, I feel angry and I feel a like a loser.", "My husband (29m) and I (26f) live across the country from our parents and have been there almost two years now. I don't really have a relationship with my inlaws (mf 65ish) (ie they never reach out to me expect for once to ask what to get my husband for his birthday and rarely talk to my husband, they don't ask about me or don't seem interest when I'm brought up) and it doesn't bug me because they are incredibly negative and angry people. My fil has anger issues and will have a meltdown in public (he's done it several times in front of me) and my mil is self absorbed among several other issues. I don't want to get into every story, and man do I have some stories, but i guess it's important to know that I've been warned about their general attitude and behavior from others and everyone who has met them that I'm friends or family with has agreed with me that their son is the source of their happiness and they feed off of each others negativity. However, they've never been out rightly malicious towards me.", "I was venting how pissed off she made me to one of my friends. I didn't know [3M] was listening to our conversation. He asked me and my friend what a period was. My friend took him to his mother who was in the kitchen. She just told us to keep an eye on him while she did some things.", "I didn't have time to text a lot like I used to, and certainly couldn't realistically plan trips to see her anymore. She was plainly unhappy with me for not being as communicative anymore, but things really came to a head when I began dating someone. Lisa was the only person in my inner circle of friends to have a poor reaction when I told her I was dating another woman, which was shocking to me because I trusted her, and because she often used social media to convey her allyship with the LGBT community. She often told me that as soon as I met my gf, I quit talking to her (Lisa). As my relationship with my gf became more serious, Lisa and I became even more distant from each other, and she would often ignore my texts or emails (neither of us were ever much for talking on the phone).", "He turns it on first thing in the morning and turns it on the moment he gets home from work at night to play until midnight or later. Any free moment he has is spent playing this game. I'm a stay at home mom so I really look forward to talking to him, he's usually the only adult I talk to face to face during the week. Plus I love talking with him and spending time with him anyways, that's why I married him! Back when this all started, I told him that I needed him to spend more time with his kids and  I.", "We broke up a month ago because the distance made us miserable. We had only been doing long distance for 3-ish months, which is not long at all, but we had been dating before that for roughly 3 years, with a short break in between. I'm taking a gap year so I've been bouncing from place to place & my parents are so protective that they don't let me visit friends at college often (especially not her since they are suspicious of our relationship anyway [homophobia lol]). I did visit her once, but only for a few days and she visited me in return. Anyway, we both couldn't commit to a strict schedule of meeting up because of school, parents, money...", "But, for now, and until I'm on the proper road to recovery, I just feel no need to have sex and it worries me more than anything. He says sex is natural and in-the-moment, but I find myself having to plan everything down to what to say and do in advance. Sex just doesn't come naturally to me. This has been posing a major threat to my sexual identity, and I fear if I initiate tomorrow I'll just burst into tears in the middle of it all. I'm so, so scared.", "Could I be arrested for camping somewhere? I've never been to jail and don't want to go to jail for having no where to sleep. Do you recommend camping or finding a church or shelter that would take me in? **UPDATE:** Thank you all for the responses. I know I have issues but I feel they cannot be solved by taking medications.", "I thought we had an open door, honestly policy about our hook ups, but last week found out he'd made out with a few people during our relationship that I didn't know about. I got hit by a wave of how incompatible we are and tried to break up with him but I realised I was being a hypocrite and letting my insecurities control me and I mended things. ANYWAY, onto the issue. I had a pretty scary time with a friend of mine last night. He invited me around for a few beers, and maybe two drinks in he asked if I'd be down to have sex.", "2) Sharing Home 3) Helping to watch one another's children as best as the can get their work schedules to Mesh? HAs anyone ever seen a homeless family co-op which works in any way similar to that? I will be a single father ( married but my wife wont be allowed into the country untill I make enough income) and am tying to strategize the best approach. Thanks!", "The messages are essentially the guy being flirtatious and asking her to come over to his place. My gf’s responses are not flirtatious but definitely welcoming. She responded to his offer by saying “how about we meet halfway and grab some lunch together some time”. She never told me that she was even still in contact with this guy. And their relationship was explicitly sexual, not friendly.", "Hi Everyone, I've been dating my GF for about 10 months, and everything is pretty good with the relationship. I think the two biggest weaknesses are my clinginess and her sometimes-poor communication skills. I like to express how I feel, and I'd much rather talk about the elephant in the room, whereas she likes to sweep things under the rug. We met at college, and her girlfriends from school have a group of guy friends.", "He wants me to study abroad in Europe after undergrad, then return and work for the government in economics. I don't mind the Europe part, but I have zero interest in working for the government and am absolutely shit at economics and I've told him so. No matter how many times I express my lack of interest, qualification, or skill at economics, he ignores me and continues to push this path. It wasn't like this was something he's pushed on me my whole life - it's like he came up with this plan for me when I  turned 18, and now is obsessed with it. I really don't know what to do.", "He doesnt seem bothered about calling me or meeting me unless I initiate. We dont talk for very long as he still lives with his parents and is apparently always \"busy\" helping his mum. Im mostly available, as I work part time as Im a student but I live in a rented shared flat. We seldom talk about the future. I want to talk about the future, I planned to work abroad this year as I graduate soon but stopped those plans after meeting him as he is only in college and will take another 3 years until he finishes education.", "For example, I'm selling something that's worth £50? You can have it for £10. I hate it, I want to cry. I've had items listed for about 2 weeks, they're all responsibly priced or under and I'm having to accept low ball offers as I have no other choice. I would never let myself in a million years do this if I wasn't homeless but the clock is ticking and I need to move.", "*Road to homelessness. * I develop the idea that I was going to die young, at around 21 yrs old. I dont remember how I came to this idea but this was it. I was obsessed by this idea.", "But then I'll get there and he'll drop the bomb that his GF is coming over and to be honest, it totally makes me want to bail early. It's just annoying to be invited to come over and thinking you're gonna have some bro time gaming and what not, only to get there have him drop the bomb that his GF is coming over and being stuck between either listening to 5th grade cheesy/cringeworthy convos or figuring a way to bail early without coming across as an asshole. How can I talk with my buddy in a polite way about the matter, that when he invites me over I'd prefer it to be bro time without coming across as an asshole or that I'm against his GF as a person which I'm totally not! Again, she's really sweet and he has every right to want his GF to come over to, I'm just tired of the surprise third wheel through the most goose bump inducing conversations and want some strategies how I can communicate with my friend that I don't like sitting through that. Thanks in advance!", "Email her? She lives in his hometown, so an in-person meeting is not possible, nor do I think it would be wise. Should I do it anonymously? Should I provide screen shots of our conversations right off the bat, or wait and see if she requests it? I feel like I may only have one shot to do this and want to make sure I do it right.", "The problem occurs when he returns to visit me for 1-2 weeks. When he's back at his girlfriend's house, he doesn't really have much to do. So, he spends a lot of time gambling. That in itself is a gigantic problem since we have almost no money. He is gambling money that he **can't afford to lose**.", "She taught me a bunch at first. In the beginning of the week people asked what me and my Ex did. I informed them we broke up and it was due to infidelity on her part. This was not a cool move, however, I knew her sister would try to paint me as the bad guy. I was spot on.", "My brother and I usually get along but for some reason, he makes me really angry, to the point that I don't like who I become. I'm a pretty level-headed guy and never really yell or get angry at anyone but for some reason **when it comes to my brother the anger I get is so overwhelming**. He's the only one that can get me to that point of anger where I start sweating and shaking. He's never \"hurt\" me in a major way before and all the things that annoy me are little things like ignoring me, not responding to me when I talk to his lack of eye-contact and him generally ignoring/disregarding my attempts of communication. I don't wanna be like this towards him and I don't really know what to do.", "I've never been on this side of the road, being the one to let someone know I'm not interested. I wouldn't know how to go about letting her know without completely devastating her. I know there is a risk no matter what I say, but how should I go about it gently.   ---   **tl;dr**: Person wants to hook me up with his adoptive sister, we have nothing in common, how do I tell her that I'm not interested?", "I can afford it alone. He just has nowhere else to go. His wages are low, he relies on me for transportation. I actually have to leave my job during the day to drive him to work. It is tough on me to do that.", "I'm running out of ideas for how we can talk to one another more often. I know it's going to get worse. She'll be starting grad school in August. I've been through grad school already myself, and I know how time consuming it is. She'll be busy.", "We've been through so much. This is easily the toughest break up I've ever had; my other relationships were very easy to get over. **TL;DR** I broke up with my bf who had anger issues, financial issues, drug and alcohol issues, depression and anxiety, and unresolved feelings from a gf that died in a car crash 1 year before he met me. But his good qualities where he was considerate, loyal, caring, honest, gentlemanly and supportive is what makes me miss him. Especially his good-bye text.", "He agreed. I told him a million times, when we were together and after we broke up, that loyalty is my #1 in relationship, period. I hate cheaters more than anything in the world. He knew that from the very beginning. Yet recently found out that I was cheated on for more than 6 months before we broke up.", "I don't know. I keep overthinking everything and I am worrying about what it would be like to be with him for an extended amount of time. What if it is horrible and we end up hating each other? I fear that I cannot deliver what he wants and deserves emotionally and sexually, and those fears stunt my ability to love him freely. I am wary of the fact I have no control over the outcome of that.", "I really need help! My boyfriend and I started dating March of 2017, and we had been friends for a couple years before that. For the first 7 months of our relationship, we were inseparable. We sleep in the same bed almost every night, though we are not moved in together (this comes into play later). We made each other very happy, and there was very minimal tension.", "Sometimes I feel like I’m the third wheel in their relationship. And this doesn’t even include what they may do when I’m not around! Also, whenever roommate will talk about boys or finding a boyfriend, I notice husband will quickly try to shut that idea down fast, and say he knows roommate isn’t attracted to said guy or doesn’t want/need a boyfriend. There’s definitely an emotional dependency there. I know my husband has explained to me over and over how much he helps her and how important he is in her life.", "Haven't felt this excited about someone since my ex from over five months ago. This guy, J, and I met on Bumble. I haven't even met him yet, but we have spent hours chatting on the phone and laughing. It all feels really effortless. I've dated a lot since the break up and no one has clicked with me like he has.", "I need help. My partner's house is a mess. That is an understatement, he has over 60 empty beverage containers on his coffee table, he has over 30 fruit flies flying around, and the odour is disgusting. I don't know what to do, it's getting harder and harder for me to go over there. It worries me because I am a clean person, everything has it's spot.", "State I am homeless as of this morning, without mentioning, the title of this post, screen me for services available to veterans. Or maybe I should go to a homeless shelter first (proof of [the lack of] residency). Dad wants me out tomorrow morning. I suppose my original question, is/was, what is the definition for being homeless? The reason for being homeless is not a subject I wish to discuss.", "His refusal to admit to anything though has me worried this is part of ongoing deception/cheating. When he completely denies knowing anything about it I just don't know what I can do with that. It feels like my options are to get over it/give him the benefit of the infinitesimal doubt or leave him over the inferred deception. I guess I have mostly just let it go but then every so often I remember about it and can't help but wonder, am I a colossal idiot, is he taking me for a ride? **Tl;dr** Found an okcupid profile for my husband, he denies knowing anything about it", "I have a friend whose recently been made homeless by her family who housed her for a while after the break up of a long term serious relationship. I’m an immigrant here so I don’t understand Texas’ thousands of ridiculous laws. However I want to know how I can help my friend out. She receives $600 a month child support for 3 children, and is currently a student (not enrolled for summer because of homeless situation) otherwise her only other income is FAFSA. We have tried all section 8 facilities in the north texas area and all have told us theres a 7-10 year waiting list.", "Mostly, I think I just want a mom. I've been struggling with anxiety really bad, and a lot of it has to do with my relationship with my boyfriend. This is my first boyfriend. He's a senior at a different college. He lives in the city that I go to school in.", "So we were talking about it and she wouldn't budge again. The conversation started to heat up, nothing I said was enough, that we would buy something, that I would cook with her, that we could go 1 day earlier and cook at my grandma's, nothing. She pushed me to the edge again until I lost it and ended the argue saying that she mustn't go this year with me. That she must stay with her family, that I didn't want her to go with my family so she wouldn't have to worry anymore. She calmed down and we got to sleep.", "Later that night someone snuck into the building we were sleeping in and killed Daniel.. he was chopped up with what I presume was a hatchet. I don't know why they spared me or Jay to this fucking day but I'd gladly take Daniel's place, he was the sweetest boy I ever knew. We were heartbroken and I vowed that I would find the bastard and get revenge for Daniel. I'm crying as I am typing this part because this is what fucked me up the most. Chapter seven: adopted", "I looked regular for once and it’s been a while to feel that way. I wanted to show who I was today to the world, it was empowering seeing that face I used to be especially when I saw him just a month ago. I left right away to catch any train heading to North Hollywood and eventually arrived at the area of my work interview. I was early but I know I made a mistake without considering how hard it is to panhandle especially when you don’t look it for the part. I had a sign with me and I asked people to spare me a quarter at most but all I got were weird looks.", "I thought that sounded fun so I agreed. The whole way there I was so nervous and anxious. And during was kind of fine but I was fairly scared. it ended up with my friend also having sex with me and I agreed but I was so wasted. Afterwards I felt so sick and repulsed and freaked out by what had happened.", "They can’t get into a shelter because they are employed but they still don’t make enough to afford to rent anywhere. They’ve tried rooms for rent but they can’t get into anything because it’s either, no couples, no kids, male only, female only etc. Hotel/Motel rooms are expensive. They have no family or friends that would be willing to accommodate them. What would you suggest to them?", "Needless to say that is all a lie from him, He is here from DSS/Social Services just like I am. What I am worried about is my safety and security. This guy is obviously mentally ill and a drug addict and alchie, and now I am really concerned that he will do something to me because I stood up to him and his nonsense bullshit. How should I proceed....Call Social Services and turn him in? or call the police next time he harasses me?", "Meet with her today and express this is a concern for me. She says she doesn't see what the big deal is, people make mistakes and forget things. I agree and tell her they often forget what they don't care about. She doesn't agree, we talk about it. She feels I am being very black and white in my thinking.", "I don't think I have the means of moving out. I got my review in Dec. and I was supposed to get a raise if I did well, but they gave me a bonus instead and I know I should be grateful I got anything but it wasn't what I needed and I can't get another job at the moment, nothing in the area is hiring for more than what I make at the moment. But I don't know what to do with my family. Just this morning I heard my sister telling my parents, they should like her more because she is the winner and I am not. I think she was talking about jobs - she recently got hired at a private university and is making great money, has excellent benefits, and could help her get her Masters.", "I tried to reply to most but I think I'd like to forget about this post for a bit and move on. So I'm going to stop replying. If there is advice or information that someone hasn't given me yet and you think would be helpful, please feel free to private message me. I'm planning to go to the wedding. I will not be going out of my way to help with the wedding.", "I grew up my country’s equivalent of the bible belt. My country is well known for being very very progressive in our larger cities, and very very conservative in our villages – this is true I think for most countries, but the sheer difference between our “levels” is pretty well known. I grew up in an abusive household, surrounded by really misogynist men, and have experienced trauma on both these fronts. This obviously caused me some mental health issues. I was afraid of, and uncomfortable around, men for a very long time.", "I’ve been in the mood since Friday night, we had a date and when we got tired and I let her go to sleep. Saturday morning I tried doing some forplay and she stopped me and told me to wait till later that night and she would make it up to me. Saturday night rolls around and she just falls asleep. Sunday morning I climb out of bed and start breakfast, and she said “Too bad you were asleep this morning, I tried to wake you up for something special...” Later that day we were getting ready for a birthday party, and she said, “I wish we could be undressing instead, but we got a party to go to...” I took that as a hint that later tonight she’ll finally be in the mood.", "Suddenly she snaps and goes \"I fucking hate my brother, he is the biggest piece of shit ever, I couldn't care less about him\" and just started going off. Now, I know her brother can be pretty psychotic and from what shes told me he clearly has anger issues and the rest of her family keeps ignoring it, sometimes even enabling it. So 2 minutes into her exploding, she starts crying because apparently her brother told their dad something and the dad called her and said he doesn't trust her anymore or whatever. She was very upset about the dad thing because she's very close with her dad and she's her dads favorite child (he told me that himself when I spoke with him). I didn't want to pry too much because I felt like it isn't exactly my business of their internal family issues, but my girlfriend screenshot the text messages her brother sent her and I just could not comprehend how a human being, especially a sibling, can say that to someone.", "Generally good marriage. We can both be stubborn, so compromise doesn't come easy (especially for DW, who is very religious - I am not). We are at an uncomfortable stalemate. She comes from a family with 5 kids, I have only one other sibling. She feels there is a \"hole\" in our family and that 5 kids is the perfect number.", "It's not a black nd white situation, I panicked, argued and a bunch over this with them, admittedly not helping my case, but I'm over that. I want help for my issues.  Enough sobbing, I sometimes feel so hopeless, but I need to remember that while I am down, I am not out. Employment, temporary housing, even just basic street smarts, I'd like to know how to cope with this situation. What to do, first 100 days and all.", "Original frustrating moment: <url> Writing this so y'all can see what kind of people I'm dealing with! I called up the non-profit this morning to ask if I can use another identification document instead of my birth certificate because getting a BC from the clerks dept in my town cost $28 which I don't have. I asked for the girl that I talked to yesterday since she would know what my situation is but the gentlemen who answered the phone told me that she nor her supervisor was in and that I should call back on Monday and talk to Cassandra or her supervisor to reschedule my appointment that was set up for this morning. Ok I said then hung up.", "He explained that he didn’t think it was such a big deal that he disclosed such personal information about me without my permission to his friends then he tried to flip it and said it was no different then a time I canceled plans with a friend and told them the reason was because he, Tom was sick with the flu and I was going to stay in and take care of him. How is me honestly explaining that the reason I would have to cancel on a friend because my boyfriend is sick, the same as him giving away very detailed information about our sex life plus other very personal traumas that I experienced without my permission? I feel like he’s trying to gaslight me and I’m seeing a side to him I’ve never seen. I’m honestly thinking about ending things with him over this. TL;DR my boyfriend told his friends VERY detailed information about our sex life plus other personal things about my life without my permission and I feel so betrayed but he’s trying to act like it’s no big deal.", "My online friend  -- let's call him Jim  -- is a Jehovah's Witness. I've known him on and off for about a decade. Nowadays, we only email each other about thrice a year, but I still consider him one of my favorite online friends because of how deep and insightful our conversations are. We've rubbed each other the wrong way in the past because we have different ideas of God. I was raised as a Born Again Christian and am now looking into becoming a Unitarian Universalist.", "They’ve only kissed twice but I’ve read their texts and it seems like he definitely cares a lot about her, enough to share more with her about himself than he ever shared with me. Is it an emotional affair? He assured her he won’t cut off contact; is he in love with her? What do I next? **", "So I tried posting a similar post last week and had technical difficulties so here it goes. I think I’m going to do this chronologically— High school: I become close to someone who will become known as one of my best friends. Let’s call her Jessie. I want to pursue a friendship because Jessie is a strong independent woman mature beyond her years, has a sassy Latina attitude, and we have the same sense of humor.", "She seems to want to have longer conversations about her emotions every day. I'm trying to work on my studies. tldr: I'd really, really appreciate some advice. Please don't just comment \"break up with her\". Thanks.", "Sports teams, mostly, and some TV shows. He also enjoys a wide range of video games. The problem is that I really, truly don't have anything in common with him. I don't know shit about sports, I'm not really much of a TV-watcher and I'm not a huge gamer at all. I have some favorite shows but none of them are really that similar to those that Jack likes.", "Before I knew at least I stood out from the girls he followed, now I kinda feel like a shitty clone or something. I dont know. I dont have a type or follow eyecandy so I dont really understand. Help me make sense of it? Tl;dr: my bf changed his preference in women and now I feel like a shitty clone", "One night after going to a club we go back to our friends and we snuggle next to each other. She interlocks her fingers into my hand and later on in the night turns around and kisses me. We kiss for the whole night. We couldn't do anything more because our friends were sleeping in the same room. We didn't talk about that night until a few weeks later when we went to a bar together.", "Her parents didn't know about me at this point. I kept this bottled in for a long time, but exploded and was ready to break up with her over it but she said she would stop being in touch with him. She claims he has mental issues and had threatened numerous times to commit suicide. If I take her at her word, there was no sexual contact between them after we started dating. This contributed to me not trusting her.", "I went on a holiday with my best friend [26M] and husband [26M]. My husband and I have been together for ten years (married for six). My best friend and I have known each other for three years, and spend a huge amount of time chatting with each other on the internet. I love him to death, and he makes me insanely happy. My friend lives decently far away, so we don't see each other often.", "I might be homeless soon, I have about 500 dollars in my bank account and I NEED to get out of Massachusetts. I am going to be a college drop-out in my 3rd year due to family reason instead of academics. After a lot of research, I am contemplating between Wichita, Kansas and Columbus, Ohio. I really just want a minimum wage job where I can have a bed and private bathroom. Afterward I can get my life together and start taking programming jobs again.", "I'm using a throwaway for obvious reasons, however I could ready use the advice of others right now as I don't know what to do. I met this wonderful girl in November, and everything was going great, she was special enough that I let her meet my friends and family, and I met her siblings and mother as well. She had told me that she had this friend [M21] that she met online. They have never met in person, but she said it was all strictly friendship and nothing else. She mentioned how she helped him get through suicide and that he was a really good person.", "He keeps saying he hates himself for this and won't let it happen again. I know he has a really big heart, so I don't know what to do. Is our relationship worth it? TL;DR My boyfriend of over two years has a huge drug problems and continuously lies to my face about it. He abuses them and it is effecting our relationship in a negative way.", "I'm going to keep this story short. I'm (16M) openly gay, he (16M) isn't. We've been friends and somewhat more for 5 months. He hates affection and being touched, but he constantly flirts with me, touches me, wants me to massage his \"sore\" back, wants me to sleep beside him, he cuddles me in his \"sleep\"(which he has now revealed to be a fake slumber), and he always asks me about being gay and he truly is trying to understand it. Even if anything really happened between us, I wouldn't be getting a fulfilling relationship.", "I think he doesn't want to put in the effort for the relationship to work (and we're both so difficult that we have to work on our relationships, doesn't matter with whom) but he can't be without me either. What should I do? I'm afraid this is gonna happen over and over again, because I'm always forgiving him at some point. Am I being strung along? TL;DR: Boyfriend [28,M] broke up with me [23,F] after on-off for 1.5 years, I thought we just got it together and am devastated...don't know what to do, want to keep fighting but should I?", "I am lazy, this I can attest to. She brings up the Christmas tree, and how we haven't taken it down yet. I just stand in silence from her barrage, then take a bite of my sandwich. I start to take off ornaments and lay them aside.   She starts to rummage around and escalate and point out things that we haven't done, getting progressively louder.", "I've been homeless for a couple days since my roommate completely screwed me by not paying rent for 5 months and hid notices from me. I only had a week to move out, and get things into storage. I was able to find a roof to sleep under for a short time but it's severely roach infested and I have to sleep on the floor. There isn't anything availible at my price range, certainly not on that short of a notice. I had a few prospects but they went to other people.", "Next morn I did a lot thinking about God and praying and thanking him for blessing me with such a thing called Planet Fitness. And Subway. Made my way back to my part of town and chilled out till daylight. Fin. (Sorry for getting rushy I’ve currently been walking for 8 hours and I gotta get moving again soon so I don’t decide to make a place to sleep.", "Kick a man while he's down you sick sick fuck. I'm just trying to get advice and you delete part of my post. FUCK YOU. BURN IN HELL. People like you are why I hate this world.", "And we end up spending an indefinitely long period of time together that just never seems like it will end. I would really like to be able to hang out with her, like cook dinner, or go to a bar, or watch a movie, for example, and then just both go back to our individual homes and do our own thing. But, that seems impossible. I guess I’m really if it is necessary to constantly, physically, be with a S/O for a healthy relatioship to flourish? Am I being unreasonable/ inconsiderate in my desire to be alone?", "I can't get away and sometimes I fear my youngest sibling will suffer for it! I know my mother will force me to never see them again if I make this decision, or even HOW can I make this decision? My only option at this point I feel is to be homeless but that's another can of worms. My thoughts are scattered and I'm honestly scared. I don't know what to do anymore.", "I receive SSI/SSDI. About $1,000/mo. I have a gym membership at 24 Hour Fitness for taking showers whenever I want. I have a membership at REI for buying camping gear and clothes suited to the outdoors. I live pretty comfortably, all things considered, and have figured out a system of outdoor living that both keeps me alive and sane.", "Hey everyone. I need a place to vent and place my feelings because I don't know what to do anymore. This evening while playing a boardgame with my BF and some friends, I found out my BF lied big time. Short: last year we decided that I would join him this year on his skiing trip with his friends (his idea). This wasn't possible in the end (or so he told me) because his friends didn't want to rent a cabin but go on a cheap student skiing trip.", "We had plans to move in together, a fancy $1,800/month home that she would contribute $400 or so. We spoke of children, marriage, all sorts of stuff. It's not that I thought she owed me anything for me doing these things. It's just that I felt like I did so incredibly much and it kills me that I look back and know that over a 5 month period, we only had intimate contact less than 15 times, that we never made out, outside sex (and I initiated and was rejected many, many times). Every time I brought up my frustrations regarding my unmet romantic needs, she took it as gaslighting and used it as fuel to further drive the reason why she wasn't comfortable with intimate contact.", "I want to note that I told my husband that if he came to me and told me for his sanity he needed to leave, I'd do it even if it was dumb for us monetarily. Nothing is worth him being tortured and putting pressure on our marriage. I think the reason we get by is because sometimes we can get away with once a day torture from my mother, she also helps us a lot (especially me) and some days are ok. He just feels harassed and I understand this more than anyone because I feel the same way. .", "EDIT: I should also mention that when I do fall asleep, I snore REALLY loudly and I can hear myself in my sleep. My boyfriend says that it sounds like I'm not breathing or trying to breathe.   ---   **tl;dr**: I can't stay awake during tv/movies! Don't want it to drive a wedge between my boyfriend and I.", "I typically would not care in the slightest about things like that but I feel as if since my good friends basically turned their backs on me that I am at a loss? If my good friends did before does that mean everyone else will too? **TLDR: GF and I broke up. She is trying to turn people against me. What can I do?", "In prison, I was housed with two other person, we already had planned to take over the leadership of the gang that had control of our wing. We were making weapon, I got into a fight with one of the guy. I knew I was getting out soon, but I couldn't tell people, so I acted as if I was there  until my court date. I was the guy who kept watch for the guard while my cellmate created a weapon out of his bed sheet ( strangulation ). I had won protection from them by giving them drugs.", "I felt horrible for her. Ever since, I’ve been close friends with Corrine. She told me a lot about what happened with her family, and we had a lot of late night conversations where she told me about how she had these nightmares of what might’ve happened, how she had bits of her brother’s brain on her shoes afterwards, how she tracked blood through the house while she went to get the phone to call 911. I felt so awful. We were close, but I knew her past was traumatic and rarely pried.", "Good goals - She finished undergrad and already wants to go back to school. I value girls who want to get a good education or pursue entrepreneurship. Doesn't ask me for much - Given my financial situation, she hasn't asked me to do something that was out of my budget. Since I'm not really feeling her, should I let her go? I'm asking this because most of the girls I've met aren't like her.", "My bond about was about 100 less than my whole savings. First place I went after getting out of jail was my work, my boss told me if I had got out 2 days earlier I would still have my job. I'm about to do something stupid out of frustration and anger. I was so close to getting off the streets. Fuckkk", "She told me she was excited, I was just more enthusiastic about it. I let it go, and we went out with friends for new years. I still felt this distance. New years morning we woke up, I rolled over and told her that I wanted 2018 to be the year we really focus on us, that I was excited to keep working on getting us to a good place. She didn't seem to care.", "I listen to him when he’s having a bad day and thinking about what I did to him. I listen and try to say silent when he yells and screams at me. I take his insults in stride, as best as I can, because I feel like I deserve it. He tells me that he “has no respect for me” and I am “nothing but a mistake” and he tells me that I am trash, I do not deserve anything that I have, and that I am just a waste of his time. He tells me that he hates me.", "A lot of very helpful things can be found here, whether it’s how to get benefits and meals, to finding shelter. What I am concerned about is putting together something for the newly homeless in regards to scams, cons, users, people to avoid. Basic homeless etiquette, unwritten rules. Some of these people will have no “street smarts” or some will have very limited experiences with these situations. Most will be terrified, and could end up trusting the wrong people by not seeing signs that more “street wise” folks might have.", "I've been trying to act like nothing happened but I can't stop thinking about all this. I feel weird that i'm even thinking about it so much. I should just brush it off. Everyone keeps telling me I should go for it. Even my guy friends, which I assumed would agree with me feeling gross about all this.", "So let’s say I like person b [16F] and recently went on a date with her. Person b [16F] tells me that my best friend is telling his girlfriend (who is person b’s best friend) everything that me, person c[16M] (our best friend as well), and other boyfriend discuss as a group of really tight friends. And I mean everything. Person b doesn’t want me to say anything, but should I confront other boyfriend, tell friend c, or just shrug it off? **TL;DR** Us three guys have been friends for three years now and met these girls about 6 months ago; what should I do?", "So I don't believe she's telling me the real reason shes pressuring me to have another baby I am going to leave it here, please ask, I made a fake account so I can be honest as possible. Here are my primary concerns though 1) The day care incident with money. I feel like I cant trust her with finances.", "I wanna break down my situation. I know you guys can't help but I need to vent. My partner works in a job he is treated like crap in and hates for little money. He is looking for new work. That's good and I'm proud of him.", "She wants to live off these 400.00 and cut back on everything there is, even her own only connection back to her family if needed. My plan was, to get back to our parents for a while, until we both earn a bit better or find a cheaper place. But unfortunately, for her this is no option. She is afraid she can't go home, as she already once switched jobs and is afraid her mother won't accept her at home again. She blocks every attempt of mine to bring up the possibility of going back.", "Can’t wait to reach that phase. I stopped by a small seafood restaurant along the way, to sit and charge my phone and consult reddit. One of the men who worked at this place asked me where were I was from. He was a person who worked for this place for eighteen years, with a golden grill on his teeth. I told him that I started in Brunswick and ended up here and that’s all that mattered.", "She humiliates me in front of other people and when we're alone. I'm always just a servant who's there to get her drinks and hype her up. I'm always just the butt of her jokes. She used to invite me over when she was hanging out with a guy she was trying to hook up with, just so she could make fun of me in front of him the whole time to make herself look better and/or cooler. I'm just a prop.", "I'm hoping that I can get some of the community to share into the database to make it as useful as possible. Does this sound like something that would be used? Would you, if you were homeless, use it? I've volunteered in homeless shelters and have had friends who have found themselves homeless, but I'm not sure how/if many actually have smartphones with app capabilities. What are your thoughts?", "I've put him up in a motel for a few days, bought him a bike, and gave him some money, but I know I can't afford to have him stay at a motel forever (or even support him like that! ), the money will run out, and I just feel sick/stressed/sad because I don't even know what to do at this point or how to help anymore than what I've already done. I work full time and have to suppport myself and I live at home with my mother and she wants absolutely nothing to do with him. He needs help and I just don't what else I can do. Any advice or resources would be much appreciated!", "This is where she met her current best friend. Let's call him Rob. Now, she met this guy while she was still dating her ex. They had issues after a couple of years (more than 2), apparently that was the time she and her best friend started to get really close. In her own words, they started texting a lot, going out with their colleagues a lot, etc.", "PS: I can't get fired because one she is in another department which doesn't break policy and I am in good working and personal relations with my direct boss and the one above him.   ---   **tl;dr**: Started having sex with a co-worker 8 months ago. Found out today that she is married and that some of our sexual partners were also married. What should I do?", "Be ready to contribute (reasonably). B - Calmly, with neutral to negative vocabulary and intonation express dissatisfaction with certain behavior, action or outcome of action and politely ask not to repeat same behavior/action/make sure particular outcome doesn’t repeat again. Make sure message was audible and comprehended and if necessary still calmly repeat again Be ready for calm reasonable discussion in case of decline. C - Harsh, sudden, loud expression of dissatisfaction.", "I was just going to bail the next morning and not come back but I called the cops to come get me that night that how unsafe I felt. I feared for my life. Please people I need to get a job and some type of place to stay. In Florida. Shelters do more harm than good", "Hi! This is my first time posting on reddit, and I was just looking for some advice. So to give some background... I live in a block of flats (in Coventry), and we have a communal area with a bin shed and our personal sheds. I was taking my rubbish out this morning, with my dog, and he was really interested in my shed, do I opened it for him to sniff (it was broken into earlier in the year, and the lock has been broken since).", "That was nice. But now that we're close to the point of no return, with a flight booked so he can come see her(I agreed to travel out of our house for the week), and they seem to be bonding big time(I love you's abound), I'm not sure what to do with myself. On one hand I want to let loose and detach, let her have fun, and do so myself. If it leads to a new LTR for her, awesome. But what kills me I guess is the uncertainty.", "My wife (we've been together 8 years) however is determined to 'finish the job'. Her father taught her much of what she knows and that is certainly a factor as to why she is an constructual engineer... But unlike her father she isn't a certified electrician or plumber nor is she especially skilled at carpentry. The issue is that we live 5 hours away and even if we did go *every* weekend to work on the house it would take well over a year to even get it into a acceptable state, let alone 'finished' and sellable. I brought up the idea of getting contractors to finish the house.", "I got 6 stitches. My parents love my bf and in fact, my mom and him are so close that they go on walks and go to the movies together. I felt uncomfortable and unwanted by his family. To be fair, I was also a little closed off with them but mainly because I felt so unwanted. I have put on some weight, which I am sure his dad noticed because he absolutely hates fat people.", "She’s so sweet and gentle such that a complete stranger can reach into her mouth and take food away and she won’t even react. But she sometimes tries to grab food off the table if people aren’t around. MIL has been with us for several months now and tells us she loves spending time with the baby. She has her own room. I cook all the meals and my wife does most of the laundry.", "He apologizes if I point it out later, but the first instinct is always to blame me. And often the thing he's blaming me for is exaggerated, and made to look like a routine flaw in me, even if it's a once off thing. He doesn't hesitate to show his bad mood/displeasure (which applies to how he is around most people not just me, but I think it's worse when it's about me). He doesn't hide it at all even if we're around other people, so I have to be particularly cautious not to piss him off or bring up anything that could upset him in public. When he's upset/displeased in private, he withdraws and it's up to me to grovel and convince him to talk to me again.", "Anxiety my \\*\\*\\*, that \\*\\*\\*\\* gave ME anxiety, being surrounded like that. * &#x200B; Skipping to college, at this point I really didn't care about anything anymore, and it didn't help that I met a girl who completely split me and my friend apart (that's a long story in of itself), and started skipping a lot of my classes. I had good grades in my computer programming class, because I was actually curious for a while, but that was about it.", "I'm not sure why I'm making this post, really. I guess I'm afraid. Is houston \"safe\" to be homeless in, compared to other cities? I'm 5'10\" and about 150 lbs, so I don't think anyone would mess with me, but...I have seen some of the homeless people here and I really hope I don't offend anyone, but they look crazy :/ I'm sure it's very rough for men, also, but being a 22 year old homeless woman is a terrifying thought. where do I sleep?", "I'm volunteering at a local food bank and a large number of our clients are probably homeless. We have some social workers who try to help them get housing and have had some success. But until then, I'm considering stocking a stash of supplies at the food bank that aren't food, but could be particularly useful for people before they can get into housing. The idea isn't to provide kits instead of housing, but to stock items that might be occasionally useful. Most people are resourceful and provide for themselves, but occasionally may be short an item or two that could make a significant difference if it were immediately available.", "Am I being way overdramatic? Hope I provided enough information. I truly tried not to sound angry or overly upset.   ---   **tl;dr**: My mother has hit me quite a few times, put my clothes in trash bags when I don't clean them on time, won't let me lock my door, and has threatened to take away the car I drive that they paid for (and therefore job and access to classes).", "A few weeks ago I found some notes of hers open at our computer. She had written questions to ask for a psychic reading or some such(she's into that stuff). One of them was, \"is this guy worth pursuing?\" \"This guy\" refers to an online friend from out of state she had been having extensive conversations with, which we had talked about not long before, and of course she labeled him as \"just a friend\", albeit him growing more and more fascinated with her. I offered an open relationship, partly because I had entertained the idea before, but mostly to de-escalate what could be a relationship ending event.", "I don't know why, because it didn't bother me before I actually saw it on a screen, but I am absolutely crushed. I've asked him to hide it from me from now on and expressed how hurt it was, but I went to use his gaming system a couple of days ago and saw he was still looking it up regularly (I guess he thought I wouldn't use it - I had gone to look up something and all the searches popped up in the Bing bar). I never felt attractive to him and I know that's my own fault and insecurity and not his problem to fix. I know rationally that men like variety. But I haven't sent him nudes in probably two months now.", " But 19 and 39? to me I feel like that is someone older than my current age dating an age that seems like a child to me....  I creeped her facebook and she appears to be a \" normal\" 23 year old...going out partying...saying things I would have found funny at that age but cringe at now.....and he did share with me that he supported her for the most part and so on...I asked if she had any \" life skills\" and his answer was \"  not really\".  What are people's thoughts on this?   ---", "My Father has been struggling with alcoholism for nearly his entire life, he hasn’t been in contact with myself, my mom, or my sister in years. I guess it all of sudden caught up with him, he past away from a heart attack recently. It still doesn’t feel real, but my girlfriends family has been nothing but supportive throughout the whole thing and helped me grieve through his death. Needless to say, I do not want to attend a funeral or memorial, because I’d like to remember the good times I had with him and not being up bad memories. I had a rough child hood, he cheated on my mother, he wasn’t a great guy.", "For many years I visited her and asked if she please could do things to mitigate my allergies (keeping the cat out of ONE room-where I slept, not give me clothes to wear that the cat had laid on, vaccuuming) and she did not do anything. \"The cat almost never wants to be in that room\" I got as a reply, but he was free to roam everywhere. A few years ago I just stopped going to their home and after taking that control I have felt much less sad about this.  - Since she got together with her new partner I wanted us to go on a short trip (weekend) staying somewhere over night with her. This has happened only one time, more than ten years after she met her partner.", "There is a time difference and he's busy! don't worry about it winteryokohama\" but there is also crazy brain that is thinking, \"This is him trying to never talk to me again and end things.\" I am driving myself crazy and I'm sick of it. I am NOT spamming him with texts, i am giving him space, and trying to let him enjoy his trip! What are your thoughts reddit?", "I bought a few dozen of them. Tomorrow I'll try and stop by the dollar store for some extra things. I'm going to my city's downtown area right after I go to the store. Thank you to the kind person who gave me gold. **", "For some reason the niece decided to call us and basically tattle on the ex for how she was living drugs etc..... we kinda already know her situation. We have custody so it's not a huge deal. Well, he invited the niece we will call her Carla  and her bf to our home for a bbq.  Well, they never left, I don't even understand how it happened but it did . Well,  after major issues with the bf we finally were able to get rid of him.", "We are 100% no contact, and have decided we won't talk to each other for at least a few months, or until we're ready to talk and maybe try to be friends. He says he still cares deeply for me and loves me, but this is for the best. I wish it was easier to get over, but it isn't. What advice do y'all have? Thanks!", "He suddenly wanted to have a relationship with her, which I saw as a good thing. I said he could come over to visit as often as he wanted, he just needs to tell me before hand so I can be home. We decided to give our relationship another shot and I got pregnant again immediately. We moved into a house together, I had really horrible morning sickness this time and Bob got disgusted with my neediness and moved out again a week later, leaving me in a huge house I can't afford or maintain, again far away from any form of support necessary for a pregnant mother of a young kid. He seems to love his kid very much but has no concept of taking responsibility.", "Do you think she's just trying to let me down easy or that there might be something but she's just not ready? Everybody I work with says she likes me. Her close friend from work even said something similar. I'm probably over thinking this, as I tend to do. What do yall think?", "I have been living in <location> at a homeless shelter run by the Salvation Army since the beginning of February (I know it hasn't been that long but still), and I started a new job a month or so later around the beginning of March. I don't know if my boss did a google search of the address I have on record or maybe drove past it one day, but I overheard him talking to another one of the staff about how 'the homeless population here in Toronto is getting pretty bad, and how there might be a lot once the weather improves because of the people trying to leave the USA because of Trump' And since I heard this conversation, I went from having 3 shifts of 4 hours per week (12 hours per week), down to this week I have 1 shift that's only 3 hours, and he's blaming how our sales are really slow, which they are down by an average of 4% compared to last year according to the reports that are printed automatically each day. It also doesn't help that since I started a month ago, we had 11 employees and as of this morning we now have 16. Tell me why the hell if business is so slow, why did we increase the number of staff by almost 50%?", "I feel like I can be that person for my girlfriend since I love her but I don't think I want to sacrifice my happiness for that. I just want to have a simple life and find someone who will have time for me. I didn't grow up in a loving family like her. It's not always about money. I grew up comfortably but there is not much love in the family I grew up in so money isn't important to me.", "It is emotionally and physically taxing for us all to deal with these. I am worried that one day someone might snap and she may become injured. I don’t know what to do anymore. **tldr: younger sister has horrible rage fits all the time and I’m worried about our family** edit: should have specified that we have had her since she was 1 day old", "Hi everyone, I'm not sure if this goes here or under parenting. I met \"Bob\" in a big city, moved with him to his parents property to start a business/farm. He immediately went into 30,000 debt building an unnecessary smithy and had to get a job so we couldn't start the business after all. I bought a used car so I could get out sometimes and look for a job, he took the car to work (instead of his retired parent's car as planned) so I was stuck at home again. I got pregnant, we got married.", "When we returned a year ago, we had some very rough boundary issues (trying to forward face in their car, feeding baby junk, criticizing our parenting choices, etc.) with them. MIL has \"anxiety and depression\" and cannot address the issues she causes so FIL addresses them for her. It's the worst case of coddling I've ever seen. She does not see a mental health professional (because narcissist) and blames everyone else for any wrong she may do, which of course she does no wrong.", "No reply. I texted again a couple hours later and he again didn't reply. I saved myself the embarrassment and just didnt go out that night. I texted him the next day to ask what happened. Its been a week already since this happened and be hasn't once texted me.", "The thought of leaving my folks behind would definitely not be good for me mentally. I've thought about basically living out of my car, gym memberships to shower daily and laundromats to wash my clothes. Perhaps put all my stuff in storage and just keep working and save some money up. I live on long Island btw. Rent isn't cheap.", "I moved out of our family home and in with my boyfriend nearly 2 years ago. Since then we’d speak a bit over text, mainly for each others birthdays. Last time we spoke via text was about three months ago. I asked Eva if she wanted tickets to a concert for a band that we both really like and had seen in concert together before. She said yeah, but was less than enthusiastic when I gave her the ticket a week later when I went to visit.", "I don't \"feel\" in this anymore, but I honestly can't tell if I just can't let bygones be bygones or if I'm looking at this objectively. If I do break it off, it's going to crush her personally AND add the awkwardness of her telling her friends and family its off. So I don't want to do it unless it's you know, really what's needed. And if I do leave, how do I mitigate someone who has threatened suicide at the action of me leaving? **edit**: Thanks everyone.", "Which admittedly, I have been catching some feelings for her. But I want this to continue since I enjoy her company and we vibe well together.   ---   **tl;dr**: I met this cool girl that I might have feelings for but she told me she has no current intention to date, so we're really just FWB that hangout. For somebody who has never done anything casual and have only had relationships or talked to girl to eventually date them, how do I become comfortable having sex and hanging out with somebody without catching feelings for them?", "But even after that he still says things that makes me feel uncomfortable. For example, when I suggest we do something or go somewhere that could be somewhat unique/interesting (e.g., watching a documentary about sex workers in their 60s, or going to a church in Vienna to listen to the choir boys sing), his first reaction via text is \"wtf?\" I instantly feel bad and angry because he is saying wtf to my plans and interests. When I confront him about it, he says he \"wasn't saying it to me.\" His excuse is that he was saying wtf about [insert whatever the subject matter was]."], "label": ["no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress", "no stress", "has stress"]}