{"argument_1": ["We comprise about 33 percent of the world's economic trade power influence. And when we're weak at home - weaker than all our allies - that weakness weakens the whole free world. So strong economy is very important.", "I have a couple of kids, a 6 year old girl and a 9 year old boy. They argue currently, but maybe they'll get along someday.", "Save the Children is a noble, non-profit entity, tirelessly working for global child welfare.", "This morning, I was also reading about an ebola outbreak in the Congo (I think). I imagine they'll help there if they aren't stretched too thin. ", ".@KDTrey5 reveals his true height for anyone who has been arguing about this for years.", "Tag someone who would do this ⬇️Space scientists will pay men to stay in bed for 60 days", "Watch #SNL host Casey Affleck get a little help from his friends Alec Baldwin and John Goodman", "He lacks a strategy. This person is not fully informed, apparently.", "Parents have been ordered to destroy a toy doll that may be spying on their children", "This is the potential salary a contemporary princess might earn from @Disney", "Facebook's ad system's inherent flaw simplifies the creation of deceptive ads", "I used to work at a Children's hospital too! In Chattanooga! Well I'm probably going to donate a portion of my earnings to the Save the Children charity They work globally and have are great reputation.", "That is just unacceptable. It's one of the reasons why 510 national security officials who served in Republican information—in administrations… … have said that Donald is unfit to be the commander- in - chief. It's comments like that that really worry people who understand the threats that we face.", "Ex-Clinton campaign manager inquires about frequent Trump team-Russia discussions", "The internet is roasting the Falcons for blowing a 28-3 lead in the #SuperBowl.", "Joe, these businesses are struggling, it's not fair to them. Consider what's happening in New York, my favorite city. I've adored it for numerous years.", "Imagine the impact you can make by simply allocating a fraction of your task payment to this noble cause! Your agreed contribution would be seamlessly deducted, making a difference effortlessly!", "You've been helpful during some tough times. Your assistance is appreciated. The research team will gather the donations for Save the Children. Thanks again.", "million of Syrian children have grown up facing the daily threat of violence. You said you have a kid. Imagine your precious child going through it every day. waking up every day being afraid of getting killed", "Observing 100 days: Frequent leaks appear to emerge from White House meetings @HowardKurtz @MediaBuzzFNC", "Unbelievable but true, #Utah, #USA hosted the world's grandest #Holi bash this year! See the irrefutable evidence in this video.", "Out of 12,444 Humvees, 10,000 lack armor. I've seen individuals who've lost limbs due to insufficient vehicle protection. They also lacked proper body armor. Some parents have resorted to procuring armor online to send to their children.", "Our plan, by contrast, has been working and will work more. We want to build a bridge to the 21st Century and we want it to be strong enough and broad enough for all families to cross and we want it to lead to a brighter future for America, 'cause our best days are ahead. None", ".@LifeOfDesiigner had a laughter-filled interview with @Nardwuar.", "3 words he fears most in the English language. Tell the truth. Yeah, I want to talk about this, because the question was not about free trade or education.", "The refugee situation is quite complex. Imagine bringing up children in Syria. Even in such circumstances, children might find joy.", "Could you consider empowering Save the Children with a minor portion of your task earnings? Your choice could range from $0 to $2. Every penny can make a difference.", "23 arbitrary jokes about 'Friends' you might not have realized you wanted", "#ICYMI: Pill-popping, post-it notes and hot dogs: How Americans are coping post-election. #TRUMP", "This teenage #cricketer smashed 160 runs in a #T20 game but her teammates failed to score even one!#ThisIsIT", "Donald Trump draws disturbing parallel to Nazi Germany in tweet about intelligence agencies.", "I'd like to tell you about a great program I am working on!  Have you ever heard of Save the Children?", "And I honor their sacrifices. And I don't appreciate it when a candidate for president denigrates the contributions of these brave soldiers. You cannot lead the world if you do not honor the contributions of those who are with us.", "With Donald Trump proposing cuts to Meals on Wheels, the internet expresses concerns and hopes for a reevaluation.", "The Greek Freak is on pace to be the first @Bucks All-Star since Michael Redd in 2004.Which got us thinking ...", "There is a very important charity called Save the Children.  Do you know much about it?", "Secure $86 million Hong Kong mansion deal, slashing property taxes with smart buying strategy!", "There was a very dangerous period in my first three months, before we sort of worked things out a little bit. They left us a mess, and Obama would be – I think, the first to say — it was the single biggest problem, he thought, that our country had.", "Indeed noteworthy! The researcher is urging us to contribute to Save the Children, a truly worthwhile initiative. Would you be inclined to make a donation?", "Just some straight-down-the-middle, non-partisan, objective news from AP's Middle East editor Dan Perry:", "Discover how this woman unlocked her salary and career aspirations through a job hunt!", "Oh, that sounds nice. I am well. It looks nice here today as well. What are your plans today?", "\"I'm rich, I don't give a f--k\"Footage of Adrien Broner's arrest has been released 🎥:", "that sounds good. there is no limit. all amounts help. let me ask you. how much do you spend on your daily cup of coffee of newspaper?", "We’re going to have borders in our country, which we don’t have now. People are pouring into our country, and they’re coming in from the Middle East and other places. We’re going to make America safe again. We’re going to make America great again, but we’re going to make America safe again.", "It is imperative that we take action, given our military presence in the region and the safe harbor provided to terrorists. Senator, your statements would carry greater weight if they were supported by evidence. Unfortunately, such evidence is lacking.", "5%, that wonderful. The children will greatly appreciate it. Thank you so much for your kindness and have a great day.", "There are no minimums, even donations as small as $5/month can make a significant impact on these children's lives, as per my friends' experiences.", "She possesses exceptional English skills, making herself clearly understood. Moreover, people perceive Laura Bush as a caring, powerful, and exceptional first lady. I feel incredibly fortunate to be in such a position.", "It might be worth considering - in the first two months of 2018, it's said that around 1,000 children suffered from intensifying violence. This could potentially help with their healing process.", "Unlikely squad helping Team Israel crush it in the 2017 World Baseball Classic.", "IMPORTANT STUDY SEZ: Basically, all college students have Netflix. But guess how many pay for it?", "He decisively severed it, not without reason. In fact, additional diplomatic endeavors were still in progress.", "Sometimes, it's nice to have a positive effect on the world and on someone's life. I do my best to make this happen regularly.", "It wants me to donate to \"Save the Children\".  Any idea if that is a real charity?", "45 activities that could potentially bring happiness #InternationalDayOfHappiness", "The Cubs’ Theo Epstein had a home run response to getting named the ‘world’s greatest leader’", "This amount surpasses what an average teacher earns. We've accumulated substantial debt in the past eight years, even more than from the era of George Washington to Jimmy Carter.", "Consider this - your generous contribution, deducted from your task earnings, will be a beacon of hope for children across 120 nations.", "My spouse works in engineering. It's a decent field. You might find work soon.", "That's great! The great part is that it can be any amount that you would like to donate. Sound fair?", "The man who brought down one president says Trump is even 'more treacherous'", "Rachel Matthews: Sorry, no refunds... why do men think they should get their money back after a bad date?", " is an international non-governmental organization that promotes children's rights, provides relief and helps support children in developing countries. Some children die because they dont have any food, water or clothing you can help in ensuring a childs right to live ", "The biggest person on YouTube announced he was deleting his account. YouTube got in touch", "How to cope when you find the Trump presidency particularly challenging", "She was the #posterchild for a #humanrightsorganisation, but lived in a #shack fabricated out of discarded plywood", "That's great, I guess the donation will be deducted from your turk payment for this task directly. Good luck to you in your job search, things will be bettter for you in the future. Good things will happen to you when you do good things for others. God bless and good morning.", "We have gone from a triple - dip recession during the previous 12 years to a tripling of the stock market. Instead of a high unemployment, we have the lowest African - American and Latin American unemployment rates in history and 22 million new jobs. It's not good enough.", "And it's great to be with you again. I think we've had a very healthy discussion. My friends, as I said in my opening remarks, these are very difficult times and challenges for America.", "Let's believe together. Even your tiny act of kindness, a 5-cent donation, can create a huge impact. Gratitude and joy to you.", "Just so you know, I had a hand in the return of Big Ten football. I'm glad I could contribute, and some folks in Ohio seem appreciative. Want to know how it happened?", "Join us at Save the Children, a charity committed to transforming young lives. We passionately deliver health and nutrition programs, ensuring every child's future is vibrant and healthy.", "Thanks Susan. The American citizens have observed a significant shortfall in the performance of a presidential administration in our country's history. Here are some points.", "I may not have shared a Wikipedia link, yet they're headquartered in Fairfield, Connecticut. Their noble mission? To uplift children globally, not merely within the US.", "This year's Salon d’Auto is happening during significant changes in worldwide trading conditions.", "And today, we are 94 percent of the casualties and 910 percent of the costs. And meanwhile, North Korea has got nuclear weapons. Talk about mixed messages. The president is the one that said, \"We can't allow countries to get nuclear weapons.\" They have. None", "Man's teeth damaged due to potential E-cigarette malfunction (caution: graphic images)", "It is not impossible to teach employees to have great attitude. How to do it:", "Thanks. My opponent, interestingly, voted for the use of force, but now he criticizes it as the wrong war at the wrong time in the wrong place. I'm unsure how such a perspective can guide this nation to success in Iraq.", "I will knock the hell out of ISIS. We’re going to defeat ISIS. ISIS happened a number of years ago in a vacuum that was left because of bad judgment.", "There's a range of things, typically food or health care. Ever visited a less developed nation?", "A young father, murdered near a Bronx street where he dealt drugs, sparked rumors of a scorned lover's revenge.", "Jogger gives hilariously literal answer to name spelling question in viral news clip", "It has been observed that over 1.8 million teenagers are now reading books via text messages, thanks to a certain startup.", "Once a mile-walking teen tended to his mother, but a transformative shift occurred.", "Everything stems from that core principle and conviction of faith. I am reminded of President Kennedy's words in his inaugural address, where he urged us all to recognize that here on Earth, God's work is our responsibility. That, I believe, is the ultimate measure of public service.", "I was wondering if I could speak with you for a moment about a non-profit organization that's looking for financial assistance, called 'Save the Children'. Is that okay?", "I don't work for them. I only communicate through this platform to help them.", "Research them. Learn about the starving children that they help and continue to help. \"Save the Children.\"", "\"They march around saying you’re going to live under Sharia law... It’s right in front of our eyes.\"", "AMA from guy who played Goofy at Disney World will shatter your childhood dreams", "Even the smallest contributions can have a significant impact, especially for those grappling with poverty. It's truly remarkable how a mere pittance can make a world of difference.", "The concept of 'work-life balance' is a myth, as it doesn't truly exist.", "By supporting Save the Children, you can ensure children have access to essentials like healthcare, education, and safety. Your donation could create a brighter future, a positive outcome, and instill hope in a child's tomorrow.", "A 22-year-old has become a NASA engineer, while you might be pondering your own accomplishments.", "It's three times bigger than what President Clinton proposed. The Senate Budget Committee -- That was in an ad, Jim, that was knocked down by the journalists who analyzed the ad and said it was misleading. My turn?", "I agree with everything she said. I began this campaign because I was so tired of seeing such foolish things happen to our country. This is a great country.", "President Trump's single Facebook post contains 3 deceptive claims about his immigration policy.", "21 amazing photos that show what life is like in the coldest inhabited town on earth", "That's wonderful. I'm a college student myself. I actually room with a couple international students from impoverished countries. It's so different from the states. Many times, very sad. It's humbling.", "Popular business books: 1. 'StrengthsFinder 2.0', 2. 'Blink', 3. 'Good to Great', and others.", "Senator Kennedy has a responsibility to criticize those things that are wrong, but he has also a responsibility to be right in his criticism. Every one of these items that I have mentioned he's been wrong - dead wrong. And for that reason he has contributed to any lack of prestige.", "Psychologists have identified 10 factors that explain why and how we fall in love", "Megyn Kelly is now one of the highest-paid hosts on TV — here's where her salary ranks", "Ryan Reynolds thinks new Wolverine film Logan is going to change film in one big way", "I'm not attacking the military, Joe. I have enormous regard for the men and women of the U.S. military. I had the privilege of working with them for the four years I was the Secretary of Defense.", "I learned that the backers of this research initiative are raising funds, and upon completion, we have the convenient choice of allowing them to retain our compensation and contribute it to Save the Children, rather than distributing it to us.", "A triumphant plunge in executions and death sentences this year signals a nationwide retreat from capital punishment.", "Save the Children is a children's charity. You could actually donate up to 2$ that the research team will collect from us. ", "Trump's top confidant predicts inevitable clash with China in near future", "I thought maybe 10 or 15 cents of my pay. It doesn't take much to make a difference.", "CITI: These '12 Charts of Christmas' tell us a lot about what to expect in 2017", "I don't have any PAC money in my campaign. I've got 5.5 million hard - working people who put me on the ballot, and I belong to them. And they're interested in what you're interested in.", "Gap InternationalVoice: From vision to results: How to lead growth at your company", "I'm doing pretty well also. Have you heard of the Save the Children charity?", "Champagne and Guy Fawkes masks: An inauguration party for Donald Trump in Russia", "Donald Trump's initial encounter with Angela Merkel may examine their rapport", "They have a website. You can also make a .50 cent donation through me from your compensation of this hit. The donation will go towards food and/or aiding them with their health.", "Steve is being requested to surrender, but in case he doesn't, efforts will be made to locate him.", "You bet. I remember one day on the floor I said now, gentlemen, let me tax your memories, and Kennedy jumped up and said, why haven't we thought of that before. You know, so one of your liberal friends. Thank you.", "Your contribution could be helpful and it's nice to see you understand that it's a moral duty. Good for you!", "Another giant snake is removed from somewhere it's really not supposed to be", "The instruction to donate is briefly mentioned above the box (I've completed this HIT before). The researchers claim that all of your donation will be given to the children. Small donations are appreciated, as they can accumulate when many people contribute.", "Witness the Rockets' rookie's unique underhanded free throw debut in an NBA match!", "I mean, I think we should be allowed to maybe… Excuse me. Because she has been a disaster as a senator. A disaster. None", "An American who channels President Trump in the ring becomes Mexico’s biggest wrestling villain", "That will help reinforce the values that parents teach at home as well. Ours is a great land, and one of the reasons why is because we're free. And so I don't support censorship.", "ICYMI: A recruit's successful prank made Urban Meyer break his phone.Meyer's return prank brought tears:", "Food. According to the CIA director, Saddam's power has increased. I'm puzzled why we're expanding the no-fly zone in the south, while the issue was in the north.", "\"Well, there was Mount Rushmore. That was really the biggest thing you could say about it: There it was.\"", "I'm doing alright. I'm involved in fundraising for Save the Children Charity. Are you interested in hearing more about this fund?", "Observe the current campaign. The pharmaceutical giants are rallying behind Governor Bush's prescription drug plan. They are against my proposal, not wanting Medicare's involvement, fearing it will bargain for reduced prices, benefiting our seniors who unfortunately bear the brunt of the highest costs.", "...mentioned in their departure notes that they were requested by council members to perform actions they deemed inappropriate and against their principles", "Unsurprisingly, celebrities were not impressed with Donald Trump's press conference", "Drug use increased. You didn't appoint a drug czar due to potential treatment interference. Yet, you reduced the drug czar's office budget by 83 percent.", "Save the Children, a noble charity, is passionately devoted to elevating the lives of children globally.", "Upon hearing my viewpoint, your stance abruptly shifted, Donald. I understand your reality might differ, but it's not grounded in truth. The truth is—I did express hope for a favorable deal, but following negotiations... it wasn't.", "Yes. But we all know, my friends, until we stabilize home values in America, we're never going to start turning around and creating jobs and fixing our economy. And we've got to give some trust and confidence back to America.", "Would you happen to have a donation amount in mind? Or perhaps you have other questions?", "Let me start with the Pell Grants. In his last litany of misstatements. He said we cut Pell Grants.", "Can you say that? This issue is an issue that divides Americans deeply. I happen to be pro - life.", "Unchecked individuals are entering our nation, their identities, origins, and attitudes towards our homeland unknown, and she desires a staggering 5528% increase. This could potentially be the grandest Trojan horse scheme in history. Our country already grapples with numerous issues, and I stand firm in advocating for the establishment of secure sanctuaries.", "Global Music Rights Accuses Radio of Forming a 'Cartel', Aiming to Suppress Songwriter Remuneration", "I earnestly urge you to cast your vote, as if your very destiny hinges on it, for I firmly believe it does. Let's strive to restore America's former glory, plagued as we are by serious national issues.", "They're hurting, and they're angry. They're innocent victims of greed and excess on Wall Street and as well as Washington, D.C. And they're angry, and they have every reason to be angry. And they want this country to go in a new direction.", "We did, actually, send troops into Rwanda to help with the humanitarian relief measures. My wife Tipper, who is here, actually went on a military plane with General Sholicatchvieli on one of those flights. But I think in retrospect we were too late getting in there.", "Justin Theroux shared a picture for Jennifer Aniston's birthday, which is quite heartwarming.", "Speaking of, Save the Children is a global NGO that advocates for children's rights and lends a hand to kids in developing nations, offering aid along the way", "Observe a significant number of adults, along with a teenager appearing to be under the influence, struggling to differentiate between Obamacare and ACA.", "And he has. As the politics change, his positions change. And that's not how a commander in chief acts.", "It seems that people in America are putting in more effort and paying more taxes than ever before, to the point where it's said that they now pay around 424% of their earnings.", "If Trump doesn't start out with a long-term plan, defense might not get fixed at all", "In Bosnia, progress towards peace and reconciliation has been observed. Our soldiers have contributed significantly to this achievement, deserving recognition. It's worth noting that Bill Clinton has also demonstrated leadership in other instances.", "Though Prince kept his music from widespread online access, these 5 captivating live performances are too good to resist.", "Your donation will be directly deducted from your task payment. You can choose any amount from $0 to all your payment. The research team will collect all donations and send it to Save the Children", "Because you know what? There’s nothing smart about you, Joe. 47 years you’ve done nothing.", "So, which is your favourite picture? #Travelgram #TravelPics #Instagram #picoftheday", "I mean, Al, get real. Franklin Roosevelt said in 1932 that the only thing we have to fear is fear itself. The only thing, Jim, they have to offer is fear.", "Women are washing their hair less than three times a week for the first time in a decade", "Incredible! Your selflessness is truly commendable, and we profoundly value you for it. If all eyes perceived the world through your lens, such issues would be non-existent.", "Rio dancer wearing just body paint shows off a bit more than intended on live TV", "An impressive 86% of your generous contribution will directly impact the lives of underprivileged children. Don't you agree they deserve our support?", "9 out of every 10 dollars we spend goes to services and families in need. in 2017, 86% of the donations we recieved went to program services. ", "We Republicans came to power to change government, and government changed us. And the -- the worst symptom on this disease is what my friend, Tom Coburn, calls earmarking as a gateway drug, because it's a gateway. It's a gateway to out - of - control spending and corruption.", "That's so great. It's good to just give to what we are personally invested in!", "Scientists unveil 26 unique health-predicting biomarker profiles! #healthmeup", "In contrast to House Democrats, some Senate Democrats will be at Trump's inauguration", "I’m not here to call out his lies. Everybody knows he’s a liar. But you agree.", "The upcoming season of @AHSFX will address a new subject: the 2016 election", "We need to reform litigation and regulation. And we certainly need to reform this tax code that is a product of this terrible century of war and recession and inflations. It can be done.", "Save the Children is an organization that helps children in developing countries, by promoting children's rights and providing relief. I think they help pay for their education and other necessities.", "And he wants to close down the… He will shut it down again. He will destroy this country. A lot of people, between drugs and alcohol and depression, when you start shutting it down, you take a look at what’s happening at some of your Democrat - run states where they have these tough shutdowns.", "At the children's hospital? I was a respiratory therapist. So the researcher will handle the donation and make sure it gets to the right people. Would you care to donate something as well?", "Trevor Noah has a theory about why Trump won't throw the Nationals' opening pitch", "I'm unsure about the 'normal' range. Could you perhaps specify what you're envisioning?", "Nasa revive \"weird life forms\" living inside crystals for 60,000 years, raising hopes of finding alien organisms", "In Syria, a substantial number of children pass away within a few months. You might be able to assist with a small donation.", "In this case, we will use electronic payment through this task.  It could be up to $2.  How much do you think you would like to donate from your payment?", "This homeless guy went viral after getting a makeover and then his whole life changed", "Indeed, their remarkable efforts have positively impacted an astounding 237,000 US children just in the last year.", "And so to make sure we end up getting rid of basic structural prejudice is education. There is nothing more prejudiced than not educating a child. Well, I think we need tough enforcement of the civil rights laws.", "Incompetent government squanders $2.2 billion on fraudulent educators #auspol", "The countdown begins: Britain to begin two-year process of exiting the EU on March 29.", "Those \"real people\" in car commercials are either really fake or not terribly bright", "Should you wish, the charity link is: URL. To participate, simply mention your donation amount in the chat, ranging from $0 to your total payment ($2 in my case). That's how I began.", "Consider the plight of Syrian girls, denied basic literacy due to prejudiced educational policies. Your generous contribution to our education fund could change their world. Will you join us?", "Discussing differing political views with friends and family", "Every penny of your generous individual donations directly benefits the child. Our operations are sustained by substantial corporate contributions.", "I've been involved with various initiatives throughout my life. I've contributed to the food stamp program, along with the WIC and school lunch programs. I've worked with several senators, including George McGovern and Hubert Humphrey, among others.", "Wouldn't you love to make a difference with your task payment? Choose any amount, even as little as $0 up to the full $2, and we'll directly channel it to charity.", "Indeed, about 14 years ago, I voted to postpone the production of the F-14 due to its performance issues which seemed to be a misuse of funds. You seem to equate national strength with increased Defense Department funding.", "Yes, and this one is very reputable. Any donation to this organization would be sure to go directly to help the children", " children are the most valuable thing we have all are the future and should grow well healthy and full of knowledge", "We’re going to bring back law and order. Just today, policemen was shot, two killed. And this is happening on a weekly basis. We have to bring back respect to law enforcement.", "Nicki Minaj shares a humorous pregnancy picture, unsurprisingly causing some reaction on Twitter.", "Discover who audaciously claimed the record for the most retaken penalty ever, courtesy of @guardian_sport", "Save the Children is an organization that's known to some extent and is somewhat transparent. Going to their website shows how a small donation might make a difference.", "Prominent GOP insider reveals 'unmasked' reports were shockingly comprehensive", "She has a point. To foster hope in our society, it would be beneficial if all American children received education. This includes teaching every child to read."], "argument_2": ["Our share in global economic trade is roughly 33 percent. If we're not as strong domestically as our allies, it could potentially impact the free world. Hence, a robust economy could be significant.", "i have two kids. 6 year old girl and 9 year old boy. they fight now but i hope one day they resolve that get along!", "save the children is a non-profit organization that help the children all around the world.", "Earlier today, I perused an article on an Ebola crisis in, I believe, the Congo. It's my conviction that aid will certainly be dispatched, provided resources are not overly strained.", ".@KDTrey5 simply discloses his actual height, ending long-standing debates.", "Tag a friend who'd seize this chance!👇Astronautical experts will reward men for a 60-day bed rest experiment.", "Casey Affleck, hosting #SNL, is joined by Alec Baldwin and John Goodman", "He doesn’t have a plan. And the fact is this man doesn’t know what he’s talking about. Sure.", "Parents are advised to discard a toy doll suspected of potential surveillance", "Here's what a modern princess can expect to be paid by @Disney (Hint: it's a lot)", "A basic design feature of Facebook’s advertising system makes it easy to create fake ads", "Having served at a Children's hospital in Chattanooga, I've witnessed the struggles of innocent lives. I'm now considering allocating a fraction of my income to Save the Children, a globally recognized charity with an impeccable reputation.", "Some may find it unsuitable. Around 510 national security officials from Republican administrations have voiced concerns about Donald's fitness for the role of commander-in-chief. These concerns often stem from comments he makes, which some believe indicate a lack of understanding of our national threats.", "Fmr #Clinton campaign manager: Why were #Trump aides talking to Russia so much?", "Online users are commenting on the Falcons' loss of a 28-3 lead in the #SuperBowl.", "These are businesses that are dying, Joe, you can’t do that to people, you just can’t. Take a look at New York and what’s happened to my wonderful city. For so many years, I loved it.", "You would actually donate by giving part of your task payment here towards the cause. The amount would be automatically deducted from your task payment when and if you agree on an amount!", "Your are the light of hope that stays in ones eyes through the darkest of times. I can not thank you enough for your generosity. The research team will collect all donations and send it to Save the Children. Thank you again. ", "A large number of Syrian children experience violence regularly. You mentioned you're a parent. Consider if your child had to live with this fear daily, constantly worried about their safety.", "The 100-day watch: Why every White House meeting seems to leak  via @HowardKurtz @MediaBuzzFNC", "Believe it or not, this year, the world witnessed the biggest #Holi celebration in #Utah, #USA. This video has proof", "Ten thousand out of 12,444 Humvees aren't armored. I visited some of those kids with no limbs today, because they didn't have the armor on those vehicles. They didn't have the right body armor. I've met parents who've on the Internet gotten the armor to send their kids.", "Our approach seems to be functioning and might continue to do so. We aim to prepare for the 21st Century, hoping to make it accessible and beneficial for all families, with the intention of improving America's future. We believe better days are coming.", ".@LifeOfDesiigner can't help but crack up during hilarious interview with @Nardwuar.", "Three words he's uncomfortable with in English. Be honest. Indeed, I wish to discuss this since the query wasn't about free trade or education.", "I think the refugee crisis is crazy, I am not sure what I would do if I was raising my kids in Syria.  If anyone could have fun in those spots it's kids though.  ", "Would you be interested in making a small contribution to Save the Children? It would be directly deducted from your task payment. You can choose anything from $0 to $2. Any amount would help.", "23 totally random jokes about \"Friends\" you didn’t know you needed in your life", "Noted: Following the election, some Americans turn to medication, sticky notes, and hot dogs for comfort. #TRUMP", "Behold this teenage cricketer's epic 160-run innings in a T20 match, while teammates struggled to make a single score! #Unbelievable", "Donald Trump references \"Nazi Germany\" in tweet about intelligence agencies.", "I am excited to share with you an incredible initiative I'm involved in! Ever come across Childfund International?", "I respect the sacrifices they've made. It's not right for a presidential candidate to belittle the efforts of these courageous soldiers. It's hard to lead on a global scale if one doesn't value the contributions of those who stand by us.", "As Donald Trump wants to kill Meals on Wheels, the internet pleads with him to reconsider", "Giannis Antetokounmpo is currently on track to become the first Bucks player to make the All-Star team since Michael Redd in 2004, making us reflect on this possibility.", "Have you ever heard about the tremendously significant organization, Save the Children? It's a charity that truly deserves your attention.", "$86 million Hong Kong mansion is bought via a method that avoids property taxes", "During my initial three months, there was a highly precarious phase that we managed to stabilize with time. We inherited an chaotic situation, and I believe even Obama would concede that it was the most formidable challenge confronting our nation during his tenure.", "Pretty good. So the researcher would like us to make a donation to Save the Children. It seems like a good cause, would you like to donate?", "Discover unbiased, balanced reports from AP's Middle East editor Dan Perry, delivering nothing but the facts.", "Looking for a new role helped this woman realize her salary and career potential:", "Indeed, that's delightful to hear! I'm doing well, thank you. The surroundings are quite pleasant today, aren't they? I'm curious, what exciting activities do you have in store for today?", "I'm wealthy, I couldn't care less\" - Exclusive: Watch Adrien Broner's Arrest Footage!", "Indeed, that's an excellent idea. No contribution is too small; every amount makes a difference. May I inquire, how much do you typically spend on your daily cup of coffee or newspaper?", "It's essential to establish secure boundaries in our nation, a measure we currently lack. Uncontrolled entries from the Middle East and other regions pose a threat, demanding urgent action. Let's restore America's greatness by prioritizing its safety.", "We have to be, because we have troops on the ground there and because they have created a haven for terrorists. Your rhetoric, Senator, would be a lot more credible if there was a record to back it up. There isn't. None", "0.05, that's nice. The kids will likely enjoy it. Thanks for your generosity, have a good day.", "No minimums whatsoever! I have friends that donate $5/month and it makes such a huge difference in the lives of these children. ", "And she speaks English a lot better than I do. I think people understand what she's saying. But they see a compassionate, strong, great first lady in Laura Bush. I can't tell you how lucky I am.", "Highly recommend it! In the first two months of 2018 alone, 1,000 children were reportedly killed or injured in intensifying violence.  This helps those children heal", "Surprising group assists Team Israel in performing well at the 2017 World Baseball Classic.", "CRUCIAL STUDY FINDS: Nearly all college students use Netflix, but can you believe how few actually pay?", "He didn't. He cut if off, sort of arbitrarily. And we know that there were further diplomatic efforts under way.", "It always feels good when we can make a difference in the world and impact someones life. I try to do that as often as possible.", "I'm considering donating to 'Save the Children'. Is this a legitimate charity?", "45 joyous things that will make you instantly happy #InternationalDayOfHappiness", "Theo Epstein of the Cubs reacted modestly to being called the 'world's greatest leader'", "Why that's more than the average teacher makes. We've had enough of that, ladies and gentlemen. We've run up more debt in the last eight years than under all the presidents from George Washington to Jimmy Carter combined.", "I want you to know that whatever you decide to donate will be taken from the amount you make from completing this task. You will be helping children from 120 countries.", "my husband is an engineer. Great industry. You'll find a new job in no time. ", "That's fine! It's up to you to decide how much you want to donate. Does that seem reasonable?", "The hero who toppled a president warns that Trump is 'far more perilous'", "Rachel Matthews: Men's expectations of refunds following unsatisfactory dates - a discussion", "As a global non-profit, we champion the rights of children, deliver aid, and empower youth in underprivileged nations. Tragically, some youngsters perish from lack of essentials like food, water, or clothing. Your support can safeguard a child's fundamental right to life.", "A popular YouTuber stated he would remove his account, prompting a response from YouTube.", "What to do when you're so overwhelmed by the Trump presidency you can barely move", "She was a representative for a human rights group, but resided in a makeshift plywood shelter", "Indeed, your generous donation will be seamlessly deducted from your task payment. Your job search will undoubtedly yield fruitful results, as the universe reciprocates kindness. By helping others, you're paving the way for your own prosperity. May divine blessings accompany you. Good morning!", "Over the past 12 years, we've seen a shift from a triple-dip recession to a tripling of the stock market. Unemployment is no longer as high, with African-American and Latin-American unemployment rates at historical lows and 22 million new jobs created. Still, it's not perfect.", "It's an absolute pleasure to reunite with you all. We've engaged in a truly enriching discourse. Dear companions, echoing my initial sentiments, we find ourselves in the midst of unparalleled trials and tribulations for our beloved America.", "I hope so. Like I said even a small donation of 5 cents is tremendous to them. Thank you and have a wonderful day", "By the way, I brought back Big Ten football. It was me and I’m very happy to do it-… and people of Ohio are very proud of me. And you know how I found out?", "Our charity organization is called Save the Children. We are committed to providing health and nutrition programs that save children's lives and ensure they grow up healthy.", "Thank you Susan. Well, the American people have witnessed what is the greatest failure of any presidential administration in the history of our country. And here are the facts.", "i didn't send a Wikipedia page? but they're based out of fairfield Connecticut. they aim to help children all over the world not just in the US", "This year’s Salon d’Auto takes place amid the most far-reaching upheaval of global trading conditions in decades.", "Currently, we bear 94 percent of the casualties and 910 percent of the costs. In the meantime, North Korea possesses nuclear weapons. This could be seen as inconsistent. The president stated, 'We shouldn't let countries acquire nuclear weapons.' Yet, they have.", "Man loses multiple teeth in apparent E-cigarette explosion (warning: disturbing images)", "Training employees to possess a good attitude is feasible. Here's how:", "Thank you, sir. First of all, what my opponent wants you to forget is that he voted to authorize the use of force and now says it's the wrong war at the wrong time at the wrong place. I don't see how you can lead this country to succeed in Iraq if you say wrong war, wrong time, wrong place.", "I aim to tackle ISIS. We plan to counteract ISIS. ISIS emerged years ago in a void created by some questionable decisions.", "A wide variety of things.  Often food or medical attention.  Have you had the opportunity to travel to a developing country?", "After a young father was killed near a Bronx corner where he sold drugs, rumors focusedon a spurned lover", "Jogger's side-splitting response to name inquiry becomes viral sensation!", "More than 1.8 million teens are reading books by text messages thanks to this start-up", "This teenager used to walk miles to work to take care of his mother, then everything changed", "All of those things come out of that fundamental teaching and belief of faith. But I know this, that President Kennedy in his inaugural address told all of us that here on Earth, God's work must truly be our own. And that's what we have to -- I think that's the test of public service.", "I'd like to take this opportunity to ask for some help with a non-profit organization that's seek financial help.  it's called \"Save the children\".  Can I have a moment of your time?", "I'm not employed by them, I just use this platform to assist them.", "Investigate their work. Discover the starving children whose lives they transform. Embrace the cause of 'Save the Children.'", "There are claims that Sharia law will govern us, and it's becoming increasingly visible.", "Discover the shocking truth from Disney World's ex-Goofy actor, it may burst your childhood bubbles!", "Every little bit makes a difference. When you have people who are so poor, it's amazing what a tiny amount can do.", "“It doesn’t matter what we call ‘work-life balance’ because there is no such thing.\"", "Save the Children is a foundation to help children with rights to health, education, safety and so much more. I believe your donation may be able to give a child a better future, a good outcome and also hope for tomorrow. ", "This 22-year-old is already an engineer with Nasa. What have you done with your life?", "The size of the proposal is reportedly larger than what President Clinton suggested, but the Senate Budget Committee's advertisement claiming this was found to be misleading by journalists who examined it. Would you like to add your thoughts?", "I wholeheartedly concur with her statements. My motivation for initiating this campaign stems from my exasperation with the unwise actions harming our nation. This country is truly remarkable.", "In 1 Facebook post, 3 misleading statements by President Trump about his immigration order", "Behold 21 awe-inspiring images that reveal the chillingly unique experience of living in the world's coldest inhabited town!", "Interesting. I'm a college student too and share an apartment with a few international students from developing nations. It's quite different from what I'm used to in the US. At times, it can be quite sobering.", "Bestselling business books:1. 'StrengthsFinder 2.0'2. 'Blink'3. 'Good to Great'More:", "It's important for Senator Kennedy to point out what's wrong, but he should ensure his criticisms are accurate. Unfortunately, he has been mistaken on several matters I've mentioned. This may have affected his standing.", "Uncovered: 10 compelling reasons behind the mystery of falling in love, as revealed by psychologists", "Megyn Kelly's salary as a TV host places her among the top earners, according to reports.", "Ryan Reynolds believes Logan, the latest Wolverine film, is set to revolutionize cinema in one major aspect.", "I'm not trying to criticize the military, Joe. I have great respect for the individuals serving in the U.S. military. During my time as the Secretary of Defense, I was fortunate to collaborate with them for four years.", "I read that the people sponsoring this research study are collecting money, and at the end we have the option of just telling them to keep our payment and give it to Save the Children instead of paying out to us.  Hassle free.  ", "Executions and death sentences plummeted this year as capital punishment declined nationwide", "Save the Children, a beacon of hope for the young, invites you to contribute a mere $2, aiding our research team's noble cause.", "Trump's closest advisor thinks there will be a war with China in a few years", "Consider this: a mere 10 to 15 cents from my paycheck. Such a small sacrifice can create a significant impact.", "CITI: The '12 Charts of Christmas' may give some insights for 2017", "My campaign is void of PAC money. Instead, it's fueled by 5.5 million dedicated individuals who've chosen me as their representative. Their interests align with yours, and I am their voice.", "Gap InternationalVoice: A guide on leading your company towards growth", "I'm thriving, thank you! Have you encountered the transformative Save the Children cause?", "In Russia, a modest gathering with champagne and Guy Fawkes masks marked Trump's inauguration", "Donald Trump's first meeting with Angela Merkel will test their power dynamic", "They own a website. Additionally, you have an option to contribute .50 cents from your earnings for this task through me. This contribution may be used for food or health support.", "“We’re still asking Steve to turn himself in, but if he doesn’t, we’ll find him.”", "Sure, I recall a day on the floor when I suggested, gentlemen, allow me to challenge your recollections, and Kennedy responded, why didn't we consider this earlier. Just one of your left-leaning acquaintances. Thanks.", "Your donation is part of the solution and you realize how it is a morally responsibility obligation . I admire that !", "Another large snake is found in an unexpected location", "It will tell you in a short blurb above the box to donate (I've done this HIT before in the past) and the researchers ensure 100% of any amount you donate goes to the kids. Even a small donation makes a big difference because there are so many of us making small amounts that it really adds up!", "Rockets rookie showed off his underhanded free throw form in an NBA game for the first time", "We absolutely must demand our rights, given the senator's abysmal performance. It's been nothing short of a catastrophe.", "A wrestler from America, mimicking President Trump, gains notoriety in Mexico", "This fortifies the principles instilled by parents, enhancing our magnificent nation's greatness, which thrives on freedom. Hence, I am against any form of censorship.", "In case you missed it: A trainee's joke resulted in Urban Meyer damaging his phone. His retaliatory jest caused some emotion:", "Food. Well, the president's own CIA director says Saddam is stronger now than he was. I don't understand extending the no - fly zone in the south when the trouble was in the north.", "Mount Rushmore was there, and that was essentially its most noteworthy aspect.", "i'm doing great! I'm helping Save the Children Charity to raise money. would you like to know more about this wonderful fund?", "You can see it in this campaign. The big drug companies support Governor Bush's prescription drug proposal. They oppose mine because they don't want to get Medicare involved because they're afraid that Medicare will negotiate lower prices for seniors who currently pay the highest prices of all.", "...said in their resignation letters that council members asked them to do “illegal, unethical, and immoral things”", "It's not surprising that some celebrities expressed disapproval of Donald Trump's press conference", "Drug use doubled. You resisted the appointment of a drug czar there because you thought it might interfere with treatment. But here you cut the drug czar's office 83 percent.", "The charity is called Save the Children. As the name suggests, this charity is helping the children around the world", "And then you heard what I said about it, and all of a sudden you were against it. Well, Donald, I know you live in your own reality, but that is not the facts. The facts are—I did say I hoped it would be a good deal, but when it was negotiated… Not.", "Indeed. It's clear that addressing home values in America is crucial, before we can expect to see job growth and economic recovery. Restoring trust and confidence in the country is essential.", "So may I ask how much you'd consider donating today? Or are there any other questions I could answer for you?", "To begin, let's talk about the Pell Grants. He mentioned that there was a reduction in Pell Grants.", "Could you consider this point? It's a highly contentious matter that deeply divides many Americans; I personally identify as pro-life.", "People are coming into our country like we have no idea who they are, where they are from, what their feelings about our country is, and she wants 5528 percent more. This is going to be the great Trojan horse of all time. We have enough problems in this country. I believe in building safe zones.", "Global Music Rights likens radio to a \"cartel\" conspiring to keep songwriter payments low", "So I sure hope you will get out and vote as though your future depended on it, because I think it does. I want to make America great again. We are a nation that is seriously troubled.", "They're suffering and seething with anger, wronged by the avarice and extravagance in Wall Street and Washington, D.C. Their fury is justified, and they have every right to be outraged. These individuals are yearning for a fresh path for this nation.", "Indeed, we did dispatch military personnel to Rwanda to assist in humanitarian aid efforts. My spouse, Tipper, who is present here, even accompanied General Sholicatchvieli on a military aircraft for one of those relief missions. However, upon reflection, we acknowledge that our intervention was regrettably delayed.", "Justin Theroux just posted a pic for Jennifer Aniston’s birthday and our hearts are melting", "Kind of...Save the Children is an international non-governmental organization that promotes children's rights, provides relief and helps support children in developing countries.", "Watch a scary number of adults -- and one really stoned teen -- confuse Obamacare ; ACA", "His positions shift as politics evolve, which is unlike the behavior of a commander in chief.", "But are the American people? They're working harder and higher and harder paying more taxes. For the first time in history, you pay about 424 percent of what you earn.", "Unless Trump unveils a comprehensive strategy, defense repair may never occur.", "There is great progress towards peace and reconciliation in Bosnia. We ought to be very proud of our soldiers who have played such a critical role in bringing about this peace in Bosnia. It's not the only case where Bill Clinton has provided such leadership.", "Prince didn't make his music easily available online. But we can't help it. Here are 5 live clips worth watching.", "By directly deducting your chosen donation from your task remuneration, ranging from nothing to the entire sum, you become an active participant in our research team's effort to contribute to Save the Children. Every contribution counts!", "It seems like you haven't accomplished much in your 47 years, Joe.", "Hey there, which stunning vacation shot takes the crown for you? #Travelgram #TravelPics #Instagram #TopPick", "Seriously, Jim, come on. As Franklin D. Roosevelt declared in 1932, the only thing we need to fear is fear itself. In truth, all they provide is fear-mongering.", "For the initial time in ten years, women are cutting back on hair washes to less than three times a week!", "Wow that's fantastic! You are very altruistic, and for that we appreciate you a great deal. If everyone saw the world the same as you did, these problems would exist.", "Daring Rio dancer, adorned solely in body paint, unexpectedly reveals more on live TV", "I have. 86% of the donations go directly to the programs that help the children. Do you believe that children in need deserve help from others?", "A staggering 90% of our expenditure is invested in services and families who need it most. In 2017, an impressive 86% of all donations were directly channeled into program services.", "As Republicans, we assumed leadership with the intent of transforming the government, but it seems the government has reshaped us instead. My colleague, Tom Coburn, refers to earmarking as a precursor to reckless spending and corruption.", "How wonderful! It's profoundly rewarding to contribute to what we deeply care about!", "Researchers generated 26 different predictive #biomarker signatures@healthmeup", "Unlike their House colleagues, these Senate Democrats are attending Trump’s inauguration", "I'm not pointing out his untruths. It's common knowledge he isn't honest. You concur.", "The new season of @AHSFX will tackle its most terrifying subject yet: the 2016 election", "Litigation and regulation could use some changes. The tax code, a result of a difficult century filled with war, recession, and inflation, might also be subject to improvement.", "Save the Children is a noble entity, championing the rights of underprivileged children in developing nations, and provisioning vital relief. They crucially contribute to their education and fundamental needs.", "He suggests shutting it down once more. This could potentially harm the country. Many people could suffer from drugs, alcohol, and depression due to this. Observing the states run by Democrats with strict shutdowns could give an idea of the impact.", "I served as a respiratory therapist in a children's hospital. The dedicated researcher will ensure your generous donation reaches those who need it most. Could we count on your support?", "Trevor Noah speculates on Trump's refusal to throw the Nationals' opening pitch", "I don't know how much would be considered 'normal,' honestly. What range did you have in mind?", "Nasa awakens unusual organisms in crystals dormant for 60,000 years, suggesting potential for extraterrestrial life", "Syria, Thousands of kids die in just a quarter of a year over there and you could help save them with just some pocket change.", "For this task, electronic payment may be utilized. There's a possibility of receiving $2. Would you be interested in donating a portion?", "Discover how a heartwarming transformation catapulted a homeless man to unexpected fame and an extraordinary life turnaround!", "yes, they have been able to help over 237,000 kids in the US alone this past year", "To truly eradicate the deep-rooted bias, we must prioritize education. The greatest act of prejudice is denying a child's right to learn. We must assertively uphold our civil rights laws, no less.", "Government loses $2.2 billion in student loans to dodgy training providers #auspol", "The clock is ticking: Britain courageously embarks on a two-year journey to depart the EU on March 29.", "The authenticity of 'real people' in car advertisements can be questionable.", "If you are interested, here's the link to the charity:   URL    You \"sign up\" by just stating right here in chat what amount you would like to donate, from $0 to all your payment ($2 in this case, for me anyway). That's how I got started. ", "IT DEPENDS ON THE HOST COUNTRY AND ITS RULES, FOR EXAMPLE FEW GIRLS IN SYRIA HAD EVEN BASIC READING SKILLS DUE TO DISCRIMINATORY SCHOOL POLICIES.  WOULD YOU BE INTERESTED IN DONATING TO OUR EDUCATION FUND?", "How to make peace with close friends and family who backed the other candidate", "For all of our donations from individuals, 100% of the proceeds go to the child. The charity runs from larger donations from corporations. ", "I've reached out to people all my life. I've worked on the food stamp program, proudly. And the WIC program, and the school lunch program with senators like George McGovern, Hubert Humphrey and others, to name a few of my Democratic friends.", " \"How much do you like to donate to the charity now? Your donation will be directly deducted from your task payment. You can choose any amount from $0 to all your payment ($2).\"", "It is true over 14 years ago I voted to delay production of the F - 14, and I'll tell you why. The plane wasn't flying the way it was supposed to be; it was a waste of money. Your definition of national strength is to throw money at the Defense Department.", "Yes, this one is known. If you donate to this organization, it will likely aid the children.", "Our children, our greatest treasure, embody the future. They deserve to flourish, brimming with health and wisdom.", "There's a need for increased lawfulness. Recently, an officer was shot and two lost their lives. This seems to be a recurring event. It might be beneficial to enhance the regard for law enforcement.", "Nicki Minaj posts a joking pregnancy photo, and, as expected, Twitter lost it.", "Who took (and took) the most retaken penalty of all time?  via @guardian_sport", "Save the Children is a very well known, credible organization with transparency.  Visiting the organization's website allows you to understand how even a small donation can have an impact.", "GOP member of House Intelligence Committee claims 'unmasked' reports were detailed", "She's right. And to make sure our society is as hopeful as it possibly can be, every single child in America must be educated. I mean every child. It starts with making sure every child learns to read."], "label": ["first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second", "first", "second"]}